#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AffiliateKeyModal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AffiliateKeyModal.AffiliateKeyModal_C
// 0x00B8 (0x0560 - 0x04A8)
class UAffiliateKeyModal_C final  : public UFortAffilateModal
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SuccessAnim;                                       // 0x04B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Shake;                                             // 0x04B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Check;                                             // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      CloseButton;                                       // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCloseButton_C*                         CloseButton_Mobile;                                // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_0;                                 // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_2;                                 // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ConnectionError;                                   // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Description;                                       // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    EditTextActionWidget;                              // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       EntryError;                                        // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ErrorPart2;                                        // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      LaunchWebsite;                                     // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULightbox_C*                            Lightbox;                                          // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 McpWaitingSpinner;                                 // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Warning;                                           // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Found;                                             // 0x0530(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ConnectionTimeout;                                 // 0x0531(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C95[0x6];                                     // 0x0532(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnPopupClosed;                                     // 0x0538(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bSkipAutoPopulate;                                 // 0x0548(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_6C96[0x7];                                     // 0x0549(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnSuccess;                                         // 0x0550(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void SetupAffiliateField(const class FString& AffilateName, class FText CallFunc_Conv_StringToText_ReturnValue);
	void SetMobileButtons(bool Temp_bool_Variable, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, bool CallFunc_IsUsingTouch_ReturnValue, ESlateVisibility K2Node_Select_Default);
	void BP_OnActivated();
	void BndEvt__CloseButton_K2Node_ComponentBoundEvent_21_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__AcceptButton_K2Node_ComponentBoundEvent_26_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnSet(bool bSuccess);
	void BndEvt__IconTextButton_C_0_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnCheckComplete(bool bSuccess, bool bWasValidAffiliateName, const class FString& AffilateNameChecked);
	void OnInputModeChanged(bool bUsingGamepad);
	void Construct();
	void BndEvt__CloseButton_Mobile_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void WidgetAnimationEvt_SuccessAnim_K2Node_WidgetAnimationEvent_1();
	void ExecuteUbergraph_AffiliateKeyModal(int32 EntryPoint, class UFortMcpContext* CallFunc_GetContext_ReturnValue, bool Temp_bool_Variable, class FString& CallFunc_GetAffiliateName_ReturnValue, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, class UFortMcpContext* CallFunc_GetContext_ReturnValue_1, class UFortMcpContext* CallFunc_GetContext_ReturnValue_2, class FString& CallFunc_GetAffiliateName_ReturnValue_1, class UCommonButton* K2Node_ComponentBoundEvent_Button_3, class UCommonButton* K2Node_ComponentBoundEvent_Button_2, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue, class UFortMcpContext* CallFunc_GetContext_ReturnValue_3, class UFortRuntimeOptions* CallFunc_GetRuntimeOptions_ReturnValue, class FString& CallFunc_GetAffiliateName_ReturnValue_2, TArray<class FString>& CallFunc_GetValidAffiliateNames_ReturnValue, class FText CallFunc_Conv_StringToText_ReturnValue, bool K2Node_CustomEvent_bSuccess_1, TDelegate<void(bool bSuccess)> K2Node_CreateDelegate_OutputDelegate, class UCommonButton* K2Node_ComponentBoundEvent_Button_1, class UFortMcpContext* CallFunc_GetContext_ReturnValue_4, class FText CallFunc_GetText_ReturnValue, ESlateVisibility Temp_byte_Variable_2, class FText CallFunc_GetText_ReturnValue_1, const class FString& CallFunc_Conv_TextToString_ReturnValue, int32 CallFunc_Array_Find_ReturnValue, class UFortRuntimeOptions* CallFunc_GetRuntimeOptions_ReturnValue_1, bool CallFunc_GreaterEqual_IntInt_ReturnValue, class FText CallFunc_Conv_StringToText_ReturnValue_1, class UFortRuntimeOptions* CallFunc_GetRuntimeOptions_ReturnValue_2, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array, class FText CallFunc_Format_ReturnValue, bool CallFunc_CanLaunchURL_ReturnValue, class UFortRuntimeOptions* CallFunc_GetRuntimeOptions_ReturnValue_3, int32 CallFunc_Len_ReturnValue, class FText CallFunc_GetText_ReturnValue_2, bool CallFunc_Greater_IntInt_ReturnValue, const class FString& CallFunc_Conv_TextToString_ReturnValue_1, ESlateVisibility K2Node_Select_Default, class UFortRuntimeOptions* CallFunc_GetRuntimeOptions_ReturnValue_4, ESlateVisibility Temp_byte_Variable_3, class FText CallFunc_GetText_ReturnValue_3, const class FString& CallFunc_Conv_TextToString_ReturnValue_2, bool CallFunc_EqualEqual_StrStr_ReturnValue, bool Temp_bool_Variable_1, TDelegate<void(bool bSuccess, bool bWasValidAffiliateName, const class FString& AffilateNameChecked)> K2Node_CreateDelegate_OutputDelegate_1, ESlateVisibility K2Node_Select_Default_1, class FText CallFunc_GetText_ReturnValue_4, const class FString& CallFunc_Conv_TextToString_ReturnValue_3, class UFortRuntimeOptions* CallFunc_GetRuntimeOptions_ReturnValue_5, bool K2Node_CustomEvent_bSuccess, bool K2Node_CustomEvent_bWasValidAffiliateName, const class FString& K2Node_CustomEvent_AffilateNameChecked, class FText CallFunc_GetText_ReturnValue_5, const class FString& CallFunc_Conv_TextToString_ReturnValue_4, bool CallFunc_EqualEqual_StrStr_ReturnValue_1, class FText CallFunc_GetText_ReturnValue_6, const class FString& CallFunc_Conv_TextToString_ReturnValue_5, bool CallFunc_EqualEqual_StrStr_ReturnValue_2, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue_1, bool K2Node_Event_bUsingGamepad, class UCommonButton* K2Node_ComponentBoundEvent_Button);
	void OnSuccess__DelegateSignature();
	void OnPopupClosed__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AffiliateKeyModal_C">();
	}
	static class UAffiliateKeyModal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAffiliateKeyModal_C>();
	}
};
static_assert(alignof(UAffiliateKeyModal_C) == 0x000008, "Wrong alinment on UAffiliateKeyModal_C");
static_assert(sizeof(UAffiliateKeyModal_C) == 0x000560, "Wrong size on UAffiliateKeyModal_C");
static_assert(offsetof(UAffiliateKeyModal_C, UberGraphFrame) == 0x0004A8, "Member 'UAffiliateKeyModal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, SuccessAnim) == 0x0004B0, "Member 'UAffiliateKeyModal_C::SuccessAnim' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, Shake) == 0x0004B8, "Member 'UAffiliateKeyModal_C::Shake' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, Check) == 0x0004C0, "Member 'UAffiliateKeyModal_C::Check' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, CloseButton) == 0x0004C8, "Member 'UAffiliateKeyModal_C::CloseButton' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, CloseButton_Mobile) == 0x0004D0, "Member 'UAffiliateKeyModal_C::CloseButton_Mobile' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, CommonTextBlock_0) == 0x0004D8, "Member 'UAffiliateKeyModal_C::CommonTextBlock_0' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, CommonTextBlock_2) == 0x0004E0, "Member 'UAffiliateKeyModal_C::CommonTextBlock_2' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, ConnectionError) == 0x0004E8, "Member 'UAffiliateKeyModal_C::ConnectionError' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, Description) == 0x0004F0, "Member 'UAffiliateKeyModal_C::Description' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, EditTextActionWidget) == 0x0004F8, "Member 'UAffiliateKeyModal_C::EditTextActionWidget' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, EntryError) == 0x000500, "Member 'UAffiliateKeyModal_C::EntryError' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, ErrorPart2) == 0x000508, "Member 'UAffiliateKeyModal_C::ErrorPart2' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, LaunchWebsite) == 0x000510, "Member 'UAffiliateKeyModal_C::LaunchWebsite' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, Lightbox) == 0x000518, "Member 'UAffiliateKeyModal_C::Lightbox' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, McpWaitingSpinner) == 0x000520, "Member 'UAffiliateKeyModal_C::McpWaitingSpinner' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, Warning) == 0x000528, "Member 'UAffiliateKeyModal_C::Warning' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, Found) == 0x000530, "Member 'UAffiliateKeyModal_C::Found' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, ConnectionTimeout) == 0x000531, "Member 'UAffiliateKeyModal_C::ConnectionTimeout' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, OnPopupClosed) == 0x000538, "Member 'UAffiliateKeyModal_C::OnPopupClosed' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, bSkipAutoPopulate) == 0x000548, "Member 'UAffiliateKeyModal_C::bSkipAutoPopulate' has a wrong offset!");
static_assert(offsetof(UAffiliateKeyModal_C, OnSuccess) == 0x000550, "Member 'UAffiliateKeyModal_C::OnSuccess' has a wrong offset!");

}

