#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimNotify_PlayFX_WeapType

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AnimNotify_PlayFX_WeapType.AnimNotify_PlayFX_WeapType_C
// 0x0028 (0x0060 - 0x0038)
class UAnimNotify_PlayFX_WeapType_C final  : public UAnimNotify
{
public:
	class FString                                 Socket;                                            // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FRotator                               Rotation;                                          // 0x0048(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                Location;                                          // 0x0054(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool Received_Notify(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, class UGameUserSettings* CallFunc_GetGameUserSettings_ReturnValue, const struct FVector& CallFunc_GetSocketLocation_ReturnValue, int32 CallFunc_GetVisualEffectQuality_ReturnValue, float CallFunc_BreakVector_X, float CallFunc_BreakVector_Y, float CallFunc_BreakVector_Z, bool K2Node_SwitchInteger_CmpSuccess, const struct FVector& CallFunc_GetSocketLocation_ReturnValue_1, class AActor* CallFunc_GetOwner_ReturnValue, float CallFunc_BreakVector_X_1, float CallFunc_BreakVector_Y_1, float CallFunc_BreakVector_Z_1, class AFortPlayerPawn* K2Node_DynamicCast_AsFort_Player_Pawn, bool K2Node_DynamicCast_bSuccess, const struct FVector& CallFunc_MakeVector_ReturnValue, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue, class AB_Melee_Generic_C* K2Node_DynamicCast_AsB_Melee_Generic, bool K2Node_DynamicCast_bSuccess_1, const struct FRotator& CallFunc_Conv_VectorToRotator_ReturnValue, float CallFunc_BreakRotator_Roll, float CallFunc_BreakRotator_Pitch, float CallFunc_BreakRotator_Yaw, bool CallFunc_EqualEqual_ObjectObject_ReturnValue, const struct FRotator& CallFunc_MakeRotator_ReturnValue, bool CallFunc_EqualEqual_ObjectObject_ReturnValue_1, class UParticleSystemComponent* CallFunc_SpawnEmitterAtLocation_ReturnValue, bool CallFunc_BooleanOR_ReturnValue, struct FTransform& CallFunc_GetTransform_ReturnValue, const struct FVector& CallFunc_BreakTransform_Location, const struct FRotator& CallFunc_BreakTransform_Rotation, const struct FVector& CallFunc_BreakTransform_Scale, class FName CallFunc_Conv_StringToName_ReturnValue, class UParticleSystemComponent* CallFunc_SpawnEmitterAttached_ReturnValue) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AnimNotify_PlayFX_WeapType_C">();
	}
	static class UAnimNotify_PlayFX_WeapType_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_PlayFX_WeapType_C>();
	}
};
static_assert(alignof(UAnimNotify_PlayFX_WeapType_C) == 0x000008, "Wrong alinment on UAnimNotify_PlayFX_WeapType_C");
static_assert(sizeof(UAnimNotify_PlayFX_WeapType_C) == 0x000060, "Wrong size on UAnimNotify_PlayFX_WeapType_C");
static_assert(offsetof(UAnimNotify_PlayFX_WeapType_C, Socket) == 0x000038, "Member 'UAnimNotify_PlayFX_WeapType_C::Socket' has a wrong offset!");
static_assert(offsetof(UAnimNotify_PlayFX_WeapType_C, Rotation) == 0x000048, "Member 'UAnimNotify_PlayFX_WeapType_C::Rotation' has a wrong offset!");
static_assert(offsetof(UAnimNotify_PlayFX_WeapType_C, Location) == 0x000054, "Member 'UAnimNotify_PlayFX_WeapType_C::Location' has a wrong offset!");

}

