#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ApplyMedkit_Athena_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ApplyMedkit_Athena_AnimBP.ApplyMedkit_Athena_AnimBP_C
// 0x0310 (0x0670 - 0x0360)
class UApplyMedkit_Athena_AnimBP_C final  : public UFortItemAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimInstanceSubsystemData             AnimBlueprintClassSubsystem_PropertyAccess;        // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5870[0x7];                                     // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0370(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x03A0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x03E8(0x0078)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum;                     // 0x0460(0x00B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0510(0x00C8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x05D8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x0620(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0648(0x0028)()

public:
	void ExecuteUbergraph_ApplyMedkit_Athena_AnimBP(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ApplyMedkit_Athena_AnimBP_C">();
	}
	static class UApplyMedkit_Athena_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UApplyMedkit_Athena_AnimBP_C>();
	}
};
static_assert(alignof(UApplyMedkit_Athena_AnimBP_C) == 0x000010, "Wrong alinment on UApplyMedkit_Athena_AnimBP_C");
static_assert(sizeof(UApplyMedkit_Athena_AnimBP_C) == 0x000670, "Wrong size on UApplyMedkit_Athena_AnimBP_C");
static_assert(offsetof(UApplyMedkit_Athena_AnimBP_C, UberGraphFrame) == 0x000360, "Member 'UApplyMedkit_Athena_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UApplyMedkit_Athena_AnimBP_C, AnimBlueprintClassSubsystem_PropertyAccess) == 0x000368, "Member 'UApplyMedkit_Athena_AnimBP_C::AnimBlueprintClassSubsystem_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UApplyMedkit_Athena_AnimBP_C, AnimGraphNode_Root) == 0x000370, "Member 'UApplyMedkit_Athena_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UApplyMedkit_Athena_AnimBP_C, AnimGraphNode_Slot_1) == 0x0003A0, "Member 'UApplyMedkit_Athena_AnimBP_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UApplyMedkit_Athena_AnimBP_C, AnimGraphNode_SequencePlayer) == 0x0003E8, "Member 'UApplyMedkit_Athena_AnimBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UApplyMedkit_Athena_AnimBP_C, AnimGraphNode_BlendListByEnum) == 0x000460, "Member 'UApplyMedkit_Athena_AnimBP_C::AnimGraphNode_BlendListByEnum' has a wrong offset!");
static_assert(offsetof(UApplyMedkit_Athena_AnimBP_C, AnimGraphNode_SaveCachedPose) == 0x000510, "Member 'UApplyMedkit_Athena_AnimBP_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UApplyMedkit_Athena_AnimBP_C, AnimGraphNode_Slot) == 0x0005D8, "Member 'UApplyMedkit_Athena_AnimBP_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UApplyMedkit_Athena_AnimBP_C, AnimGraphNode_UseCachedPose_1) == 0x000620, "Member 'UApplyMedkit_Athena_AnimBP_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UApplyMedkit_Athena_AnimBP_C, AnimGraphNode_UseCachedPose) == 0x000648, "Member 'UApplyMedkit_Athena_AnimBP_C::AnimGraphNode_UseCachedPose' has a wrong offset!");

}

