#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Athena_Prop_CoolCarpet

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Athena_Prop_SneakySnowmanV2_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Athena_Prop_CoolCarpet.Athena_Prop_CoolCarpet_C
// 0x0060 (0x0D28 - 0x0CC8)
class AAthena_Prop_CoolCarpet_C final  : public AAthena_Prop_SneakySnowmanV2_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Athena_Prop_CoolCarpet_C;           // 0x0CC8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_ShadowInsert;                                   // 0x0CD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CoolCarpet_Flap2;                               // 0x0CD8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CoolCarpet_Flap1;                               // 0x0CE0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         OpenFlaps_Rotation_FDF331244F066E298266B69ACE6D4998; // 0x0CE8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            OpenFlaps__Direction_FDF331244F066E298266B69ACE6D4998; // 0x0CEC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F66[0x3];                                     // 0x0CED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     OpenFlaps;                                         // 0x0CF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RandMatInt;                                        // 0x0CF8(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MatIntOverride;                                    // 0x0CFC(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         CanHideInProp;                                     // 0x0D00(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_Athena_Prop_CoolCarpet(int32 EntryPoint, int32 Temp_int_Variable, class UMaterial* Temp_object_Variable, class UMaterial* Temp_object_Variable_1, class UMaterial* Temp_object_Variable_2, float CallFunc_Multiply_FloatFloat_ReturnValue, float CallFunc_Multiply_FloatFloat_ReturnValue_1, const struct FRotator& CallFunc_MakeRotator_ReturnValue, const struct FRotator& CallFunc_MakeRotator_ReturnValue_1, const struct FRotator& CallFunc_MakeRotator_ReturnValue_2, bool K2Node_SwitchEnum_CmpSuccess, const struct FRotator& CallFunc_MakeRotator_ReturnValue_3, const struct FRotator& CallFunc_MakeRotator_ReturnValue_4, TArray<class AActor*>& Temp_object_Variable_3, int32 CallFunc_GetMaterialInt_MatInt, class AFortPawn* K2Node_Event_InteractingPawn, EInteractionBeingAttempted K2Node_Event_InteractionBeingAttempted, class UMaterial* K2Node_Select_Default, class UAbilitySystemComponent* CallFunc_GetAbilitySystemComponent_ReturnValue, const struct FActiveGameplayEffectHandle& CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue, const struct FHitResult& CallFunc_K2_SetRelativeRotation_SweepHitResult, const struct FHitResult& CallFunc_K2_SetRelativeRotation_SweepHitResult_1, float CallFunc_GetGameTimeInSeconds_ReturnValue, const struct FHitResult& CallFunc_K2_SetRelativeRotation_SweepHitResult_2, const struct FHitResult& CallFunc_K2_SetRelativeRotation_SweepHitResult_3, const struct FHitResult& CallFunc_K2_SetRelativeRotation_SweepHitResult_4, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, const struct FVector& CallFunc_GetActorForwardVector_ReturnValue, const struct FVector& CallFunc_Add_VectorVector_ReturnValue, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue, const struct FHitResult& CallFunc_LineTraceSingle_OutHit, bool CallFunc_LineTraceSingle_ReturnValue, bool CallFunc_BreakHitResult_bBlockingHit, bool CallFunc_BreakHitResult_bInitialOverlap, float CallFunc_BreakHitResult_Time, float CallFunc_BreakHitResult_Distance, const struct FVector& CallFunc_BreakHitResult_Location, const struct FVector& CallFunc_BreakHitResult_ImpactPoint, const struct FVector& CallFunc_BreakHitResult_Normal, const struct FVector& CallFunc_BreakHitResult_ImpactNormal, class UPhysicalMaterial* CallFunc_BreakHitResult_PhysMat, class AActor* CallFunc_BreakHitResult_HitActor, class UPrimitiveComponent* CallFunc_BreakHitResult_HitComponent, class FName CallFunc_BreakHitResult_HitBoneName, int32 CallFunc_BreakHitResult_HitItem, int32 CallFunc_BreakHitResult_ElementIndex, int32 CallFunc_BreakHitResult_FaceIndex, const struct FVector& CallFunc_BreakHitResult_TraceStart, const struct FVector& CallFunc_BreakHitResult_TraceEnd, const struct FVector& CallFunc_ProjectVectorOnToPlane_ReturnValue, const struct FVector& CallFunc_Normal_ReturnValue, const struct FRotator& CallFunc_MakeRotFromXZ_ReturnValue, bool CallFunc_K2_SetActorRotation_ReturnValue);
	void ReceiveBeginPlay();
	void CloseFlaps();
	void OpenFlapsMulticast();
	void BlueprintOnInteract(class AFortPawn* InteractingPawn, EInteractionBeingAttempted InteractionBeingAttempted);
	void OpenFlaps__UpdateFunc();
	void OpenFlaps__FinishedFunc();
	void UserConstructionScript(const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, float CallFunc_VSize_ReturnValue, bool CallFunc_GreaterEqual_IntInt_ReturnValue, int32 CallFunc_FTrunc_ReturnValue, int32 CallFunc_Percent_IntInt_ReturnValue, bool CallFunc_HasAuthority_ReturnValue);
	void GetMaterialInt(int32* MatInt, bool CallFunc_GreaterEqual_IntInt_ReturnValue, int32 CallFunc_SelectInt_ReturnValue);
	void OnRep_MatIntOverride(int32 Temp_int_Variable, class UMaterial* Temp_object_Variable, class UMaterial* Temp_object_Variable_1, class UMaterial* Temp_object_Variable_2, int32 CallFunc_GetMaterialInt_MatInt, class UMaterial* K2Node_Select_Default);

	bool BlueprintCanInteract(class AFortPawn* InteractingPawn, EInteractionBeingAttempted InteractionBeingAttempted, ETInteractionType InteractionType, const struct FGameplayTagContainer& CallFunc_MakeLiteralGameplayTagContainer_ReturnValue, bool CallFunc_BlueprintCanInteract_ReturnValue, TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput, bool CallFunc_HasAnyMatchingGameplayTags_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_RowToBool_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_BooleanAND_ReturnValue_1) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Athena_Prop_CoolCarpet_C">();
	}
	static class AAthena_Prop_CoolCarpet_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAthena_Prop_CoolCarpet_C>();
	}
};
static_assert(alignof(AAthena_Prop_CoolCarpet_C) == 0x000008, "Wrong alinment on AAthena_Prop_CoolCarpet_C");
static_assert(sizeof(AAthena_Prop_CoolCarpet_C) == 0x000D28, "Wrong size on AAthena_Prop_CoolCarpet_C");
static_assert(offsetof(AAthena_Prop_CoolCarpet_C, UberGraphFrame_Athena_Prop_CoolCarpet_C) == 0x000CC8, "Member 'AAthena_Prop_CoolCarpet_C::UberGraphFrame_Athena_Prop_CoolCarpet_C' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_CoolCarpet_C, SM_ShadowInsert) == 0x000CD0, "Member 'AAthena_Prop_CoolCarpet_C::SM_ShadowInsert' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_CoolCarpet_C, SM_CoolCarpet_Flap2) == 0x000CD8, "Member 'AAthena_Prop_CoolCarpet_C::SM_CoolCarpet_Flap2' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_CoolCarpet_C, SM_CoolCarpet_Flap1) == 0x000CE0, "Member 'AAthena_Prop_CoolCarpet_C::SM_CoolCarpet_Flap1' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_CoolCarpet_C, OpenFlaps_Rotation_FDF331244F066E298266B69ACE6D4998) == 0x000CE8, "Member 'AAthena_Prop_CoolCarpet_C::OpenFlaps_Rotation_FDF331244F066E298266B69ACE6D4998' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_CoolCarpet_C, OpenFlaps__Direction_FDF331244F066E298266B69ACE6D4998) == 0x000CEC, "Member 'AAthena_Prop_CoolCarpet_C::OpenFlaps__Direction_FDF331244F066E298266B69ACE6D4998' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_CoolCarpet_C, OpenFlaps) == 0x000CF0, "Member 'AAthena_Prop_CoolCarpet_C::OpenFlaps' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_CoolCarpet_C, RandMatInt) == 0x000CF8, "Member 'AAthena_Prop_CoolCarpet_C::RandMatInt' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_CoolCarpet_C, MatIntOverride) == 0x000CFC, "Member 'AAthena_Prop_CoolCarpet_C::MatIntOverride' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_CoolCarpet_C, CanHideInProp) == 0x000D00, "Member 'AAthena_Prop_CoolCarpet_C::CanHideInProp' has a wrong offset!");

}

