#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaPlayerLevelCompact

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaPlayerLevelCompact.AthenaPlayerLevelCompact_C
// 0x0020 (0x02F0 - 0x02D0)
class UAthenaPlayerLevelCompact_C final  : public UAthenaPlayerLevelDisplay
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_ProgressBar;                                 // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             LevelChanged;                                      // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnUpdateRewardIcon(class UFortItem* RewardItem, TSoftObjectPtr<class UTexture2D>& RewardTexture, bool bHasAdditionalStylesToDisplay, int32 RewardLevel, bool bRequiresBattlePass);
	void OnUpdateXpBar(float Progress, bool bIsMaxLevel);
	void ExecuteUbergraph_AthenaPlayerLevelCompact(int32 EntryPoint, float K2Node_Event_Progress, bool K2Node_Event_bIsMaxLevel, class UFortItem* K2Node_Event_RewardItem, TSoftObjectPtr<class UTexture2D> K2Node_Event_RewardTexture, bool K2Node_Event_bHasAdditionalStylesToDisplay, int32 K2Node_Event_RewardLevel, bool K2Node_Event_bRequiresBattlePass, class UMaterialInstanceDynamic* CallFunc_GetDynamicMaterial_ReturnValue, bool CallFunc_IsValid_ReturnValue);
	void LevelChanged__DelegateSignature(int32 Level);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaPlayerLevelCompact_C">();
	}
	static class UAthenaPlayerLevelCompact_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaPlayerLevelCompact_C>();
	}
};
static_assert(alignof(UAthenaPlayerLevelCompact_C) == 0x000008, "Wrong alinment on UAthenaPlayerLevelCompact_C");
static_assert(sizeof(UAthenaPlayerLevelCompact_C) == 0x0002F0, "Wrong size on UAthenaPlayerLevelCompact_C");
static_assert(offsetof(UAthenaPlayerLevelCompact_C, UberGraphFrame) == 0x0002D0, "Member 'UAthenaPlayerLevelCompact_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaPlayerLevelCompact_C, Image_ProgressBar) == 0x0002D8, "Member 'UAthenaPlayerLevelCompact_C::Image_ProgressBar' has a wrong offset!");
static_assert(offsetof(UAthenaPlayerLevelCompact_C, LevelChanged) == 0x0002E0, "Member 'UAthenaPlayerLevelCompact_C::LevelChanged' has a wrong offset!");

}

