#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaLobbyMatchmakingPlay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaLobbyMatchmakingPlay.AthenaLobbyMatchmakingPlay_C
// 0x00E8 (0x0598 - 0x04B0)
class UAthenaLobbyMatchmakingPlay_C final  : public UFortAthenaMatchmakingWidgetLegacy
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowMatchmakingDetails;                            // 0x04B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NewModeViolation;                                  // 0x04C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UAthenaGenericLobbyViolator_C*          AthenaGenericLobbyViolator;                        // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          Border_BasePanel;                                  // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Box_LimitedMatchmaking;                            // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      DebugCreativeServerSelect;                         // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MatchmakingSpinner;                                // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          NewModeBorder;                                     // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShowdownLobbyViolator_C*               ShowdownLobbyViolator;                             // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_FillStatus;                                   // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_ModeTitle;                                    // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               ViolatorContent;                                   // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        ViolatorSwitcher;                                  // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             PlaylistsUpdated;                                  // 0x0520(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FTimerHandle                           ShowNewPlaylistTimer;                              // 0x0530(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnPlaylistChanged;                                 // 0x0538(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class USoundBase*                             MatchmakingSucceededSound;                         // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   CreativeOptionsSoftClass;                          // 0x0550(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UClass*                                 CreativeOptionsClass;                              // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SquadFill;                                         // 0x0580(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75C4[0x7];                                     // 0x0581(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPlaylistAthena*                    PlaylistData;                                      // 0x0588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsShowingMatchmakingDetails;                       // 0x0590(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void SetBasePanelColor(const struct FLinearColor& NewColor, class UMaterialInstanceDynamic* CallFunc_GetDynamicMaterial_ReturnValue);
	void RefreshFillText(class UFortMatchmakingContext* CallFunc_GetContext_ReturnValue, class FText CallFunc_GetMatchmakingFillText_ReturnValue);
	void OnLoaded_7F9C59BE40E65C1C31B0EB98786CDA43(class UClass* Loaded);
	void Construct();
	void OnAvailablePlaylistsUpdated();
	void OnSetPlayButtonText(class FText& PlayButtonText);
	void OnSetCancelButtonText(class FText& CancelButtonText);
	void PlaylistChanged(struct FPlaylistFrontEndData& NewPlaylist, class FText& PlaylistCMSOverrideName, EFortLobbyType LobbyType);
	void SetSquadFillText(bool InCurrentSquadFill);
	void OnNewModeViolatorUpdated(bool bShouldShow);
	void UpdateCustomViolatorText(class FText& ModeName, class FText& SubText);
	void Animate();
	void OnMatchmakingFinishedBlueprint(bool bSuccess, class UFortPlaylistAthena* Playlist);
	void BndEvt__PlayButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void OnInitialized();
	void OnCrossplayPreferencesChanged(bool IsCrossplayEnabled);
	void ShouldShowMatchmakingDetails(bool bShow);
	void ExecuteUbergraph_AthenaLobbyMatchmakingPlay(int32 EntryPoint, EFortMatchmakingViolatorStyle Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, bool Temp_bool_Variable, ESlateVisibility Temp_byte_Variable_2, ESlateVisibility Temp_byte_Variable_3, class UFortGlobalUIContext* CallFunc_GetLocalPlayerSubsystem_ReturnValue, class UFortGlobalUIContext* CallFunc_GetLocalPlayerSubsystem_ReturnValue_1, bool CallFunc_IsInZone_ReturnValue, bool CallFunc_IsInZone_ReturnValue_1, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue_1, int32 Temp_int_Loop_Counter_Variable, class UCMSContext* CallFunc_GetContext_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, bool CallFunc_IsNewPlaylistInformationAvailable_ReturnValue, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable_1, int32 CallFunc_Add_IntInt_ReturnValue_1, int32 Temp_int_Array_Index_Variable_1, ESlateVisibility Temp_byte_Variable_4, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, class UAthenaMatchmakingPlayButton_C* K2Node_DynamicCast_AsAthena_Matchmaking_Play_Button, bool K2Node_DynamicCast_bSuccess, class USoloButton_C* K2Node_DynamicCast_AsSolo_Button, bool K2Node_DynamicCast_bSuccess_1, class FText K2Node_Event_PlayButtonText, class FText K2Node_Event_CancelButtonText, struct FPlaylistFrontEndData& K2Node_Event_NewPlaylist, class FText K2Node_Event_PlaylistCMSOverrideName, EFortLobbyType K2Node_Event_LobbyType, bool K2Node_Event_InCurrentSquadFill, bool CallFunc_TextIsEmpty_ReturnValue, bool K2Node_Event_bShouldShow, class FText K2Node_Event_ModeName, class FText K2Node_Event_SubText, bool Temp_bool_Variable_1, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue, class UFortRuntimeOptions* CallFunc_GetRuntimeOptions_ReturnValue, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, bool CallFunc_K2_IsValidTimerHandle_ReturnValue, ESlateVisibility Temp_byte_Variable_5, bool K2Node_SwitchEnum_CmpSuccess, ESlateVisibility Temp_byte_Variable_6, class UWidget* K2Node_Select_Default, bool Temp_bool_Variable_2, class UFortCrossplayPromptContext* CallFunc_GetContext_ReturnValue_1, class UFortCrossplayPromptContext* CallFunc_GetContext_ReturnValue_2, bool K2Node_Event_bSuccess, class UFortPlaylistAthena* K2Node_Event_Playlist, bool CallFunc_EqualEqual_IntInt_ReturnValue, bool CallFunc_BooleanOR_ReturnValue, class UAudioComponent* CallFunc_CreateSound2D_ReturnValue, ESlateVisibility K2Node_Select_Default_1, class UCommonButton* K2Node_ComponentBoundEvent_Button, const struct FGeometry& K2Node_Event_MyGeometry, float K2Node_Event_InDeltaTime, bool Temp_bool_Variable_3, bool K2Node_CustomEvent_IsCrossplayEnabled, bool CallFunc_Not_PreBool_ReturnValue_2, class FText K2Node_Select_Default_2, TDelegate<void(bool IsCrossplayEnabled)> K2Node_CreateDelegate_OutputDelegate_1, bool CallFunc_IsPlaylistLimitedPoolMatchmakingEnabled_ReturnValue, bool CallFunc_NotEqual_ObjectObject_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, ESlateVisibility K2Node_Select_Default_3, bool K2Node_Event_bShow, class UUMGSequencePlayer* CallFunc_PlayAnimationReverse_ReturnValue, ESlateVisibility K2Node_Select_Default_4, class UUMGSequencePlayer* CallFunc_PlayAnimationForward_ReturnValue, bool CallFunc_EqualEqual_BoolBool_ReturnValue, bool CallFunc_AreModalsActive_ReturnValue, class UClass* Temp_class_Variable, TArray<class AActor*>& CallFunc_GetAllActorsWithInterface_OutActors, class UClass* K2Node_ClassDynamicCast_AsUser_Widget, bool K2Node_ClassDynamicCast_bSuccess, class AActor* CallFunc_Array_Get_Item, TScriptInterface<class II_FrontendBackplateMatchmakingInteraction_C> K2Node_DynamicCast_AsI_Frontend_Backplate_Matchmaking_Interaction, bool K2Node_DynamicCast_bSuccess_2, TScriptInterface<class II_FrontendBackplateMatchmakingInteraction_C> K2Node_DynamicCast_AsI_Frontend_Backplate_Matchmaking_Interaction_1, bool K2Node_DynamicCast_bSuccess_3, bool CallFunc_HasMatcmakingInteraction_HasInteraction, bool CallFunc_IsValid_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, TArray<class AActor*>& CallFunc_GetAllActorsWithInterface_OutActors_1, class AActor* CallFunc_Array_Get_Item_1, int32 CallFunc_Array_Length_ReturnValue_1, TScriptInterface<class II_FrontendBackplateMatchmakingInteraction_C> K2Node_DynamicCast_AsI_Frontend_Backplate_Matchmaking_Interaction_2, bool K2Node_DynamicCast_bSuccess_4, bool CallFunc_Less_IntInt_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_1, TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate_2, class UClass* K2Node_CustomEvent_Loaded);
	void OnPlaylistChanged__DelegateSignature(const struct FPlaylistFrontEndData& Playlist_Data, class FText Playlist_CMS_Override, EFortLobbyType Lobby_Type);
	void PlaylistsUpdated__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaLobbyMatchmakingPlay_C">();
	}
	static class UAthenaLobbyMatchmakingPlay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaLobbyMatchmakingPlay_C>();
	}
};
static_assert(alignof(UAthenaLobbyMatchmakingPlay_C) == 0x000008, "Wrong alinment on UAthenaLobbyMatchmakingPlay_C");
static_assert(sizeof(UAthenaLobbyMatchmakingPlay_C) == 0x000598, "Wrong size on UAthenaLobbyMatchmakingPlay_C");
static_assert(offsetof(UAthenaLobbyMatchmakingPlay_C, UberGraphFrame) == 0x0004B0, "Member 'UAthenaLobbyMatchmakingPlay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyMatchmakingPlay_C, ShowMatchmakingDetails) == 0x0004B8, "Member 'UAthenaLobbyMatchmakingPlay_C::ShowMatchmakingDetails' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyMatchmakingPlay_C, NewModeViolation) == 0x0004C0, "Member 'UAthenaLobbyMatchmakingPlay_C::NewModeViolation' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyMatchmakingPlay_C, AthenaGenericLobbyViolator) == 0x0004C8, "Member 'UAthenaLobbyMatchmakingPlay_C::AthenaGenericLobbyViolator' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyMatchmakingPlay_C, Border_BasePanel) == 0x0004D0, "Member 'UAthenaLobbyMatchmakingPlay_C::Border_BasePanel' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyMatchmakingPlay_C, Box_LimitedMatchmaking) == 0x0004D8, "Member 'UAthenaLobbyMatchmakingPlay_C::Box_LimitedMatchmaking' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyMatchmakingPlay_C, DebugCreativeServerSelect) == 0x0004E0, "Member 'UAthenaLobbyMatchmakingPlay_C::DebugCreativeServerSelect' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyMatchmakingPlay_C, MatchmakingSpinner) == 0x0004E8, "Member 'UAthenaLobbyMatchmakingPlay_C::MatchmakingSpinner' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyMatchmakingPlay_C, NewModeBorder) == 0x0004F0, "Member 'UAthenaLobbyMatchmakingPlay_C::NewModeBorder' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyMatchmakingPlay_C, ShowdownLobbyViolator) == 0x0004F8, "Member 'UAthenaLobbyMatchmakingPlay_C::ShowdownLobbyViolator' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyMatchmakingPlay_C, Text_FillStatus) == 0x000500, "Member 'UAthenaLobbyMatchmakingPlay_C::Text_FillStatus' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyMatchmakingPlay_C, Text_ModeTitle) == 0x000508, "Member 'UAthenaLobbyMatchmakingPlay_C::Text_ModeTitle' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyMatchmakingPlay_C, ViolatorContent) == 0x000510, "Member 'UAthenaLobbyMatchmakingPlay_C::ViolatorContent' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyMatchmakingPlay_C, ViolatorSwitcher) == 0x000518, "Member 'UAthenaLobbyMatchmakingPlay_C::ViolatorSwitcher' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyMatchmakingPlay_C, PlaylistsUpdated) == 0x000520, "Member 'UAthenaLobbyMatchmakingPlay_C::PlaylistsUpdated' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyMatchmakingPlay_C, ShowNewPlaylistTimer) == 0x000530, "Member 'UAthenaLobbyMatchmakingPlay_C::ShowNewPlaylistTimer' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyMatchmakingPlay_C, OnPlaylistChanged) == 0x000538, "Member 'UAthenaLobbyMatchmakingPlay_C::OnPlaylistChanged' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyMatchmakingPlay_C, MatchmakingSucceededSound) == 0x000548, "Member 'UAthenaLobbyMatchmakingPlay_C::MatchmakingSucceededSound' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyMatchmakingPlay_C, CreativeOptionsSoftClass) == 0x000550, "Member 'UAthenaLobbyMatchmakingPlay_C::CreativeOptionsSoftClass' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyMatchmakingPlay_C, CreativeOptionsClass) == 0x000578, "Member 'UAthenaLobbyMatchmakingPlay_C::CreativeOptionsClass' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyMatchmakingPlay_C, SquadFill) == 0x000580, "Member 'UAthenaLobbyMatchmakingPlay_C::SquadFill' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyMatchmakingPlay_C, PlaylistData) == 0x000588, "Member 'UAthenaLobbyMatchmakingPlay_C::PlaylistData' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyMatchmakingPlay_C, IsShowingMatchmakingDetails) == 0x000590, "Member 'UAthenaLobbyMatchmakingPlay_C::IsShowingMatchmakingDetails' has a wrong offset!");

}

