#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaDirectAcquisitionOfferPurchasedOverlay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaDirectAcquisitionOfferPurchasedOverlay.AthenaDirectAcquisitionOfferPurchasedOverlay_C
// 0x0190 (0x0900 - 0x0770)
class UAthenaDirectAcquisitionOfferPurchasedOverlay_C final  : public UFortPurchaseOverlayModal
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0770(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SuccessfullyRefundedBundleItem;                    // 0x0778(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Refunded;                                          // 0x0780(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Purchased___Bundle_Item__Minus_FAST;               // 0x0788(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Successfully_Purchased___Bundle_Item_;             // 0x0790(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Bundle_Blur__out_;                                 // 0x0798(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Bundle_Blur__loop_;                                // 0x07A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Purchased___Bundle_Item_;                          // 0x07A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Purchased_;                                        // 0x07B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                BorderItemNAme;                                    // 0x07B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HBoxMiniCards1;                                    // 0x07C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HBoxMiniCards2;                                    // 0x07C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HBoxMiniCards3;                                    // 0x07D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HBoxMiniCards4;                                    // 0x07D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageRarityFlare;                                  // 0x07E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortCosmeticItemCard_C*                ItemCard;                                          // 0x07E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlayMainItem;                                   // 0x07F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RarityGlow;                                        // 0x07F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBoxMiniBundleItems;                            // 0x0800(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextName;                                          // 0x0808(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Bundle_Item_Index;                                 // 0x0810(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BundleMiniGrid_Minus_Column;                       // 0x0814(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BundleMiniGrid_Minus_Row;                          // 0x0818(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E53[0x4];                                     // 0x081C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortReceivedItemLootInfo              Fort_Received_Loot_Info_Struct;                    // 0x0820(0x00C8)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UBundleItemMiniCardWidget_C*>    Bundle_Mini_Item_Cards;                            // 0x08E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          BundleBlurPlayed;                                  // 0x08F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void Mini_Bundle_Item_Location(int32 Param_Bundle_Item_Index, class UHorizontalBox** HBox_Row, int32 Bundle_Item_Index__local_, int32 Temp_int_Variable, int32 Temp_int_Variable_1, TArray<struct FPurchasedItemInfo>& CallFunc_GetPurchasedItems_ReturnValue, TArray<struct FPurchasedItemInfo>& CallFunc_GetPurchasedItems_ReturnValue_1, int32 CallFunc_Array_Length_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_EqualEqual_IntInt_ReturnValue, bool CallFunc_GreaterEqual_IntInt_ReturnValue, float CallFunc_SelectFloat_ReturnValue, float CallFunc_Conv_IntToFloat_ReturnValue, float CallFunc_FMod_Remainder, int32 CallFunc_FMod_ReturnValue, class UHorizontalBox* K2Node_Select_Default, class UHorizontalBox* K2Node_Select_Default_1);
	void Bundle_Item_Anim_Speed(float* Speed, TArray<struct FPurchasedItemInfo>& CallFunc_GetPurchasedItems_ReturnValue, int32 CallFunc_Array_LastIndex_ReturnValue, bool CallFunc_GreaterEqual_IntInt_ReturnValue, bool CallFunc_EqualEqual_IntInt_ReturnValue, float CallFunc_SelectFloat_ReturnValue, float CallFunc_SelectFloat_ReturnValue_1);
	void Get_Bundle_Info_from_Item_Def(class UFortAccountItemDefinition* Item_Definition, struct FBundledItemInfo* Bundled_Item_Info, bool* bFoundItem, class UFortAccountItemDefinition* Item_Definition__local_, const struct FBundledItemInfo& Bundled_Item_Info__local_, bool bFoundItem__local_, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, bool Temp_bool_True_if_break_was_hit_Variable, const class FString& CallFunc_GetPersistentName_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, class UFortStoreFrontOfferInfo* CallFunc_GetOfferInfo_ReturnValue, TArray<struct FBundledItemInfo>& CallFunc_GetDynamicBundleItems_Items, const struct FBundledItemInfo& CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_EqualEqual_StrStr_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_EqualEqual_IntInt_ReturnValue);
	void HandleBack(bool* PassThrough);
	void UpdateFromOffer(class UFortAccountItemDefinition* Item_Definition, int32 Grant_Quantity__local_, class UFortAccountItemDefinition* Item_Definition__local_, EFortRarity CallFunc_GetRarity_ReturnValue, const struct FFortRarityItemData& CallFunc_BPGetRarityData_ReturnValue, class UMaterialInstanceDynamic* CallFunc_GetDynamicMaterial_ReturnValue, class UMaterialInstanceDynamic* CallFunc_GetDynamicFontMaterial_ReturnValue, const struct FBundledItemInfo& CallFunc_Get_Bundle_Info_from_Item_Def_Bundled_Item_Info, bool CallFunc_Get_Bundle_Info_from_Item_Def_bFoundItem, class FText CallFunc_GetDisplayName_ReturnValue, class UMaterialInstanceDynamic* CallFunc_GetDynamicMaterial_ReturnValue_1, class FName CallFunc_MakeLiteralName_ReturnValue, class FName CallFunc_MakeLiteralName_ReturnValue_1, int32 CallFunc_GetQuantityPurchased_ReturnValue, bool CallFunc_HasMultipleItems_ReturnValue, int32 CallFunc_Multiply_IntInt_ReturnValue, class UFortItem* CallFunc_CreateTemporaryItemInstanceBP_ReturnValue, bool CallFunc_HasMultipleItems_ReturnValue_1, class UFortStoreFrontOfferInfo* CallFunc_GetOfferInfo_ReturnValue, bool Temp_bool_Variable, class FText CallFunc_GetItemTypeText_ReturnValue, class FText CallFunc_GetName_ReturnValue, class UFortStoreFrontOfferInfo* CallFunc_GetOfferInfo_ReturnValue_1, bool CallFunc_TextIsEmpty_ReturnValue, int32 CallFunc_GetGrantedItemQuantity_ReturnValue, class FText K2Node_Select_Default, class FText CallFunc_TextToUpper_ReturnValue);
	void WidgetAnimationEvt_Purchased__K2Node_WidgetAnimationEvent_0();
	void Show_Next_Item();
	void BundleBlurOut();
	void WidgetAnimationEvt_Purchased___Bundle_Item__K2Node_WidgetAnimationEvent_2();
	void WidgetAnimationEvt_Purchased___Bundle_Item__Minus_FAST_K2Node_WidgetAnimationEvent_1();
	void Populate_Bundle_MiniMinusCards();
	void Show_Bundle_Mini_Item_Card();
	void WidgetAnimationEvt_Refunded_K2Node_WidgetAnimationEvent_3();
	void InitBundleLayout();
	void BP_OnOfferSet();
	void Destruct();
	void ExecuteUbergraph_AthenaDirectAcquisitionOfferPurchasedOverlay(int32 EntryPoint, bool Temp_bool_Variable, bool Temp_bool_Variable_1, int32 Temp_int_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable, bool Temp_bool_Variable_2, class UHorizontalBox* CallFunc_Mini_Bundle_Item_Location_HBox_Row, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, bool Temp_bool_Variable_3, const struct FMargin& K2Node_MakeStruct_Margin, class UFortStoreFrontOfferInfo* CallFunc_GetOfferInfo_ReturnValue, class UFortAccountItemDefinition* CallFunc_GetGrantedItemDefinition_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_1, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue, float CallFunc_Bundle_Item_Anim_Speed_speed, float CallFunc_Bundle_Item_Anim_Speed_speed_1, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue_1, ESlateVisibility Temp_byte_Variable, float CallFunc_Bundle_Item_Anim_Speed_speed_2, bool CallFunc_Greater_FloatFloat_ReturnValue, class UUniformGridSlot* CallFunc_SlotAsUniformGridSlot_ReturnValue, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue_1, class UBundleItemMiniCardWidget_C* CallFunc_Create_ReturnValue, class UHorizontalBoxSlot* CallFunc_AddChildToHorizontalBox_ReturnValue, ESlateVisibility Temp_byte_Variable_1, int32 CallFunc_Array_Add_ReturnValue, bool Temp_bool_Variable_4, class UBundleItemMiniCardWidget_C* CallFunc_Array_Get_Item, bool CallFunc_Array_IsValidIndex_ReturnValue, TArray<struct FPurchasedItemInfo>& CallFunc_GetPurchasedItems_ReturnValue, bool CallFunc_IsLastItem_ReturnValue, TArray<struct FPurchasedItemInfo>& CallFunc_GetPurchasedItems_ReturnValue_1, class UFortItemDefinition* CallFunc_GetItemDefinitionBP_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, class UFortAccountItemDefinition* K2Node_DynamicCast_AsFort_Account_Item_Definition, bool K2Node_DynamicCast_bSuccess, bool CallFunc_GreaterEqual_IntInt_ReturnValue, TArray<struct FPurchasedItemInfo>& CallFunc_GetPurchasedItems_ReturnValue_2, const struct FPurchasedItemInfo& CallFunc_Array_Get_Item_1, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue, class UFortItemDefinition* CallFunc_GetItemDefinitionBP_ReturnValue_1, class UFortAccountItemDefinition* K2Node_DynamicCast_AsFort_Account_Item_Definition_1, bool K2Node_DynamicCast_bSuccess_1, bool CallFunc_ShouldShowAsRefund_ReturnValue, class UFortItem* CallFunc_CreateTemporaryItemInstanceBP_ReturnValue, class UWidgetAnimation* K2Node_Select_Default, bool CallFunc_ShouldShowAsRefund_ReturnValue_1, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue_2, bool CallFunc_ShouldShowAsRefund_ReturnValue_2, class UWidgetAnimation* K2Node_Select_Default_1, bool CallFunc_HasMultipleItems_ReturnValue, bool CallFunc_HasMultipleItems_ReturnValue_1, ESlateVisibility K2Node_Select_Default_2, bool CallFunc_HasMultipleItems_ReturnValue_2, bool CallFunc_HasMultipleItems_ReturnValue_3, class UFortAccountItemDefinition* K2Node_Select_Default_3, bool Temp_bool_Variable_5, bool CallFunc_Not_PreBool_ReturnValue, class UWidgetAnimation* K2Node_Select_Default_4, bool CallFunc_BooleanAND_ReturnValue, class UWidgetAnimation* K2Node_Select_Default_5, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue_3);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaDirectAcquisitionOfferPurchasedOverlay_C">();
	}
	static class UAthenaDirectAcquisitionOfferPurchasedOverlay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaDirectAcquisitionOfferPurchasedOverlay_C>();
	}
};
static_assert(alignof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C) == 0x000008, "Wrong alinment on UAthenaDirectAcquisitionOfferPurchasedOverlay_C");
static_assert(sizeof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C) == 0x000900, "Wrong size on UAthenaDirectAcquisitionOfferPurchasedOverlay_C");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, UberGraphFrame) == 0x000770, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, SuccessfullyRefundedBundleItem) == 0x000778, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::SuccessfullyRefundedBundleItem' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, Refunded) == 0x000780, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::Refunded' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, Purchased___Bundle_Item__Minus_FAST) == 0x000788, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::Purchased___Bundle_Item__Minus_FAST' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, Successfully_Purchased___Bundle_Item_) == 0x000790, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::Successfully_Purchased___Bundle_Item_' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, Bundle_Blur__out_) == 0x000798, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::Bundle_Blur__out_' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, Bundle_Blur__loop_) == 0x0007A0, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::Bundle_Blur__loop_' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, Purchased___Bundle_Item_) == 0x0007A8, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::Purchased___Bundle_Item_' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, Purchased_) == 0x0007B0, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::Purchased_' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, BorderItemNAme) == 0x0007B8, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::BorderItemNAme' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, HBoxMiniCards1) == 0x0007C0, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::HBoxMiniCards1' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, HBoxMiniCards2) == 0x0007C8, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::HBoxMiniCards2' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, HBoxMiniCards3) == 0x0007D0, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::HBoxMiniCards3' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, HBoxMiniCards4) == 0x0007D8, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::HBoxMiniCards4' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, ImageRarityFlare) == 0x0007E0, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::ImageRarityFlare' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, ItemCard) == 0x0007E8, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::ItemCard' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, OverlayMainItem) == 0x0007F0, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::OverlayMainItem' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, RarityGlow) == 0x0007F8, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::RarityGlow' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, SizeBoxMiniBundleItems) == 0x000800, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::SizeBoxMiniBundleItems' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, TextName) == 0x000808, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::TextName' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, Bundle_Item_Index) == 0x000810, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::Bundle_Item_Index' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, BundleMiniGrid_Minus_Column) == 0x000814, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::BundleMiniGrid_Minus_Column' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, BundleMiniGrid_Minus_Row) == 0x000818, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::BundleMiniGrid_Minus_Row' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, Fort_Received_Loot_Info_Struct) == 0x000820, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::Fort_Received_Loot_Info_Struct' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, Bundle_Mini_Item_Cards) == 0x0008E8, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::Bundle_Mini_Item_Cards' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, BundleBlurPlayed) == 0x0008F8, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::BundleBlurPlayed' has a wrong offset!");

}

