#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaMOTDTileMainPage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaMOTDTileMainPage.AthenaMOTDTileMainPage_C
// 0x00A8 (0x0C98 - 0x0BF0)
class UAthenaMOTDTileMainPage_C final  : public UFortAthenaMOTDTile
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BF0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnHover;                                           // 0x0BF8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnSelected;                                        // 0x0C00(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0C08(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_Details;                                    // 0x0C10(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_PipDisplay;                                 // 0x0C18(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLoadGuard*                       CommonLoadGuard_0;                                 // 0x0C20(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fill;                                              // 0x0C28(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_SelectedPointer;                             // 0x0C30(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_SelectedPointer_Shadow;                      // 0x0C38(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LoadingImage;                                      // 0x0C40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               LoadingImageOvr;                                   // 0x0C48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  LoadSwitcher;                                      // 0x0C50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              NewsItemScale;                                     // 0x0C58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Tile;                                      // 0x0C60(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bShowImageOnly;                                    // 0x0C68(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76F2[0x3];                                     // 0x0C69(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PreviewPipCount;                                   // 0x0C6C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnHoveredChanged;                                  // 0x0C70(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FLinearColor                           DefaultColor;                                      // 0x0C80(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_Font;                                          // 0x0C90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateDisplay(bool Temp_bool_Variable, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, ESlateVisibility K2Node_Select_Default);
	void ShowImageOnly(bool Temp_bool_Variable, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, ESlateVisibility K2Node_Select_Default);
	void PreConstruct(bool IsDesignTime);
	void OnMouseEnter(const struct FGeometry& MyGeometry, struct FPointerEvent& MouseEvent);
	void OnMouseLeave(struct FPointerEvent& MouseEvent);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void OnPopulateNews(struct FAthenaMOTDBase& NewsEntry);
	void BP_OnSelected();
	void BP_OnDeselected();
	void OnInitialized();
	void ExecuteUbergraph_AthenaMOTDTileMainPage(int32 EntryPoint, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, bool Temp_bool_Variable, bool K2Node_Event_IsDesignTime, const struct FGeometry& K2Node_Event_MyGeometry, struct FPointerEvent& K2Node_Event_MouseEvent_1, struct FPointerEvent& K2Node_Event_MouseEvent, bool CallFunc_IsListItemSelected_ReturnValue, class UUMGSequencePlayer* CallFunc_PlayAnimationReverse_ReturnValue, class UUMGSequencePlayer* CallFunc_PlayAnimationForward_ReturnValue, class UUMGSequencePlayer* CallFunc_PlayAnimationForward_ReturnValue_1, class UUMGSequencePlayer* CallFunc_PlayAnimationReverse_ReturnValue_1, bool K2Node_Event_bIsSelected, class UMaterialInstanceDynamic* CallFunc_GetDynamicMaterial_ReturnValue, class UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue, bool Temp_bool_Variable_1, ESlateVisibility K2Node_Select_Default, bool CallFunc_IsValid_ReturnValue, const struct FSlateColor& K2Node_MakeStruct_SlateColor, struct FAthenaMOTDBase& K2Node_Event_NewsEntry, const struct FLinearColor& CallFunc_Conv_ColorToLinearColor_ReturnValue, bool CallFunc_GetSelected_ReturnValue, const struct FLinearColor& K2Node_Select_Default_1, bool CallFunc_BooleanOR_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, const struct FFontOutlineSettings& K2Node_MakeStruct_FontOutlineSettings, const struct FSlateFontInfo& K2Node_MakeStruct_SlateFontInfo, const struct FTextBlockStyle& K2Node_MakeStruct_TextBlockStyle);
	void OnHoveredChanged__DelegateSignature(bool NewIsHovered);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaMOTDTileMainPage_C">();
	}
	static class UAthenaMOTDTileMainPage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaMOTDTileMainPage_C>();
	}
};
static_assert(alignof(UAthenaMOTDTileMainPage_C) == 0x000008, "Wrong alinment on UAthenaMOTDTileMainPage_C");
static_assert(sizeof(UAthenaMOTDTileMainPage_C) == 0x000C98, "Wrong size on UAthenaMOTDTileMainPage_C");
static_assert(offsetof(UAthenaMOTDTileMainPage_C, UberGraphFrame) == 0x000BF0, "Member 'UAthenaMOTDTileMainPage_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTileMainPage_C, OnHover) == 0x000BF8, "Member 'UAthenaMOTDTileMainPage_C::OnHover' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTileMainPage_C, OnSelected) == 0x000C00, "Member 'UAthenaMOTDTileMainPage_C::OnSelected' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTileMainPage_C, Intro) == 0x000C08, "Member 'UAthenaMOTDTileMainPage_C::Intro' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTileMainPage_C, Border_Details) == 0x000C10, "Member 'UAthenaMOTDTileMainPage_C::Border_Details' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTileMainPage_C, Border_PipDisplay) == 0x000C18, "Member 'UAthenaMOTDTileMainPage_C::Border_PipDisplay' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTileMainPage_C, CommonLoadGuard_0) == 0x000C20, "Member 'UAthenaMOTDTileMainPage_C::CommonLoadGuard_0' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTileMainPage_C, Fill) == 0x000C28, "Member 'UAthenaMOTDTileMainPage_C::Fill' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTileMainPage_C, Image_SelectedPointer) == 0x000C30, "Member 'UAthenaMOTDTileMainPage_C::Image_SelectedPointer' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTileMainPage_C, Image_SelectedPointer_Shadow) == 0x000C38, "Member 'UAthenaMOTDTileMainPage_C::Image_SelectedPointer_Shadow' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTileMainPage_C, LoadingImage) == 0x000C40, "Member 'UAthenaMOTDTileMainPage_C::LoadingImage' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTileMainPage_C, LoadingImageOvr) == 0x000C48, "Member 'UAthenaMOTDTileMainPage_C::LoadingImageOvr' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTileMainPage_C, LoadSwitcher) == 0x000C50, "Member 'UAthenaMOTDTileMainPage_C::LoadSwitcher' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTileMainPage_C, NewsItemScale) == 0x000C58, "Member 'UAthenaMOTDTileMainPage_C::NewsItemScale' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTileMainPage_C, SizeBox_Tile) == 0x000C60, "Member 'UAthenaMOTDTileMainPage_C::SizeBox_Tile' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTileMainPage_C, bShowImageOnly) == 0x000C68, "Member 'UAthenaMOTDTileMainPage_C::bShowImageOnly' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTileMainPage_C, PreviewPipCount) == 0x000C6C, "Member 'UAthenaMOTDTileMainPage_C::PreviewPipCount' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTileMainPage_C, OnHoveredChanged) == 0x000C70, "Member 'UAthenaMOTDTileMainPage_C::OnHoveredChanged' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTileMainPage_C, DefaultColor) == 0x000C80, "Member 'UAthenaMOTDTileMainPage_C::DefaultColor' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTileMainPage_C, MID_Font) == 0x000C90, "Member 'UAthenaMOTDTileMainPage_C::MID_Font' has a wrong offset!");

}

