#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Athena_Player_CoolCarpet

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "PopOutStates_structs.hpp"
#include "Athena_Player_SneakySnowmanV2_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Athena_Player_CoolCarpet.Athena_Player_CoolCarpet_C
// 0x0108 (0x0B30 - 0x0A28)
class AAthena_Player_CoolCarpet_C final  : public AAthena_Player_SneakySnowmanV2_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Athena_Player_CoolCarpet_C;         // 0x0A28(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_ShadowInsert;                                   // 0x0A30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CoolCarpet_Flap1;                               // 0x0A38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CoolCarpet_Flap2;                               // 0x0A40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         ShrinkBox_Rotation_B702562648A4C4CB590675BD0D3E005C; // 0x0A48(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ShrinkBox_Shrinkage_B702562648A4C4CB590675BD0D3E005C; // 0x0A4C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ShrinkBox__Direction_B702562648A4C4CB590675BD0D3E005C; // 0x0A50(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71C0[0x7];                                     // 0x0A51(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     ShrinkBox;                                         // 0x0A58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Grow_Box_Growth_53FD69EF4E6B5DECD0D74DBB0BDDAA26;  // 0x0A60(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Grow_Box__Direction_53FD69EF4E6B5DECD0D74DBB0BDDAA26; // 0x0A64(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71C1[0x3];                                     // 0x0A65(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Grow_Box;                                          // 0x0A68(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_1_Rotation_A659A2B4463C7B7008A67988DEB011BE; // 0x0A70(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_1__Direction_A659A2B4463C7B7008A67988DEB011BE; // 0x0A74(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71C2[0x3];                                     // 0x0A75(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_1;                                        // 0x0A78(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AlreadyJumpedOut;                                  // 0x0A80(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71C3[0x7];                                     // 0x0A81(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAthena_Fake_CoolCarpet_C*              CastedFakeActor;                                   // 0x0A88(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MovementEventsBound;                               // 0x0A90(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71C4[0x7];                                     // 0x0A91(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             OnFootstepSound;                                   // 0x0A98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             OnLandedSound;                                     // 0x0AA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             OnJumpedSound;                                     // 0x0AA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   HolsterId;                                         // 0x0AB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MatInt;                                            // 0x0AB8(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71C5[0x4];                                     // 0x0ABC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         PopOutOnWindUp;                                    // 0x0AC0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         AllowPopOut;                                       // 0x0AE8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Swimming_0;                                        // 0x0B10(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	EPopOutStates                                 PopState;                                          // 0x0B11(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FlapsClosed;                                       // 0x0B12(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71C6[0x5];                                     // 0x0B13(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           WindUpEndTimer;                                    // 0x0B18(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          PoppedFromWindUp;                                  // 0x0B20(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          DidWindUp;                                         // 0x0B21(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          PoppedFromStand;                                   // 0x0B22(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Firing;                                            // 0x0B23(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          FirePressed;                                       // 0x0B24(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71C7[0x3];                                     // 0x0B25(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           StopFiringTimer;                                   // 0x0B28(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Athena_Player_CoolCarpet(int32 EntryPoint, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, class ACharacter* CallFunc_GetCharacterOwner_ReturnValue, class UFortWeaponItemDefinition* CallFunc_GetWeaponData_ReturnValue, class ACharacter* CallFunc_GetCharacterOwner_ReturnValue_1, bool CallFunc_HasTag_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_GetIsTargeting_ReturnValue, TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput, bool CallFunc_HasMatchingGameplayTag_ReturnValue, bool CallFunc_BooleanOR_ReturnValue, TDelegate<void(class AFortWeapon* NewWeapon, class AFortWeapon* PrevWeapon)> K2Node_CreateDelegate_OutputDelegate_1, bool CallFunc_BooleanOR_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue, class UFortWeaponItemDefinition* CallFunc_GetWeaponData_ReturnValue_1, bool CallFunc_GetIsTargeting_ReturnValue_1, bool CallFunc_HasTag_ReturnValue_1, bool CallFunc_Not_PreBool_ReturnValue_1, float CallFunc_VSize_ReturnValue, const struct FRotator& CallFunc_K2_GetActorRotation_ReturnValue, bool CallFunc_Less_FloatFloat_ReturnValue, float CallFunc_BreakRotator_Roll, float CallFunc_BreakRotator_Pitch, float CallFunc_BreakRotator_Yaw, const struct FRotator& CallFunc_MakeRotator_ReturnValue, bool CallFunc_HasAuthority_ReturnValue, bool CallFunc_K2_SetActorRotation_ReturnValue, const struct FRotator& CallFunc_K2_GetActorRotation_ReturnValue_1, float CallFunc_Subtract_FloatFloat_ReturnValue, float CallFunc_BreakRotator_Roll_1, float CallFunc_BreakRotator_Pitch_1, float CallFunc_BreakRotator_Yaw_1, float CallFunc_Multiply_FloatFloat_ReturnValue, const struct FRotator& CallFunc_MakeRotator_ReturnValue_1, const struct FRotator& CallFunc_MakeRotator_ReturnValue_2, bool CallFunc_K2_SetActorRotation_ReturnValue_1, float CallFunc_Multiply_FloatFloat_ReturnValue_1, const struct FRotator& CallFunc_MakeRotator_ReturnValue_3, const struct FRotator& CallFunc_K2_GetActorRotation_ReturnValue_2, float CallFunc_BreakRotator_Roll_2, float CallFunc_BreakRotator_Pitch_2, float CallFunc_BreakRotator_Yaw_2, const struct FRotator& CallFunc_K2_GetActorRotation_ReturnValue_3, const struct FRotator& CallFunc_MakeRotator_ReturnValue_4, float CallFunc_BreakRotator_Roll_3, float CallFunc_BreakRotator_Pitch_3, float CallFunc_BreakRotator_Yaw_3, bool CallFunc_K2_SetActorRotation_ReturnValue_2, const struct FRotator& CallFunc_MakeRotator_ReturnValue_5, bool CallFunc_K2_SetActorRotation_ReturnValue_3, bool CallFunc_IsLocallyControlled_ReturnValue, float CallFunc_VSize_ReturnValue_1, bool CallFunc_Less_FloatFloat_ReturnValue_1, bool CallFunc_HasAuthority_ReturnValue_1, bool CallFunc_IsLocallyControlled_ReturnValue_1, const struct FVector& CallFunc_MakeVector_ReturnValue, const struct FVector& CallFunc_MakeVector_ReturnValue_1, class UFortWeaponItemDefinition* CallFunc_GetWeaponData_ReturnValue_2, bool CallFunc_HasTag_ReturnValue_2, bool CallFunc_Not_PreBool_ReturnValue_2, bool CallFunc_HasAuthority_ReturnValue_2, bool CallFunc_IsLocallyControlled_ReturnValue_2, TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_1, bool CallFunc_HasMatchingGameplayTag_ReturnValue_1, bool CallFunc_RowToBool_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue_3, bool CallFunc_Not_PreBool_ReturnValue_4, bool CallFunc_Not_PreBool_ReturnValue_5, bool CallFunc_BooleanAND_ReturnValue_1, TArray<struct FGameplayTag>& K2Node_MakeArray_Array, const struct FGameplayTagContainer& CallFunc_MakeGameplayTagContainerFromArray_ReturnValue, TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput, bool CallFunc_HasAnyMatchingGameplayTags_ReturnValue, class UFortWeaponItemDefinition* CallFunc_GetWeaponData_ReturnValue_3, bool CallFunc_Not_PreBool_ReturnValue_6, bool CallFunc_BooleanAND_ReturnValue_2, bool CallFunc_HasTag_ReturnValue_3, bool CallFunc_BooleanAND_ReturnValue_3, bool CallFunc_Not_PreBool_ReturnValue_7, bool CallFunc_BooleanAND_ReturnValue_4, bool CallFunc_BooleanAND_ReturnValue_5, bool CallFunc_BooleanAND_ReturnValue_6, const struct FHitResult& CallFunc_K2_SetRelativeRotation_SweepHitResult, bool K2Node_CustomEvent_AimDownSights, const struct FHitResult& CallFunc_K2_SetRelativeRotation_SweepHitResult_1, TDelegate<void(bool bIsTargeting)> K2Node_CreateDelegate_OutputDelegate_2, class AFortWeapon* K2Node_CustomEvent_NewWeapon, class AFortWeapon* K2Node_CustomEvent_PrevWeapon, bool CallFunc_IsValid_ReturnValue, float CallFunc_GetPlaybackPosition_ReturnValue, float K2Node_Event_Strength, bool K2Node_Event_MoveUpAndDown, float CallFunc_GetGameTimeInSeconds_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue_7, EEndPlayReason K2Node_Event_EndPlayReason, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_3, TDelegate<void(struct FHitResult& Hit)> K2Node_CreateDelegate_OutputDelegate_4, TDelegate<void(class ACharacter* Character, EMovementMode PrevMovementMode, uint8 PreviousCustomMode)> K2Node_CreateDelegate_OutputDelegate_5, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, class AAthena_Fake_CoolCarpet_C* K2Node_DynamicCast_AsAthena_Fake_Cool_Carpet, bool K2Node_DynamicCast_bSuccess, class AActor* K2Node_CustomEvent_Prop, class AAthena_Prop_CoolCarpet_C* K2Node_DynamicCast_AsAthena_Prop_Cool_Carpet, bool K2Node_DynamicCast_bSuccess_1, EPopOutStates K2Node_CustomEvent_PopState_3, EPopOutStates K2Node_CustomEvent_PopState_2, EPopOutStates K2Node_CustomEvent_PopState_1, bool K2Node_SwitchEnum_CmpSuccess, bool CallFunc_IsLocallyControlled_ReturnValue_3, const struct FVector& CallFunc_GetForwardVector_ReturnValue, const struct FRotator& CallFunc_Conv_VectorToRotator_ReturnValue, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue, const struct FVector& CallFunc_GetCrouchedLoc_ReturnValue, const struct FVector& CallFunc_Add_VectorVector_ReturnValue, class UFXSystemComponent* CallFunc_SpawnFXAtLocation_ReturnValue, bool CallFunc_HasAuthority_ReturnValue_3, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_6, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, class AController* CallFunc_GetController_ReturnValue, bool CallFunc_IsDedicatedServer_ReturnValue, class AController* CallFunc_GetController_ReturnValue_1, class UAbilitySystemComponent* CallFunc_GetAbilitySystemComponent_ReturnValue, const struct FActiveGameplayEffectHandle& CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue, bool CallFunc_IsWeaponHolstered_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue_8, class AController* CallFunc_GetController_ReturnValue_2, class UAbilitySystemComponent* CallFunc_GetAbilitySystemComponent_ReturnValue_1, class UAbilitySystemComponent* CallFunc_GetAbilitySystemComponent_ReturnValue_2, int32 CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue, const struct FActiveGameplayEffectHandle& CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_1, const struct FActiveGameplayEffectHandle& CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_2, const struct FActiveGameplayEffectHandle& CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_3, int32 CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue_1, bool CallFunc_Not_PreBool_ReturnValue_9, float K2Node_Event_DeltaSeconds, const struct FVector& K2Node_Event_OldLocation, const struct FVector& K2Node_Event_OldVelocity, TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_2, bool CallFunc_HasMatchingGameplayTag_ReturnValue_2, TDelegate<void(class AActor* DestroyedActor)> K2Node_CreateDelegate_OutputDelegate_7, float CallFunc_Multiply_FloatFloat_ReturnValue_2, float CallFunc_Add_FloatFloat_ReturnValue, const struct FVector& CallFunc_MakeVector_ReturnValue_2, bool CallFunc_RowToBool_ReturnValue_1, bool CallFunc_HasAuthority_ReturnValue_4, class AActor* K2Node_CustomEvent_DestroyedActor, class UAbilitySystemComponent* CallFunc_GetAbilitySystemComponent_ReturnValue_3, class UAbilitySystemComponent* CallFunc_GetAbilitySystemComponent_ReturnValue_4, int32 CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue_2, int32 CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue_3, EPopOutStates K2Node_CustomEvent_PopState, bool CallFunc_HasAuthority_ReturnValue_5, const struct FVector& CallFunc_MakeVector_ReturnValue_3, const struct FVector& CallFunc_GetCrouchedLoc_ReturnValue_1, TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_3, bool CallFunc_HasMatchingGameplayTag_ReturnValue_3, bool CallFunc_BooleanAND_ReturnValue_8, class UAbilitySystemComponent* CallFunc_GetAbilitySystemComponent_ReturnValue_5, int32 CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue_4, bool CallFunc_Not_PreBool_ReturnValue_10, bool CallFunc_BooleanAND_ReturnValue_9, class UFXSystemComponent* CallFunc_SpawnFXSystemAttached_ReturnValue, float CallFunc_Multiply_FloatFloat_ReturnValue_3, float CallFunc_Multiply_FloatFloat_ReturnValue_4, float CallFunc_Subtract_FloatFloat_ReturnValue_1, const struct FRotator& CallFunc_MakeRotator_ReturnValue_6, const struct FVector& CallFunc_MakeVector_ReturnValue_4, const struct FHitResult& CallFunc_K2_SetRelativeRotation_SweepHitResult_2, class AFortWeapon* K2Node_CustomEvent_Weapon_1, class AFortWeapon* K2Node_CustomEvent_Weapon, TDelegate<void(class AFortWeapon* Weapon)> K2Node_CreateDelegate_OutputDelegate_8, TDelegate<void(class AFortWeapon* Weapon)> K2Node_CreateDelegate_OutputDelegate_9, TDelegate<void(class AFortWeapon* Weapon)> K2Node_CreateDelegate_OutputDelegate_10, TDelegate<void(class AFortWeapon* Weapon)> K2Node_CreateDelegate_OutputDelegate_11, TDelegate<void(class AFortWeapon* Weapon)> K2Node_CreateDelegate_OutputDelegate_12, TDelegate<void(class AFortWeapon* Weapon)> K2Node_CreateDelegate_OutputDelegate_13, TDelegate<void(class AActor* Prop)> K2Node_CreateDelegate_OutputDelegate_14, TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_4, bool CallFunc_HasMatchingGameplayTag_ReturnValue_4, bool CallFunc_BooleanOR_ReturnValue_2, bool CallFunc_BooleanOR_ReturnValue_3, bool CallFunc_BooleanAND_ReturnValue_10, bool CallFunc_BooleanAND_ReturnValue_11, bool CallFunc_BooleanAND_ReturnValue_12);
	void OnGaveSneakySnowman_1();
	void StopFiring();
	void FireReleased_Client(class AFortWeapon* Weapon);
	void FirePressed_Client(class AFortWeapon* Weapon);
	void OpenFlaps_Multicast();
	void SetPopState_Multicast(EPopOutStates Param_PopState);
	void Cleanup(class AActor* DestroyedActor);
	void OwningClient_ADS();
	void MovementUpdated(float DeltaSeconds, const struct FVector& OldLocation, const struct FVector& OldVelocity);
	void OnWeaponChange();
	void WeaponChangeClient();
	void Server_BlockPopOut();
	void ChangePopState(EPopOutStates Param_PopState);
	void OnPopStateChanged(EPopOutStates Param_PopState);
	void SetPopState_Server(EPopOutStates Param_PopState);
	void SetMatInt(class AActor* Prop);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void Unbind_from_Movement_Events();
	void Bind_to_Movement_Events();
	void Wobble(float Strength, bool MoveUpAndDown);
	void JustAttached();
	void Set_Flaps_Visible_Multicast();
	void JumpedOut();
	void CustomEvent(class AFortWeapon* NewWeapon, class AFortWeapon* PrevWeapon);
	void ADS_Client(bool AimDownsights);
	void CloseFlaps();
	void OpenFlaps();
	void ReceiveBeginPlay();
	void Grow_Box__UpdateFunc();
	void Grow_Box__FinishedFunc();
	void ShrinkBox__UpdateFunc();
	void ShrinkBox__FinishedFunc();
	void Timeline_1__UpdateFunc();
	void Timeline_1__FinishedFunc();
	void OnStartedUsingFake(int32 Temp_int_Variable, class UMaterial* Temp_object_Variable, class UMaterial* Temp_object_Variable_1, class UMaterial* Temp_object_Variable_2, bool Temp_bool_Has_Been_Initd_Variable, bool Temp_bool_IsClosed_Variable, class UMaterial* K2Node_Select_Default);
	void OnStoppedUsingFake();
	void OnPlayerFootstep(const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue);
	void OnPlayerLanded(struct FHitResult& Hit, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue);
	void OnPlayerMovementModeChanged(class ACharacter* Character, EMovementMode PrevMovementMode, uint8 PreviousCustomMode, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess);
	void GetMaterialInt(int32* Param_MatInt);
	void OnRep_MatInt(int32 Temp_int_Variable, class UMaterial* Temp_object_Variable, class UMaterial* Temp_object_Variable_1, class UMaterial* Temp_object_Variable_2, class UMaterial* K2Node_Select_Default);
	void OnRep_PopState(bool CallFunc_IsLocallyControlled_ReturnValue, const class FString& CallFunc_GetEnumeratorUserFriendlyName_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Athena_Player_CoolCarpet_C">();
	}
	static class AAthena_Player_CoolCarpet_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAthena_Player_CoolCarpet_C>();
	}
};
static_assert(alignof(AAthena_Player_CoolCarpet_C) == 0x000008, "Wrong alinment on AAthena_Player_CoolCarpet_C");
static_assert(sizeof(AAthena_Player_CoolCarpet_C) == 0x000B30, "Wrong size on AAthena_Player_CoolCarpet_C");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, UberGraphFrame_Athena_Player_CoolCarpet_C) == 0x000A28, "Member 'AAthena_Player_CoolCarpet_C::UberGraphFrame_Athena_Player_CoolCarpet_C' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, SM_ShadowInsert) == 0x000A30, "Member 'AAthena_Player_CoolCarpet_C::SM_ShadowInsert' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, SM_CoolCarpet_Flap1) == 0x000A38, "Member 'AAthena_Player_CoolCarpet_C::SM_CoolCarpet_Flap1' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, SM_CoolCarpet_Flap2) == 0x000A40, "Member 'AAthena_Player_CoolCarpet_C::SM_CoolCarpet_Flap2' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, ShrinkBox_Rotation_B702562648A4C4CB590675BD0D3E005C) == 0x000A48, "Member 'AAthena_Player_CoolCarpet_C::ShrinkBox_Rotation_B702562648A4C4CB590675BD0D3E005C' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, ShrinkBox_Shrinkage_B702562648A4C4CB590675BD0D3E005C) == 0x000A4C, "Member 'AAthena_Player_CoolCarpet_C::ShrinkBox_Shrinkage_B702562648A4C4CB590675BD0D3E005C' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, ShrinkBox__Direction_B702562648A4C4CB590675BD0D3E005C) == 0x000A50, "Member 'AAthena_Player_CoolCarpet_C::ShrinkBox__Direction_B702562648A4C4CB590675BD0D3E005C' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, ShrinkBox) == 0x000A58, "Member 'AAthena_Player_CoolCarpet_C::ShrinkBox' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, Grow_Box_Growth_53FD69EF4E6B5DECD0D74DBB0BDDAA26) == 0x000A60, "Member 'AAthena_Player_CoolCarpet_C::Grow_Box_Growth_53FD69EF4E6B5DECD0D74DBB0BDDAA26' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, Grow_Box__Direction_53FD69EF4E6B5DECD0D74DBB0BDDAA26) == 0x000A64, "Member 'AAthena_Player_CoolCarpet_C::Grow_Box__Direction_53FD69EF4E6B5DECD0D74DBB0BDDAA26' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, Grow_Box) == 0x000A68, "Member 'AAthena_Player_CoolCarpet_C::Grow_Box' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, Timeline_1_Rotation_A659A2B4463C7B7008A67988DEB011BE) == 0x000A70, "Member 'AAthena_Player_CoolCarpet_C::Timeline_1_Rotation_A659A2B4463C7B7008A67988DEB011BE' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, Timeline_1__Direction_A659A2B4463C7B7008A67988DEB011BE) == 0x000A74, "Member 'AAthena_Player_CoolCarpet_C::Timeline_1__Direction_A659A2B4463C7B7008A67988DEB011BE' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, Timeline_1) == 0x000A78, "Member 'AAthena_Player_CoolCarpet_C::Timeline_1' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, AlreadyJumpedOut) == 0x000A80, "Member 'AAthena_Player_CoolCarpet_C::AlreadyJumpedOut' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, CastedFakeActor) == 0x000A88, "Member 'AAthena_Player_CoolCarpet_C::CastedFakeActor' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, MovementEventsBound) == 0x000A90, "Member 'AAthena_Player_CoolCarpet_C::MovementEventsBound' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, OnFootstepSound) == 0x000A98, "Member 'AAthena_Player_CoolCarpet_C::OnFootstepSound' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, OnLandedSound) == 0x000AA0, "Member 'AAthena_Player_CoolCarpet_C::OnLandedSound' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, OnJumpedSound) == 0x000AA8, "Member 'AAthena_Player_CoolCarpet_C::OnJumpedSound' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, HolsterId) == 0x000AB0, "Member 'AAthena_Player_CoolCarpet_C::HolsterId' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, MatInt) == 0x000AB8, "Member 'AAthena_Player_CoolCarpet_C::MatInt' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, PopOutOnWindUp) == 0x000AC0, "Member 'AAthena_Player_CoolCarpet_C::PopOutOnWindUp' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, AllowPopOut) == 0x000AE8, "Member 'AAthena_Player_CoolCarpet_C::AllowPopOut' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, Swimming_0) == 0x000B10, "Member 'AAthena_Player_CoolCarpet_C::Swimming_0' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, PopState) == 0x000B11, "Member 'AAthena_Player_CoolCarpet_C::PopState' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, FlapsClosed) == 0x000B12, "Member 'AAthena_Player_CoolCarpet_C::FlapsClosed' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, WindUpEndTimer) == 0x000B18, "Member 'AAthena_Player_CoolCarpet_C::WindUpEndTimer' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, PoppedFromWindUp) == 0x000B20, "Member 'AAthena_Player_CoolCarpet_C::PoppedFromWindUp' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, DidWindUp) == 0x000B21, "Member 'AAthena_Player_CoolCarpet_C::DidWindUp' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, PoppedFromStand) == 0x000B22, "Member 'AAthena_Player_CoolCarpet_C::PoppedFromStand' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, Firing) == 0x000B23, "Member 'AAthena_Player_CoolCarpet_C::Firing' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, FirePressed) == 0x000B24, "Member 'AAthena_Player_CoolCarpet_C::FirePressed' has a wrong offset!");
static_assert(offsetof(AAthena_Player_CoolCarpet_C, StopFiringTimer) == 0x000B28, "Member 'AAthena_Player_CoolCarpet_C::StopFiringTimer' has a wrong offset!");

}

