#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Athena_SneakySnowmanV2_InteractSphere

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Athena_SneakySnowmanV2_InteractSphere.Athena_SneakySnowmanV2_InteractSphere_C
// 0x0018 (0x07E8 - 0x07D0)
class AAthena_SneakySnowmanV2_InteractSphere_C final  : public ABuildingGameplayActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       Sphere;                                            // 0x07D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AAthena_Player_SneakySnowmanV2_C*       AssociatedSnowman;                                 // 0x07E0(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Athena_SneakySnowmanV2_InteractSphere(int32 EntryPoint, class AActor* K2Node_CustomEvent_DestroyedActor, class AFortPawn* K2Node_Event_InteractingPawn_1, EInteractionBeingAttempted K2Node_Event_InteractionBeingAttempted_1, class AFortPawn* K2Node_Event_InteractingPawn, EInteractionBeingAttempted K2Node_Event_InteractionBeingAttempted, ETInteractionType K2Node_Event_InteractionType);
	void BlueprintOnInterruptInteract();
	void BlueprintOnBeginInteract(class AFortPawn* InteractingPawn, EInteractionBeingAttempted InteractionBeingAttempted, ETInteractionType InteractionType);
	void BlueprintOnInteract(class AFortPawn* InteractingPawn, EInteractionBeingAttempted InteractionBeingAttempted);
	void Destroy(class AActor* DestroyedActor);
	void OnRep_AssociatedSnowman();
	void Init(class AAthena_Player_SneakySnowmanV2_C* Param_AssociatedSnowman, TDelegate<void(class AActor* DestroyedActor)> K2Node_CreateDelegate_OutputDelegate);

	bool BlueprintCanInteract(class AFortPawn* InteractingPawn, EInteractionBeingAttempted InteractionBeingAttempted, ETInteractionType InteractionType, TArray<struct FGameplayTag>& K2Node_MakeArray_Array, TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput, bool CallFunc_HasMatchingGameplayTag_ReturnValue, const struct FGameplayTagContainer& CallFunc_MakeGameplayTagContainerFromArray_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput, bool CallFunc_HasAnyMatchingGameplayTags_ReturnValue, bool CallFunc_BooleanOR_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool CallFunc_CheckIfCanJumpOut_CanInteract, bool CallFunc_BooleanAND_ReturnValue) const;
	class FText BlueprintGetInteractionString(class AFortPawn* InteractingPawn, EInteractionBeingAttempted InteractionBeingAttempted) const;
	bool BlueprintGetInteractionTime(class AFortPawn* InteractingPawn, float* OutInteractionTime, EInteractionBeingAttempted InteractionBeingAttempted) const;
	struct FVector GetFocusedSocketLocation(float ForwardVectorMultipler, class APlayerCameraManager* CameraManager, bool CallFunc_IsValid_ReturnValue, class AFortPlayerController* CallFunc_GetFortPlayerControllerFromActor_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, const struct FVector& CallFunc_MakeVector_ReturnValue, bool CallFunc_IsValid_ReturnValue_2, float CallFunc_GetFOVAngle_ReturnValue, float CallFunc_Multiply_FloatFloat_ReturnValue, const struct FRotator& CallFunc_GetCameraRotation_ReturnValue, const struct FVector& CallFunc_GetCameraLocation_ReturnValue, const struct FVector& CallFunc_GetUpVector_ReturnValue, const struct FVector& CallFunc_GetForwardVector_ReturnValue, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue_1, const struct FVector& CallFunc_Add_VectorVector_ReturnValue, const struct FVector& CallFunc_Add_VectorVector_ReturnValue_1) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Athena_SneakySnowmanV2_InteractSphere_C">();
	}
	static class AAthena_SneakySnowmanV2_InteractSphere_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAthena_SneakySnowmanV2_InteractSphere_C>();
	}
};
static_assert(alignof(AAthena_SneakySnowmanV2_InteractSphere_C) == 0x000008, "Wrong alinment on AAthena_SneakySnowmanV2_InteractSphere_C");
static_assert(sizeof(AAthena_SneakySnowmanV2_InteractSphere_C) == 0x0007E8, "Wrong size on AAthena_SneakySnowmanV2_InteractSphere_C");
static_assert(offsetof(AAthena_SneakySnowmanV2_InteractSphere_C, UberGraphFrame) == 0x0007D0, "Member 'AAthena_SneakySnowmanV2_InteractSphere_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AAthena_SneakySnowmanV2_InteractSphere_C, Sphere) == 0x0007D8, "Member 'AAthena_SneakySnowmanV2_InteractSphere_C::Sphere' has a wrong offset!");
static_assert(offsetof(AAthena_SneakySnowmanV2_InteractSphere_C, AssociatedSnowman) == 0x0007E0, "Member 'AAthena_SneakySnowmanV2_InteractSphere_C::AssociatedSnowman' has a wrong offset!");

}

