#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaSeasonItemRewardIcon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaSeasonItemRewardIcon.AthenaSeasonItemRewardIcon_C
// 0x00A0 (0x0300 - 0x0260)
class UAthenaSeasonItemRewardIcon_C final  : public UAthenaSeasonItemRewardIcon
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       AdjustRewardFillSize;                              // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Selected;                                          // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoverState;                                        // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_BattlePassIcon;                              // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Image_RewardContainer;                             // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               RewardContainer_Size;                              // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortLazyImage*                         RewardTile;                                        // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_BattlePassIcon;                            // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Styles;                                    // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               StylesPlusCount;                                   // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Styles_Backing;                                    // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       StylesLabel;                                       // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                StylesWrapper;                                     // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Count;                                        // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         Width;                                             // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	float                                         Height;                                            // 0x02DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowStyle;                                         // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ShowCount;                                         // 0x02E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59AF[0x2];                                     // 0x02E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BattlePassIconSize;                                // 0x02E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BattlePassIconEnabled;                             // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59B0[0x3];                                     // 0x02E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BattlePassIconPositionOffsetMultiplier;            // 0x02EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FillSize;                                          // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	float                                         DesiredPixelSize;                                  // 0x02F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEmoji;                                          // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void SetRarityColors(const struct FLinearColor& Color1, const struct FLinearColor& Color2, const struct FLinearColor& Color3, const struct FLinearColor& Color4, const struct FLinearColor& Color5, class UMaterialInstanceDynamic* CallFunc_GetDynamicOutlineMaterial_ReturnValue, class UMaterialInstanceDynamic* CallFunc_GetDynamicFontMaterial_ReturnValue, class UMaterialInstanceDynamic* CallFunc_GetDynamicMaterial_ReturnValue, class UMaterialInstanceDynamic* CallFunc_GetDynamicMaterial_ReturnValue_1);
	void HandleMultipleRewardSelctedAnim(bool bLeftRewardSelected, class UUMGSequencePlayer* CallFunc_PlayAnimationReverse_ReturnValue, class UUMGSequencePlayer* CallFunc_PlayAnimationForward_ReturnValue);
	void DeselectedAnim(class UMaterialInstanceDynamic* CallFunc_GetDynamicFontMaterial_ReturnValue, class UUMGSequencePlayer* CallFunc_PlayAnimationReverse_ReturnValue);
	void SelectedAnim(class UMaterialInstanceDynamic* CallFunc_GetDynamicFontMaterial_ReturnValue, class UUMGSequencePlayer* CallFunc_PlayAnimationForward_ReturnValue);
	void SetupItemCardStyle(class UFortItem* RewardItem, float Temp_float_Variable, EFortRarity CallFunc_GetRarity_ReturnValue, const struct FFortRarityItemData& CallFunc_BPGetRarityData_ReturnValue, class UFortItemDefinition* CallFunc_GetItemDefinitionBP_ReturnValue, class UAthenaEmojiItemDefinition* K2Node_DynamicCast_AsAthena_Emoji_Item_Definition, bool K2Node_DynamicCast_bSuccess, EFortItemType CallFunc_GetType_ReturnValue, float Temp_float_Variable_1, bool CallFunc_EqualEqual_ByteByte_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue_1, bool Temp_bool_Variable, bool CallFunc_BooleanOR_ReturnValue, float Temp_float_Variable_2, float K2Node_Select_Default, float Temp_float_Variable_3, bool Temp_bool_Variable_1, float Temp_float_Variable_4, float Temp_float_Variable_5, bool Temp_bool_Variable_2, float Temp_float_Variable_6, float K2Node_Select_Default_1, float Temp_float_Variable_7, bool CallFunc_BooleanOR_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue_2, bool Temp_bool_Variable_3, float K2Node_Select_Default_2, float Temp_float_Variable_8, float K2Node_Select_Default_3, float Temp_float_Variable_9, bool Temp_bool_Variable_4, float K2Node_Select_Default_4, class UMaterialInstanceDynamic* CallFunc_GetDynamicMaterial_ReturnValue);
	void Unhover(class UUMGSequencePlayer* CallFunc_PlayAnimationReverse_ReturnValue);
	void Hover(class UUMGSequencePlayer* CallFunc_PlayAnimationForward_ReturnValue);
	void PreConstruct(bool IsDesignTime);
	void OnInitializeReward(class UFortItem* RewardItem, TSoftObjectPtr<class UTexture2D>& RewardTexture, bool bHasAdditionalStylesToDisplay, int32 RewardLevel, bool bRequiresBattlePass);
	void OnInitializeSeriesReward(class UFortItemSeriesDefinition* SeriesData);
	void ExecuteUbergraph_AthenaSeasonItemRewardIcon(int32 EntryPoint, class UFortItemSeriesDefinition* K2Node_Event_SeriesData, ESlateVisibility Temp_byte_Variable, bool Temp_bool_Variable, ESlateVisibility Temp_byte_Variable_1, ESlateVisibility Temp_byte_Variable_2, bool Temp_bool_Variable_1, ESlateVisibility Temp_byte_Variable_3, ESlateVisibility Temp_byte_Variable_4, class UFortMcpContext* CallFunc_GetContext_ReturnValue, bool Temp_bool_Variable_2, class UFortMcpProfileAthena* CallFunc_GetAthenaProfile_ReturnValue, ESlateVisibility Temp_byte_Variable_5, bool CallFunc_HasPurchasedSeasonBook_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, ESlateVisibility Temp_byte_Variable_6, bool K2Node_Event_IsDesignTime, bool CallFunc_BooleanAND_ReturnValue, class UOverlaySlot* K2Node_DynamicCast_AsOverlay_Slot, bool K2Node_DynamicCast_bSuccess, ESlateVisibility Temp_byte_Variable_7, float CallFunc_Multiply_FloatFloat_ReturnValue, const struct FMargin& K2Node_MakeStruct_Margin, class UFortItem* K2Node_Event_RewardItem, TSoftObjectPtr<class UTexture2D> K2Node_Event_RewardTexture, bool K2Node_Event_bHasAdditionalStylesToDisplay, int32 K2Node_Event_RewardLevel, bool K2Node_Event_bRequiresBattlePass, bool CallFunc_BooleanAND_ReturnValue_1, class UFortPersistableItem* K2Node_DynamicCast_AsFort_Persistable_Item, bool K2Node_DynamicCast_bSuccess_1, ESlateVisibility K2Node_Select_Default, class FText CallFunc_Conv_IntToText_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, bool CallFunc_IsValid_ReturnValue, ESlateVisibility K2Node_Select_Default_1, bool Temp_bool_Variable_3, ESlateVisibility Temp_byte_Variable_8, ESlateVisibility K2Node_Select_Default_2, ESlateVisibility Temp_byte_Variable_9, bool Temp_bool_Variable_4, ESlateVisibility Temp_byte_Variable_10, ESlateVisibility K2Node_Select_Default_3, ESlateVisibility Temp_byte_Variable_11, bool CallFunc_BooleanAND_ReturnValue_2, ESlateVisibility K2Node_Select_Default_4, bool Temp_bool_Variable_5, ESlateVisibility K2Node_Select_Default_5, class UMaterialInstanceDynamic* CallFunc_GetDynamicMaterial_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaSeasonItemRewardIcon_C">();
	}
	static class UAthenaSeasonItemRewardIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaSeasonItemRewardIcon_C>();
	}
};
static_assert(alignof(UAthenaSeasonItemRewardIcon_C) == 0x000008, "Wrong alinment on UAthenaSeasonItemRewardIcon_C");
static_assert(sizeof(UAthenaSeasonItemRewardIcon_C) == 0x000300, "Wrong size on UAthenaSeasonItemRewardIcon_C");
static_assert(offsetof(UAthenaSeasonItemRewardIcon_C, UberGraphFrame) == 0x000260, "Member 'UAthenaSeasonItemRewardIcon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonItemRewardIcon_C, AdjustRewardFillSize) == 0x000268, "Member 'UAthenaSeasonItemRewardIcon_C::AdjustRewardFillSize' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonItemRewardIcon_C, Selected) == 0x000270, "Member 'UAthenaSeasonItemRewardIcon_C::Selected' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonItemRewardIcon_C, HoverState) == 0x000278, "Member 'UAthenaSeasonItemRewardIcon_C::HoverState' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonItemRewardIcon_C, Image_BattlePassIcon) == 0x000280, "Member 'UAthenaSeasonItemRewardIcon_C::Image_BattlePassIcon' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonItemRewardIcon_C, Image_RewardContainer) == 0x000288, "Member 'UAthenaSeasonItemRewardIcon_C::Image_RewardContainer' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonItemRewardIcon_C, RewardContainer_Size) == 0x000290, "Member 'UAthenaSeasonItemRewardIcon_C::RewardContainer_Size' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonItemRewardIcon_C, RewardTile) == 0x000298, "Member 'UAthenaSeasonItemRewardIcon_C::RewardTile' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonItemRewardIcon_C, SizeBox_BattlePassIcon) == 0x0002A0, "Member 'UAthenaSeasonItemRewardIcon_C::SizeBox_BattlePassIcon' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonItemRewardIcon_C, SizeBox_Styles) == 0x0002A8, "Member 'UAthenaSeasonItemRewardIcon_C::SizeBox_Styles' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonItemRewardIcon_C, StylesPlusCount) == 0x0002B0, "Member 'UAthenaSeasonItemRewardIcon_C::StylesPlusCount' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonItemRewardIcon_C, Styles_Backing) == 0x0002B8, "Member 'UAthenaSeasonItemRewardIcon_C::Styles_Backing' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonItemRewardIcon_C, StylesLabel) == 0x0002C0, "Member 'UAthenaSeasonItemRewardIcon_C::StylesLabel' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonItemRewardIcon_C, StylesWrapper) == 0x0002C8, "Member 'UAthenaSeasonItemRewardIcon_C::StylesWrapper' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonItemRewardIcon_C, Text_Count) == 0x0002D0, "Member 'UAthenaSeasonItemRewardIcon_C::Text_Count' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonItemRewardIcon_C, Width) == 0x0002D8, "Member 'UAthenaSeasonItemRewardIcon_C::Width' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonItemRewardIcon_C, Height) == 0x0002DC, "Member 'UAthenaSeasonItemRewardIcon_C::Height' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonItemRewardIcon_C, ShowStyle) == 0x0002E0, "Member 'UAthenaSeasonItemRewardIcon_C::ShowStyle' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonItemRewardIcon_C, ShowCount) == 0x0002E1, "Member 'UAthenaSeasonItemRewardIcon_C::ShowCount' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonItemRewardIcon_C, BattlePassIconSize) == 0x0002E4, "Member 'UAthenaSeasonItemRewardIcon_C::BattlePassIconSize' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonItemRewardIcon_C, BattlePassIconEnabled) == 0x0002E8, "Member 'UAthenaSeasonItemRewardIcon_C::BattlePassIconEnabled' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonItemRewardIcon_C, BattlePassIconPositionOffsetMultiplier) == 0x0002EC, "Member 'UAthenaSeasonItemRewardIcon_C::BattlePassIconPositionOffsetMultiplier' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonItemRewardIcon_C, FillSize) == 0x0002F0, "Member 'UAthenaSeasonItemRewardIcon_C::FillSize' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonItemRewardIcon_C, DesiredPixelSize) == 0x0002F4, "Member 'UAthenaSeasonItemRewardIcon_C::DesiredPixelSize' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonItemRewardIcon_C, bIsEmoji) == 0x0002F8, "Member 'UAthenaSeasonItemRewardIcon_C::bIsEmoji' has a wrong offset!");

}

