#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaMOTDWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaMOTDWidget.AthenaMOTDWidget_C
// 0x0078 (0x04C0 - 0x0448)
class UAthenaMOTDWidget_C final  : public UFortAthenaMOTDWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0448(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       NewAnimation;                                      // 0x0450(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       IntroAnim;                                         // 0x0458(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnNewSelect;                                       // 0x0460(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCircleArrowButton_C*                   CircleArrowButton_Left;                            // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCircleArrowButton_C*                   CircleArrowButton_Right;                           // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonText_NewsHeader;                             // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_156;                                         // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_TextFloater;                                 // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_1;                                        // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_2;                                        // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_3;                                        // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             UpdateStyle;                                       // 0x04B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void UpdateStyle__DelegateSignature(EAthenaNewsStyle NewStyle);
	void ExecuteUbergraph_AthenaMOTDWidget(int32 EntryPoint, class UFortPartyContext* CallFunc_GetContext_ReturnValue, class UFortGlobalUIContext* CallFunc_GetContext_ReturnValue_1, int32 CallFunc_GetNumPlayersInLocalParty_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, struct FAthenaMOTDBase& K2Node_Event_NewsEntry, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue, class UCommonButton* K2Node_ComponentBoundEvent_Button_1, class UCommonButton* K2Node_ComponentBoundEvent_Button, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue_1, class FText CallFunc_MakeLiteralText_ReturnValue, EFortDialogResult Temp_byte_Variable, class UFortAsyncAction_ShowConfirmation_NUI* CallFunc_ShowSimpleConfirmationDialog_CustomInput_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, bool CallFunc_IsValid_ReturnValue, class FName Temp_name_Variable, TArray<class AFort_Entry_Music_Controller_BP_C*>& CallFunc_GetAllActorsOfClass_OutActors, EFortDialogResult K2Node_CustomEvent_Result, class FName K2Node_CustomEvent_ResultName, class AFort_Entry_Music_Controller_BP_C* CallFunc_Array_Get_Item, class USoloButton_C* K2Node_DynamicCast_AsSolo_Button, bool K2Node_DynamicCast_bSuccess, class UIconTextButton_C* K2Node_DynamicCast_AsIcon_Text_Button, bool K2Node_DynamicCast_bSuccess_1, class FText K2Node_Event_InText_1, class FText K2Node_Event_InText, TDelegate<void(EFortDialogResult Result, class FName ResultName)> K2Node_CreateDelegate_OutputDelegate);
	void PlayIntroAnimation();
	void SetNormalButtonText(class FText& InText);
	void SetSpecialButtonText(class FText& InText);
	void StartSTWUpsell();
	void BndEvt__CircleArrowButton_Left_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__CircleArrowButton_Right_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnSelectedNews(struct FAthenaMOTDBase& NewsEntry);
	void DialogResult_B7839D98483DEF9593D448BA28AE74F7(EFortDialogResult Result, class FName ResultName);
	void UpdateCustomColorStyle(bool bHasCustomColor, const struct FColor& CustomDarkColor, const struct FColor& CustomLightColor, bool Temp_bool_Variable, const struct FLinearColor& CallFunc_Conv_ColorToLinearColor_ReturnValue, const struct FLinearColor& CallFunc_Conv_ColorToLinearColor_ReturnValue_1, const struct FLinearColor& Temp_struct_Variable, bool Temp_bool_Variable_1, const struct FLinearColor& K2Node_Select_Default, const struct FLinearColor& Temp_struct_Variable_1, const struct FSlateColor& K2Node_MakeStruct_SlateColor, const struct FLinearColor& K2Node_Select_Default_1);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent, const struct FEventReply& CallFunc_Handled_ReturnValue, class UCommonButton* CallFunc_GetSelectedButton_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaMOTDWidget_C">();
	}
	static class UAthenaMOTDWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaMOTDWidget_C>();
	}
};
static_assert(alignof(UAthenaMOTDWidget_C) == 0x000008, "Wrong alinment on UAthenaMOTDWidget_C");
static_assert(sizeof(UAthenaMOTDWidget_C) == 0x0004C0, "Wrong size on UAthenaMOTDWidget_C");
static_assert(offsetof(UAthenaMOTDWidget_C, UberGraphFrame) == 0x000448, "Member 'UAthenaMOTDWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDWidget_C, NewAnimation) == 0x000450, "Member 'UAthenaMOTDWidget_C::NewAnimation' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDWidget_C, IntroAnim) == 0x000458, "Member 'UAthenaMOTDWidget_C::IntroAnim' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDWidget_C, OnNewSelect) == 0x000460, "Member 'UAthenaMOTDWidget_C::OnNewSelect' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDWidget_C, CircleArrowButton_Left) == 0x000468, "Member 'UAthenaMOTDWidget_C::CircleArrowButton_Left' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDWidget_C, CircleArrowButton_Right) == 0x000470, "Member 'UAthenaMOTDWidget_C::CircleArrowButton_Right' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDWidget_C, CommonText_NewsHeader) == 0x000478, "Member 'UAthenaMOTDWidget_C::CommonText_NewsHeader' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDWidget_C, Image_156) == 0x000480, "Member 'UAthenaMOTDWidget_C::Image_156' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDWidget_C, Image_TextFloater) == 0x000488, "Member 'UAthenaMOTDWidget_C::Image_TextFloater' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDWidget_C, SafeZone_0) == 0x000490, "Member 'UAthenaMOTDWidget_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDWidget_C, SafeZone_1) == 0x000498, "Member 'UAthenaMOTDWidget_C::SafeZone_1' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDWidget_C, SafeZone_2) == 0x0004A0, "Member 'UAthenaMOTDWidget_C::SafeZone_2' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDWidget_C, SafeZone_3) == 0x0004A8, "Member 'UAthenaMOTDWidget_C::SafeZone_3' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDWidget_C, UpdateStyle) == 0x0004B0, "Member 'UAthenaMOTDWidget_C::UpdateStyle' has a wrong offset!");

}

