#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaStoreReward

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaStoreReward.AthenaStoreReward_C
// 0x0050 (0x0C50 - 0x0C00)
class UAthenaStoreReward_C final  : public UFortAthenaReward
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C00(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Fade;                                              // 0x0C08(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0C10(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 baking;                                            // 0x0C18(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Check;                                             // 0x0C20(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       OwnedText;                                         // 0x0C28(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RarityFlare;                                       // 0x0C30(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RevealOverlay;                                     // 0x0C38(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortItem*                              StrongItemToRepresent;                             // 0x0C40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SoundOnReveal;                                     // 0x0C48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void EnableRarityFlare();
	void PlayIntro();
	void OnRepresentedItemSet(class UFortItem* RepresentedItem);
	void ExecuteUbergraph_AthenaStoreReward(int32 EntryPoint, class UFortItem* K2Node_Event_RepresentedItem, class UMaterialInstanceDynamic* CallFunc_GetDynamicMaterial_ReturnValue, EFortRarity CallFunc_GetRarity_ReturnValue, const struct FFortRarityItemData& CallFunc_BPGetRarityData_ReturnValue, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue, class UMaterialInstanceDynamic* CallFunc_GetDynamicMaterial_ReturnValue_1);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaStoreReward_C">();
	}
	static class UAthenaStoreReward_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaStoreReward_C>();
	}
};
static_assert(alignof(UAthenaStoreReward_C) == 0x000008, "Wrong alinment on UAthenaStoreReward_C");
static_assert(sizeof(UAthenaStoreReward_C) == 0x000C50, "Wrong size on UAthenaStoreReward_C");
static_assert(offsetof(UAthenaStoreReward_C, UberGraphFrame) == 0x000C00, "Member 'UAthenaStoreReward_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaStoreReward_C, Fade) == 0x000C08, "Member 'UAthenaStoreReward_C::Fade' has a wrong offset!");
static_assert(offsetof(UAthenaStoreReward_C, Intro) == 0x000C10, "Member 'UAthenaStoreReward_C::Intro' has a wrong offset!");
static_assert(offsetof(UAthenaStoreReward_C, baking) == 0x000C18, "Member 'UAthenaStoreReward_C::baking' has a wrong offset!");
static_assert(offsetof(UAthenaStoreReward_C, Check) == 0x000C20, "Member 'UAthenaStoreReward_C::Check' has a wrong offset!");
static_assert(offsetof(UAthenaStoreReward_C, OwnedText) == 0x000C28, "Member 'UAthenaStoreReward_C::OwnedText' has a wrong offset!");
static_assert(offsetof(UAthenaStoreReward_C, RarityFlare) == 0x000C30, "Member 'UAthenaStoreReward_C::RarityFlare' has a wrong offset!");
static_assert(offsetof(UAthenaStoreReward_C, RevealOverlay) == 0x000C38, "Member 'UAthenaStoreReward_C::RevealOverlay' has a wrong offset!");
static_assert(offsetof(UAthenaStoreReward_C, StrongItemToRepresent) == 0x000C40, "Member 'UAthenaStoreReward_C::StrongItemToRepresent' has a wrong offset!");
static_assert(offsetof(UAthenaStoreReward_C, SoundOnReveal) == 0x000C48, "Member 'UAthenaStoreReward_C::SoundOnReveal' has a wrong offset!");

}

