#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Athena_Player_SneakySnowmanV3

#include "Basic.hpp"

#include "Athena_Player_SneakySnowmanV2_classes.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Athena_Player_SneakySnowmanV3.Athena_Player_SneakySnowmanV3_C
// 0x0068 (0x0A90 - 0x0A28)
class AAthena_Player_SneakySnowmanV3_C final  : public AAthena_Player_SneakySnowmanV2_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Athena_Player_SneakySnowmanV3_C;    // 0x0A28(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          Dead;                                              // 0x0A30(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6ED6[0x7];                                     // 0x0A31(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         LaunchSpeed;                                       // 0x0A38(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AActor*                                 DamageCauser;                                      // 0x0A60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         FrostExplosionRadius;                              // 0x0A68(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_Athena_Player_SneakySnowmanV3(int32 EntryPoint, TArray<class AActor*>& Temp_object_Variable, int32 Temp_int_Array_Index_Variable, float K2Node_Event_Damage_1, struct FGameplayTagContainer& K2Node_Event_DamageTags_1, const struct FVector& K2Node_Event_Momentum_1, struct FHitResult& K2Node_Event_HitInfo_1, class AController* K2Node_Event_InstigatedBy_1, class AActor* K2Node_Event_DamageCauser_1, const struct FGameplayEffectContextHandle& K2Node_Event_EffectContext_1, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, TArray<EObjectTypeQuery>& K2Node_MakeArray_Array, float K2Node_Event_Damage, struct FGameplayTagContainer& K2Node_Event_DamageTags, const struct FVector& K2Node_Event_Momentum, struct FHitResult& K2Node_Event_HitInfo, class AController* K2Node_Event_InstigatedBy, class AActor* K2Node_Event_DamageCauser, const struct FGameplayEffectContextHandle& K2Node_Event_EffectContext, class AFortPawn* K2Node_Event_InteractingPawn, class AActor* CallFunc_GetOwner_ReturnValue, bool CallFunc_IsValid_ReturnValue, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, bool Temp_bool_Variable, class UAbilitySystemComponent* CallFunc_GetAbilitySystemComponent_ReturnValue, float CallFunc_GetValueAtLevel_ReturnValue, TArray<class AActor*>& CallFunc_SphereOverlapActors_OutActors, bool CallFunc_SphereOverlapActors_ReturnValue, class AActor* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, class UAbilitySystemComponent* CallFunc_GetAbilitySystemComponent_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue, const struct FActiveGameplayEffectHandle& CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_1, class ACharacter* K2Node_DynamicCast_AsCharacter, bool K2Node_DynamicCast_bSuccess, bool CallFunc_EqualEqual_ObjectObject_ReturnValue, float CallFunc_GetValueAtLevel_ReturnValue_1, class AActor* K2Node_Select_Default, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_2, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue, const struct FVector& CallFunc_Normal_ReturnValue, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue);
	void OnInteractWithFake(class AFortPawn* InteractingPawn);
	void OnDamageServer(float Damage, struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* Param_DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnDeathServer(float Damage, struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* Param_DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Athena_Player_SneakySnowmanV3_C">();
	}
	static class AAthena_Player_SneakySnowmanV3_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAthena_Player_SneakySnowmanV3_C>();
	}
};
static_assert(alignof(AAthena_Player_SneakySnowmanV3_C) == 0x000008, "Wrong alinment on AAthena_Player_SneakySnowmanV3_C");
static_assert(sizeof(AAthena_Player_SneakySnowmanV3_C) == 0x000A90, "Wrong size on AAthena_Player_SneakySnowmanV3_C");
static_assert(offsetof(AAthena_Player_SneakySnowmanV3_C, UberGraphFrame_Athena_Player_SneakySnowmanV3_C) == 0x000A28, "Member 'AAthena_Player_SneakySnowmanV3_C::UberGraphFrame_Athena_Player_SneakySnowmanV3_C' has a wrong offset!");
static_assert(offsetof(AAthena_Player_SneakySnowmanV3_C, Dead) == 0x000A30, "Member 'AAthena_Player_SneakySnowmanV3_C::Dead' has a wrong offset!");
static_assert(offsetof(AAthena_Player_SneakySnowmanV3_C, LaunchSpeed) == 0x000A38, "Member 'AAthena_Player_SneakySnowmanV3_C::LaunchSpeed' has a wrong offset!");
static_assert(offsetof(AAthena_Player_SneakySnowmanV3_C, DamageCauser) == 0x000A60, "Member 'AAthena_Player_SneakySnowmanV3_C::DamageCauser' has a wrong offset!");
static_assert(offsetof(AAthena_Player_SneakySnowmanV3_C, FrostExplosionRadius) == 0x000A68, "Member 'AAthena_Player_SneakySnowmanV3_C::FrostExplosionRadius' has a wrong offset!");

}

