#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Athena_FloppingRabbit_Wire

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function B_Athena_FloppingRabbit_Wire.B_Athena_FloppingRabbit_Wire_C.ExecuteUbergraph_B_Athena_FloppingRabbit_Wire
// 0x04B0 (0x04B0 - 0x0000)
struct B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire final 
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6498[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_1;        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6499[0x2];                                     // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_649A[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_649B[0x2];                                     // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimMontage_ReturnValue;              // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetAttachedActors_OutActors;              // 0x0078(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_649C[0x3];                                     // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_649D[0x3];                                     // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0098(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_649E[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_1;         // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPickup*                            K2Node_CustomEvent_InputPin;                       // 0x00D0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_2;         // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x00E0(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x00F4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x00FC(0x0010)(ZeroConstructor, NoDestructor)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue_1;         // 0x0120(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x012C(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UActorComponent*                        K2Node_CustomEvent_Target;                         // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_649F[0x4];                                     // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UFortProjectileMovementComponent*> CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x01D0(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class AFortPickup*                            K2Node_DynamicCast_AsFort_Pickup;                  // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64A0[0x7];                                     // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortProjectileMovementComponent*       CallFunc_Array_Get_Item_1;                         // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64A1[0x6];                                     // 0x01FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortItemEntry                         CallFunc_GetItemEntry_ReturnValue;                 // 0x0200(0x0190)(ConstParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0390(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64A2[0x4];                                     // 0x039C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortWeaponItemDefinition*              K2Node_DynamicCast_AsFort_Weapon_Item_Definition;  // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x03A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64A3[0x2];                                     // 0x03AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_5;            // 0x03AC(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x03BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64A4[0x3];                                     // 0x03BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue_2;                       // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x03C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DistanceBetweenTwoVectors_Distance;       // 0x03D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64A5[0xC];                                     // 0x03D4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x03E0(0x0030)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x0414(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x04A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire) == 0x000010, "Wrong alinment on B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire");
static_assert(sizeof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire) == 0x0004B0, "Wrong size on B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, EntryPoint) == 0x000000, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000008, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_Lerp_ReturnValue) == 0x000010, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_Lerp_ReturnValue_1) == 0x000014, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_K2_GetRootComponent_ReturnValue_1) == 0x000018, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_K2_GetRootComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, Temp_bool_IsClosed_Variable) == 0x000030, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, Temp_bool_Has_Been_Initd_Variable) == 0x000031, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, Temp_int_Loop_Counter_Variable) == 0x000034, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, Temp_bool_Has_Been_Initd_Variable_1) == 0x00003C, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, Temp_name_Variable) == 0x000040, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, K2Node_CustomEvent_NotifyName) == 0x000048, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, K2Node_CreateDelegate_OutputDelegate_1) == 0x000050, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_GetOwner_ReturnValue) == 0x000060, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, Temp_bool_IsClosed_Variable_1) == 0x000068, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_IsValid_ReturnValue) == 0x000069, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, K2Node_CustomEvent_NotifyName_1) == 0x00006C, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_PlayAnimMontage_ReturnValue) == 0x000074, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_PlayAnimMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_GetAttachedActors_OutActors) == 0x000078, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_GetAttachedActors_OutActors' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_Array_Length_ReturnValue) == 0x000088, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_Less_IntInt_ReturnValue) == 0x00008C, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_Array_Length_ReturnValue_1) == 0x000090, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_Greater_IntInt_ReturnValue) == 0x000094, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, K2Node_CreateDelegate_OutputDelegate_2) == 0x000098, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, K2Node_CustomEvent_NotifyName_2) == 0x0000A8, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x0000B0, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_IsValid_ReturnValue_1) == 0x0000B8, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_SpawnSoundAttached_ReturnValue) == 0x0000C0, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_SpawnSoundAttached_ReturnValue_1) == 0x0000C8, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_SpawnSoundAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, K2Node_CustomEvent_InputPin) == 0x0000D0, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::K2Node_CustomEvent_InputPin' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_SpawnSoundAttached_ReturnValue_2) == 0x0000D8, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_SpawnSoundAttached_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000E0, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_Array_Add_ReturnValue) == 0x0000F0, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, K2Node_CustomEvent_NotifyName_3) == 0x0000F4, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000FC, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_FindLookAtRotation_ReturnValue) == 0x00010C, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, K2Node_CustomEvent_NotifyName_4) == 0x000118, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_FindLookAtRotation_ReturnValue_1) == 0x000120, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_FindLookAtRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x00012C, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, K2Node_CustomEvent_Target) == 0x0001B8, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::K2Node_CustomEvent_Target' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, Temp_int_Array_Index_Variable) == 0x0001C0, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_Array_Get_Item) == 0x0001C8, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x0001D0, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, K2Node_DynamicCast_AsFort_Pickup) == 0x0001E0, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::K2Node_DynamicCast_AsFort_Pickup' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, K2Node_DynamicCast_bSuccess) == 0x0001E8, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_Array_Get_Item_1) == 0x0001F0, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_Array_Contains_ReturnValue) == 0x0001F8, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_IsValid_ReturnValue_2) == 0x0001F9, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_GetItemEntry_ReturnValue) == 0x000200, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_GetItemEntry_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000390, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, K2Node_DynamicCast_AsFort_Weapon_Item_Definition) == 0x0003A0, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::K2Node_DynamicCast_AsFort_Weapon_Item_Definition' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, K2Node_DynamicCast_bSuccess_1) == 0x0003A8, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_IsValid_ReturnValue_3) == 0x0003A9, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, K2Node_CreateDelegate_OutputDelegate_5) == 0x0003AC, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_IsValid_ReturnValue_4) == 0x0003BC, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_Lerp_ReturnValue_2) == 0x0003C0, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_VLerp_ReturnValue) == 0x0003C4, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_DistanceBetweenTwoVectors_Distance) == 0x0003D0, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_DistanceBetweenTwoVectors_Distance' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_MakeTransform_ReturnValue) == 0x0003E0, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000410, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x000414, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_MakeVector_ReturnValue) == 0x0004A0, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function B_Athena_FloppingRabbit_Wire.B_Athena_FloppingRabbit_Wire_C.ActivateProjectileMovmentComponent
// 0x0008 (0x0008 - 0x0000)
struct B_Athena_FloppingRabbit_Wire_C_ActivateProjectileMovmentComponent final 
{
public:
	class UActorComponent*                        Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_FloppingRabbit_Wire_C_ActivateProjectileMovmentComponent) == 0x000008, "Wrong alinment on B_Athena_FloppingRabbit_Wire_C_ActivateProjectileMovmentComponent");
static_assert(sizeof(B_Athena_FloppingRabbit_Wire_C_ActivateProjectileMovmentComponent) == 0x000008, "Wrong size on B_Athena_FloppingRabbit_Wire_C_ActivateProjectileMovmentComponent");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ActivateProjectileMovmentComponent, Target) == 0x000000, "Member 'B_Athena_FloppingRabbit_Wire_C_ActivateProjectileMovmentComponent::Target' has a wrong offset!");

// Function B_Athena_FloppingRabbit_Wire.B_Athena_FloppingRabbit_Wire_C.AttachNonFishingPickups
// 0x0008 (0x0008 - 0x0000)
struct B_Athena_FloppingRabbit_Wire_C_AttachNonFishingPickups final 
{
public:
	class AFortPickup*                            InputPin;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_FloppingRabbit_Wire_C_AttachNonFishingPickups) == 0x000008, "Wrong alinment on B_Athena_FloppingRabbit_Wire_C_AttachNonFishingPickups");
static_assert(sizeof(B_Athena_FloppingRabbit_Wire_C_AttachNonFishingPickups) == 0x000008, "Wrong size on B_Athena_FloppingRabbit_Wire_C_AttachNonFishingPickups");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_AttachNonFishingPickups, InputPin) == 0x000000, "Member 'B_Athena_FloppingRabbit_Wire_C_AttachNonFishingPickups::InputPin' has a wrong offset!");

// Function B_Athena_FloppingRabbit_Wire.B_Athena_FloppingRabbit_Wire_C.OnCompleted_B5133DFD4E421DB08F1ED09C5E2197B4
// 0x0008 (0x0008 - 0x0000)
struct B_Athena_FloppingRabbit_Wire_C_OnCompleted_B5133DFD4E421DB08F1ED09C5E2197B4 final 
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_FloppingRabbit_Wire_C_OnCompleted_B5133DFD4E421DB08F1ED09C5E2197B4) == 0x000004, "Wrong alinment on B_Athena_FloppingRabbit_Wire_C_OnCompleted_B5133DFD4E421DB08F1ED09C5E2197B4");
static_assert(sizeof(B_Athena_FloppingRabbit_Wire_C_OnCompleted_B5133DFD4E421DB08F1ED09C5E2197B4) == 0x000008, "Wrong size on B_Athena_FloppingRabbit_Wire_C_OnCompleted_B5133DFD4E421DB08F1ED09C5E2197B4");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_OnCompleted_B5133DFD4E421DB08F1ED09C5E2197B4, NotifyName) == 0x000000, "Member 'B_Athena_FloppingRabbit_Wire_C_OnCompleted_B5133DFD4E421DB08F1ED09C5E2197B4::NotifyName' has a wrong offset!");

// Function B_Athena_FloppingRabbit_Wire.B_Athena_FloppingRabbit_Wire_C.OnBlendOut_B5133DFD4E421DB08F1ED09C5E2197B4
// 0x0008 (0x0008 - 0x0000)
struct B_Athena_FloppingRabbit_Wire_C_OnBlendOut_B5133DFD4E421DB08F1ED09C5E2197B4 final 
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_FloppingRabbit_Wire_C_OnBlendOut_B5133DFD4E421DB08F1ED09C5E2197B4) == 0x000004, "Wrong alinment on B_Athena_FloppingRabbit_Wire_C_OnBlendOut_B5133DFD4E421DB08F1ED09C5E2197B4");
static_assert(sizeof(B_Athena_FloppingRabbit_Wire_C_OnBlendOut_B5133DFD4E421DB08F1ED09C5E2197B4) == 0x000008, "Wrong size on B_Athena_FloppingRabbit_Wire_C_OnBlendOut_B5133DFD4E421DB08F1ED09C5E2197B4");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_OnBlendOut_B5133DFD4E421DB08F1ED09C5E2197B4, NotifyName) == 0x000000, "Member 'B_Athena_FloppingRabbit_Wire_C_OnBlendOut_B5133DFD4E421DB08F1ED09C5E2197B4::NotifyName' has a wrong offset!");

// Function B_Athena_FloppingRabbit_Wire.B_Athena_FloppingRabbit_Wire_C.OnInterrupted_B5133DFD4E421DB08F1ED09C5E2197B4
// 0x0008 (0x0008 - 0x0000)
struct B_Athena_FloppingRabbit_Wire_C_OnInterrupted_B5133DFD4E421DB08F1ED09C5E2197B4 final 
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_FloppingRabbit_Wire_C_OnInterrupted_B5133DFD4E421DB08F1ED09C5E2197B4) == 0x000004, "Wrong alinment on B_Athena_FloppingRabbit_Wire_C_OnInterrupted_B5133DFD4E421DB08F1ED09C5E2197B4");
static_assert(sizeof(B_Athena_FloppingRabbit_Wire_C_OnInterrupted_B5133DFD4E421DB08F1ED09C5E2197B4) == 0x000008, "Wrong size on B_Athena_FloppingRabbit_Wire_C_OnInterrupted_B5133DFD4E421DB08F1ED09C5E2197B4");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_OnInterrupted_B5133DFD4E421DB08F1ED09C5E2197B4, NotifyName) == 0x000000, "Member 'B_Athena_FloppingRabbit_Wire_C_OnInterrupted_B5133DFD4E421DB08F1ED09C5E2197B4::NotifyName' has a wrong offset!");

// Function B_Athena_FloppingRabbit_Wire.B_Athena_FloppingRabbit_Wire_C.OnNotifyBegin_B5133DFD4E421DB08F1ED09C5E2197B4
// 0x0008 (0x0008 - 0x0000)
struct B_Athena_FloppingRabbit_Wire_C_OnNotifyBegin_B5133DFD4E421DB08F1ED09C5E2197B4 final 
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_FloppingRabbit_Wire_C_OnNotifyBegin_B5133DFD4E421DB08F1ED09C5E2197B4) == 0x000004, "Wrong alinment on B_Athena_FloppingRabbit_Wire_C_OnNotifyBegin_B5133DFD4E421DB08F1ED09C5E2197B4");
static_assert(sizeof(B_Athena_FloppingRabbit_Wire_C_OnNotifyBegin_B5133DFD4E421DB08F1ED09C5E2197B4) == 0x000008, "Wrong size on B_Athena_FloppingRabbit_Wire_C_OnNotifyBegin_B5133DFD4E421DB08F1ED09C5E2197B4");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_OnNotifyBegin_B5133DFD4E421DB08F1ED09C5E2197B4, NotifyName) == 0x000000, "Member 'B_Athena_FloppingRabbit_Wire_C_OnNotifyBegin_B5133DFD4E421DB08F1ED09C5E2197B4::NotifyName' has a wrong offset!");

// Function B_Athena_FloppingRabbit_Wire.B_Athena_FloppingRabbit_Wire_C.OnNotifyEnd_B5133DFD4E421DB08F1ED09C5E2197B4
// 0x0008 (0x0008 - 0x0000)
struct B_Athena_FloppingRabbit_Wire_C_OnNotifyEnd_B5133DFD4E421DB08F1ED09C5E2197B4 final 
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_FloppingRabbit_Wire_C_OnNotifyEnd_B5133DFD4E421DB08F1ED09C5E2197B4) == 0x000004, "Wrong alinment on B_Athena_FloppingRabbit_Wire_C_OnNotifyEnd_B5133DFD4E421DB08F1ED09C5E2197B4");
static_assert(sizeof(B_Athena_FloppingRabbit_Wire_C_OnNotifyEnd_B5133DFD4E421DB08F1ED09C5E2197B4) == 0x000008, "Wrong size on B_Athena_FloppingRabbit_Wire_C_OnNotifyEnd_B5133DFD4E421DB08F1ED09C5E2197B4");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_OnNotifyEnd_B5133DFD4E421DB08F1ED09C5E2197B4, NotifyName) == 0x000000, "Member 'B_Athena_FloppingRabbit_Wire_C_OnNotifyEnd_B5133DFD4E421DB08F1ED09C5E2197B4::NotifyName' has a wrong offset!");

}

