#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_AthenaPlayerMarker_WithCustomization

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "B_AthenaMapMarkerBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_AthenaPlayerMarker_WithCustomization.B_AthenaPlayerMarker_WithCustomization_C
// 0x0048 (0x05A0 - 0x0558)
class AB_AthenaPlayerMarker_WithCustomization_C final  : public AB_AthenaMapMarkerBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_AthenaPlayerMarker_WithCustomization_C; // 0x0558(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UClass*                                 TopperClass;                                       // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortMapMarkerTopperActor*              TopperInstance;                                    // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             TopperTransform;                                   // 0x0570(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_B_AthenaPlayerMarker_WithCustomization(int32 EntryPoint, class AActor* CallFunc_GetOwner_ReturnValue, class USceneComponent* CallFunc_K2_GetRootComponent_ReturnValue, struct FFortWorldMarkerData& K2Node_Event_MarkerData, bool CallFunc_IsValid_ReturnValue, class UClass* Temp_class_Variable, class UClass* K2Node_ClassDynamicCast_AsFort_Map_Marker_Topper_Actor, bool K2Node_ClassDynamicCast_bSuccess, bool CallFunc_IsValid_ReturnValue_1, class UClass* CallFunc_Conv_SoftClassReferenceToClass_ReturnValue, class UClass* K2Node_ClassDynamicCast_AsFort_Map_Marker_Topper_Actor_1, bool K2Node_ClassDynamicCast_bSuccess_1, bool CallFunc_EqualEqual_ClassClass_ReturnValue, bool CallFunc_IsValid_ReturnValue_2, class UClass* CallFunc_GetObjectClass_ReturnValue, bool CallFunc_EqualEqual_ClassClass_ReturnValue_1, bool CallFunc_NotEqual_ClassClass_ReturnValue, class UClass* K2Node_CustomEvent_Loaded, class AActor* CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue, class AFortMapMarkerTopperActor* CallFunc_FinishSpawningActor_ReturnValue, bool CallFunc_IsValid_ReturnValue_3, TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate);
	void OnMarkerPlaced();
	void UpdateTopper();
	void OnMarkerHidden();
	void OnSetupMarker(struct FFortWorldMarkerData& Param_MarkerData);
	void OnLoaded_8A042AD24DC8A8C0E9D8E0B4BF3B6C37(class UClass* Loaded);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_AthenaPlayerMarker_WithCustomization_C">();
	}
	static class AB_AthenaPlayerMarker_WithCustomization_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_AthenaPlayerMarker_WithCustomization_C>();
	}
};
static_assert(alignof(AB_AthenaPlayerMarker_WithCustomization_C) == 0x000010, "Wrong alinment on AB_AthenaPlayerMarker_WithCustomization_C");
static_assert(sizeof(AB_AthenaPlayerMarker_WithCustomization_C) == 0x0005A0, "Wrong size on AB_AthenaPlayerMarker_WithCustomization_C");
static_assert(offsetof(AB_AthenaPlayerMarker_WithCustomization_C, UberGraphFrame_B_AthenaPlayerMarker_WithCustomization_C) == 0x000558, "Member 'AB_AthenaPlayerMarker_WithCustomization_C::UberGraphFrame_B_AthenaPlayerMarker_WithCustomization_C' has a wrong offset!");
static_assert(offsetof(AB_AthenaPlayerMarker_WithCustomization_C, TopperClass) == 0x000560, "Member 'AB_AthenaPlayerMarker_WithCustomization_C::TopperClass' has a wrong offset!");
static_assert(offsetof(AB_AthenaPlayerMarker_WithCustomization_C, TopperInstance) == 0x000568, "Member 'AB_AthenaPlayerMarker_WithCustomization_C::TopperInstance' has a wrong offset!");
static_assert(offsetof(AB_AthenaPlayerMarker_WithCustomization_C, TopperTransform) == 0x000570, "Member 'AB_AthenaPlayerMarker_WithCustomization_C::TopperTransform' has a wrong offset!");

}

