#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Cosmos_AR_Athena

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "B_Assault_Generic_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Cosmos_AR_Athena.B_Cosmos_AR_Athena_C
// 0x0038 (0x1300 - 0x12C8)
class AB_Cosmos_AR_Athena_C final  : public AB_Assault_Generic_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_Cosmos_AR_Athena_C;               // 0x12C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        OverheatAudioLayer;                                // 0x12D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_Overheat;                                        // 0x12D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_Overheat_V2;                                     // 0x12E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           OverheatFXTimer;                                   // 0x12E8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            OverheatAudioFeedbackCurve;                        // 0x12F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           OverheatFXTimerReplicated;                         // 0x12F8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_Cosmos_AR_Athena(int32 EntryPoint, float Temp_float_Variable, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, float Temp_float_Variable_1, uint8 K2Node_CustomEvent_Overheat_Val_1, bool CallFunc_IsMobilePlatform_ReturnValue, int32 CallFunc_Conv_ByteToInt_ReturnValue, float CallFunc_Conv_IntToFloat_ReturnValue, float CallFunc_Divide_FloatFloat_ReturnValue, float CallFunc_Multiply_FloatFloat_ReturnValue, bool CallFunc_Greater_FloatFloat_ReturnValue, float CallFunc_Subtract_FloatFloat_ReturnValue, float CallFunc_FClamp_ReturnValue, class APawn* CallFunc_GetInstigator_ReturnValue, class USceneComponent* CallFunc_K2_GetRootComponent_ReturnValue, bool Temp_bool_Variable, class UAudioComponent* CallFunc_SpawnSoundAttached_ReturnValue, bool K2Node_Event_bPersistentFire, bool K2Node_Event_bSecondaryFire, float K2Node_Select_Default, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, float CallFunc_GetCurrentOverheatValue_ReturnValue, float CallFunc_GetOverheatingMaxValue_ReturnValue, float CallFunc_Divide_FloatFloat_ReturnValue_1, float CallFunc_GetFloatValue_ReturnValue, class APawn* CallFunc_GetInstigator_ReturnValue_1, class AFortPlayerPawn* K2Node_DynamicCast_AsFort_Player_Pawn, bool K2Node_DynamicCast_bSuccess, uint8 K2Node_CustomEvent_Overheat_Val, bool CallFunc_IsLocallyControlled_ReturnValue, float CallFunc_GetCurrentOverheatValue_ReturnValue_1, float CallFunc_GetOverheatingMaxValue_ReturnValue_1, float CallFunc_Divide_FloatFloat_ReturnValue_2, float CallFunc_Multiply_IntFloat_ReturnValue, class APawn* CallFunc_GetInstigator_ReturnValue_2, int32 CallFunc_FTrunc_ReturnValue, class AFortPlayerController* CallFunc_GetFortPlayerControllerFromActor_ReturnValue, uint8 CallFunc_Conv_IntToByte_ReturnValue);
	void CustomEvent_1();
	void OnStartOverheated();
	void OverheatFXReplicated(uint8 Overheat_Val);
	void CustomEvent_0();
	void OnPlayWeaponFireFX(bool bPersistentFire, bool bSecondaryFire);
	void OnWeaponAttached();
	void OnStartHeating();
	void OnStartCooling();
	void OnFinishedCooling();
	void OverheatFX(uint8 Overheat_Val);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Cosmos_AR_Athena_C">();
	}
	static class AB_Cosmos_AR_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Cosmos_AR_Athena_C>();
	}
};
static_assert(alignof(AB_Cosmos_AR_Athena_C) == 0x000008, "Wrong alinment on AB_Cosmos_AR_Athena_C");
static_assert(sizeof(AB_Cosmos_AR_Athena_C) == 0x001300, "Wrong size on AB_Cosmos_AR_Athena_C");
static_assert(offsetof(AB_Cosmos_AR_Athena_C, UberGraphFrame_B_Cosmos_AR_Athena_C) == 0x0012C8, "Member 'AB_Cosmos_AR_Athena_C::UberGraphFrame_B_Cosmos_AR_Athena_C' has a wrong offset!");
static_assert(offsetof(AB_Cosmos_AR_Athena_C, OverheatAudioLayer) == 0x0012D0, "Member 'AB_Cosmos_AR_Athena_C::OverheatAudioLayer' has a wrong offset!");
static_assert(offsetof(AB_Cosmos_AR_Athena_C, P_Overheat) == 0x0012D8, "Member 'AB_Cosmos_AR_Athena_C::P_Overheat' has a wrong offset!");
static_assert(offsetof(AB_Cosmos_AR_Athena_C, P_Overheat_V2) == 0x0012E0, "Member 'AB_Cosmos_AR_Athena_C::P_Overheat_V2' has a wrong offset!");
static_assert(offsetof(AB_Cosmos_AR_Athena_C, OverheatFXTimer) == 0x0012E8, "Member 'AB_Cosmos_AR_Athena_C::OverheatFXTimer' has a wrong offset!");
static_assert(offsetof(AB_Cosmos_AR_Athena_C, OverheatAudioFeedbackCurve) == 0x0012F0, "Member 'AB_Cosmos_AR_Athena_C::OverheatAudioFeedbackCurve' has a wrong offset!");
static_assert(offsetof(AB_Cosmos_AR_Athena_C, OverheatFXTimerReplicated) == 0x0012F8, "Member 'AB_Cosmos_AR_Athena_C::OverheatFXTimerReplicated' has a wrong offset!");

}

