#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_FloppingRabbit_Weap_Athena

#include "Basic.hpp"

#include "B_UtilityItem_Generic_Athena_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_FloppingRabbit_Weap_Athena.B_FloppingRabbit_Weap_Athena_C
// 0x0020 (0x0D58 - 0x0D38)
class AB_FloppingRabbit_Weap_Athena_C : public AB_UtilityItem_Generic_Athena_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_FloppingRabbit_Weap_Athena_C;     // 0x0D38(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AActor*                                 Projectile;                                        // 0x0D40(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Wire;                                              // 0x0D48(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HideBobber;                                        // 0x0D50(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	bool                                          OneHandGrip;                                       // 0x0D51(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)

public:
	void ExecuteUbergraph_B_FloppingRabbit_Weap_Athena(int32 EntryPoint, class AB_Athena_FloppingRabbit_Wire_C* K2Node_DynamicCast_AsB_Athena_Flopping_Rabbit_Wire, bool K2Node_DynamicCast_bSuccess, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, class APawn* CallFunc_GetInstigator_ReturnValue, bool CallFunc_IsValid_ReturnValue_2, class AFortPawn* K2Node_DynamicCast_AsFort_Pawn, bool K2Node_DynamicCast_bSuccess_1, class APrj_Athena_FloppingRabbit_C* K2Node_DynamicCast_AsPrj_Athena_Flopping_Rabbit, bool K2Node_DynamicCast_bSuccess_2, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, class APawn* CallFunc_GetInstigator_ReturnValue_1, class AFortPawn* K2Node_DynamicCast_AsFort_Pawn_1, bool K2Node_DynamicCast_bSuccess_3);
	void OnHolstered();
	void UnbindHolsterEvents();
	void BindHolsterEvents();
	void OnTetherDetached();
	void ForceKillFishing();
	void OnWeaponAttached();
	void K2_OnUnEquip();
	void ReceiveBeginPlay();
	void OnRep_HideBobber();
	void OnRep_OneHandGrip();
	class FName DetermineFishLootTierNameAndSetLootForSpawner(bool bIsExplosion, TScriptInterface<class IFortFishingInterface> K2Node_DynamicCast_AsFort_Fishing_Interface, bool K2Node_DynamicCast_bSuccess, class FName CallFunc_DetermineFishLootTierNameAndSetLootForSpawner_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_FloppingRabbit_Weap_Athena_C">();
	}
	static class AB_FloppingRabbit_Weap_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_FloppingRabbit_Weap_Athena_C>();
	}
};
static_assert(alignof(AB_FloppingRabbit_Weap_Athena_C) == 0x000008, "Wrong alinment on AB_FloppingRabbit_Weap_Athena_C");
static_assert(sizeof(AB_FloppingRabbit_Weap_Athena_C) == 0x000D58, "Wrong size on AB_FloppingRabbit_Weap_Athena_C");
static_assert(offsetof(AB_FloppingRabbit_Weap_Athena_C, UberGraphFrame_B_FloppingRabbit_Weap_Athena_C) == 0x000D38, "Member 'AB_FloppingRabbit_Weap_Athena_C::UberGraphFrame_B_FloppingRabbit_Weap_Athena_C' has a wrong offset!");
static_assert(offsetof(AB_FloppingRabbit_Weap_Athena_C, Projectile) == 0x000D40, "Member 'AB_FloppingRabbit_Weap_Athena_C::Projectile' has a wrong offset!");
static_assert(offsetof(AB_FloppingRabbit_Weap_Athena_C, Wire) == 0x000D48, "Member 'AB_FloppingRabbit_Weap_Athena_C::Wire' has a wrong offset!");
static_assert(offsetof(AB_FloppingRabbit_Weap_Athena_C, HideBobber) == 0x000D50, "Member 'AB_FloppingRabbit_Weap_Athena_C::HideBobber' has a wrong offset!");
static_assert(offsetof(AB_FloppingRabbit_Weap_Athena_C, OneHandGrip) == 0x000D51, "Member 'AB_FloppingRabbit_Weap_Athena_C::OneHandGrip' has a wrong offset!");

}

