#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_HeldObjectSocket

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_HeldObjectSocket.B_HeldObjectSocket_C
// 0x0050 (0x0820 - 0x07D0)
class AB_HeldObjectSocket_C final  : public ABuildingGameplayActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        SocketLocation;                                    // 0x07D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x07E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          HasSocketedHeldObject;                             // 0x07E8(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	uint8                                         Pad_6B6A[0x7];                                     // 0x07E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_HeldObject_Parent_C*                 HeldObject;                                        // 0x07F0(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  RequiredHeldObjectTags;                            // 0x07F8(0x0020)(Edit, BlueprintVisible, ExposeOnSpawn)
	class AB_HeldObjectSocketManager_C*           HeldObjectSocketManager;                           // 0x0818(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_HeldObjectSocket(int32 EntryPoint, TDelegate<void(class AActor* SelfActor, class AActor* OtherActor, const struct FVector& NormalImpulse, struct FHitResult& Hit)> K2Node_CreateDelegate_OutputDelegate, class AActor* K2Node_CustomEvent_SelfActor, class AActor* K2Node_CustomEvent_OtherActor, const struct FVector& K2Node_CustomEvent_NormalImpulse, struct FHitResult& K2Node_CustomEvent_Hit, class AB_HeldObject_Parent_C* K2Node_DynamicCast_AsB_Held_Object_Parent, bool K2Node_DynamicCast_bSuccess, class AB_HeldObject_Parent_C* CallFunc_ValidateHeldObject_HeldObject_Output, bool CallFunc_ValidateHeldObject_IsValid);
	void EventOnSocketEmptied();
	void EventOnSocketFilled();
	void OnHitHeldObject(class AActor* SelfActor, class AActor* OtherActor, const struct FVector& NormalImpulse, struct FHitResult& Hit);
	void ReceiveBeginPlay();
	void OnRep_SocketIsFilled(bool CallFunc_IsValid_ReturnValue);
	void ValidateHeldObject(class AB_HeldObject_Parent_C* HeldObject_Input, class AB_HeldObject_Parent_C** HeldObject_Output, bool* IsValid, TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput, bool CallFunc_HasAllMatchingGameplayTags_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_HeldObjectSocket_C">();
	}
	static class AB_HeldObjectSocket_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_HeldObjectSocket_C>();
	}
};
static_assert(alignof(AB_HeldObjectSocket_C) == 0x000008, "Wrong alinment on AB_HeldObjectSocket_C");
static_assert(sizeof(AB_HeldObjectSocket_C) == 0x000820, "Wrong size on AB_HeldObjectSocket_C");
static_assert(offsetof(AB_HeldObjectSocket_C, UberGraphFrame) == 0x0007D0, "Member 'AB_HeldObjectSocket_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_HeldObjectSocket_C, SocketLocation) == 0x0007D8, "Member 'AB_HeldObjectSocket_C::SocketLocation' has a wrong offset!");
static_assert(offsetof(AB_HeldObjectSocket_C, Sphere) == 0x0007E0, "Member 'AB_HeldObjectSocket_C::Sphere' has a wrong offset!");
static_assert(offsetof(AB_HeldObjectSocket_C, HasSocketedHeldObject) == 0x0007E8, "Member 'AB_HeldObjectSocket_C::HasSocketedHeldObject' has a wrong offset!");
static_assert(offsetof(AB_HeldObjectSocket_C, HeldObject) == 0x0007F0, "Member 'AB_HeldObjectSocket_C::HeldObject' has a wrong offset!");
static_assert(offsetof(AB_HeldObjectSocket_C, RequiredHeldObjectTags) == 0x0007F8, "Member 'AB_HeldObjectSocket_C::RequiredHeldObjectTags' has a wrong offset!");
static_assert(offsetof(AB_HeldObjectSocket_C, HeldObjectSocketManager) == 0x000818, "Member 'AB_HeldObjectSocket_C::HeldObjectSocketManager' has a wrong offset!");

}

