#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_HeldObjectSocketManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_HeldObjectSocketManager.B_HeldObjectSocketManager_C
// 0x0048 (0x0818 - 0x07D0)
class AB_HeldObjectSocketManager_C final  : public ABuildingGameplayActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x07D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class AB_HeldObjectSocket_C*>          HeldObjectSockets;                                 // 0x07E0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, ExposeOnSpawn, HasGetValueTypeHash)
	TArray<struct FGameplayTagContainer>          CurrentTags;                                       // 0x07F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<struct FGameplayTagContainer>          DefaultCorrectTags;                                // 0x0800(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          CombinationCorrect;                                // 0x0810(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	bool                                          SocketOrderMatters;                                // 0x0811(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_B_HeldObjectSocketManager(int32 EntryPoint, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, class AB_HeldObjectSocket_C* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue);
	void OnCombinationCorrect();
	void ReceiveBeginPlay();
	void UpdateHeldObjectTags(class AB_HeldObjectSocket_C* ChangedSocket, TScriptInterface<class IGameplayTagAssetInterface> CallFunc_GetOwnedGameplayTags_self_CastInput, const struct FGameplayTagContainer& CallFunc_GetOwnedGameplayTags_TagContainer, struct FGameplayTagContainer& Temp_struct_Variable, int32 CallFunc_Array_Find_ReturnValue);
	void VerifyHeldObjectTags(TArray<struct FGameplayTagContainer>& CorrectTags, TArray<struct FGameplayTagContainer>& Param_CurrentTags, bool OrderMatters, bool* IsValidMatch, bool TagsAreInOrder, const struct FGameplayTagContainer& ConcatenatedCurrentTags, const struct FGameplayTagContainer& ConcatenatedCorrectTags, int32 CallFunc_Array_Length_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_1, int32 CallFunc_Array_Length_ReturnValue_2, int32 CallFunc_Array_Length_ReturnValue_3, int32 Temp_int_Loop_Counter_Variable, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable, bool Temp_bool_True_if_break_was_hit_Variable, const struct FGameplayTagContainer& CallFunc_Array_Get_Item, bool CallFunc_Not_PreBool_ReturnValue, int32 Temp_int_Array_Index_Variable_1, const struct FGameplayTagContainer& CallFunc_Array_Get_Item_1, int32 Temp_int_Loop_Counter_Variable_1, bool CallFunc_Less_IntInt_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue_1, int32 Temp_int_Array_Index_Variable_2, bool CallFunc_HasAllTags_ReturnValue, const struct FGameplayTagContainer& CallFunc_Array_Get_Item_2, bool CallFunc_Greater_IntInt_ReturnValue, bool CallFunc_HasAllTags_ReturnValue_1, int32 Temp_int_Loop_Counter_Variable_2, bool CallFunc_Less_IntInt_ReturnValue_2, int32 CallFunc_Add_IntInt_ReturnValue_2, bool CallFunc_BooleanAND_ReturnValue);
	void CheckTagMatches(bool CallFunc_VerifyHeldObjectTags_IsValidMatch);
	void OnRep_CombinationCorrect();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_HeldObjectSocketManager_C">();
	}
	static class AB_HeldObjectSocketManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_HeldObjectSocketManager_C>();
	}
};
static_assert(alignof(AB_HeldObjectSocketManager_C) == 0x000008, "Wrong alinment on AB_HeldObjectSocketManager_C");
static_assert(sizeof(AB_HeldObjectSocketManager_C) == 0x000818, "Wrong size on AB_HeldObjectSocketManager_C");
static_assert(offsetof(AB_HeldObjectSocketManager_C, UberGraphFrame) == 0x0007D0, "Member 'AB_HeldObjectSocketManager_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_HeldObjectSocketManager_C, DefaultSceneRoot) == 0x0007D8, "Member 'AB_HeldObjectSocketManager_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AB_HeldObjectSocketManager_C, HeldObjectSockets) == 0x0007E0, "Member 'AB_HeldObjectSocketManager_C::HeldObjectSockets' has a wrong offset!");
static_assert(offsetof(AB_HeldObjectSocketManager_C, CurrentTags) == 0x0007F0, "Member 'AB_HeldObjectSocketManager_C::CurrentTags' has a wrong offset!");
static_assert(offsetof(AB_HeldObjectSocketManager_C, DefaultCorrectTags) == 0x000800, "Member 'AB_HeldObjectSocketManager_C::DefaultCorrectTags' has a wrong offset!");
static_assert(offsetof(AB_HeldObjectSocketManager_C, CombinationCorrect) == 0x000810, "Member 'AB_HeldObjectSocketManager_C::CombinationCorrect' has a wrong offset!");
static_assert(offsetof(AB_HeldObjectSocketManager_C, SocketOrderMatters) == 0x000811, "Member 'AB_HeldObjectSocketManager_C::SocketOrderMatters' has a wrong offset!");

}

