#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_HeldObject_Parent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_HeldObject_Parent.B_HeldObject_Parent_C
// 0x0050 (0x0820 - 0x07D0)
class AB_HeldObject_Parent_C final  : public ABuildingGameplayActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCapsuleComponent*                      Capsule;                                           // 0x07D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortProjectileMovementComponent*       FortProjectileMovement;                            // 0x07E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x07E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          IsHeld;                                            // 0x07F0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	uint8                                         Pad_6C00[0x7];                                     // 0x07F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        HoldingPawn;                                       // 0x07F8(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Vector_HoldingOffset;                              // 0x0800(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ThrowSpeed;                                        // 0x080C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSocketed;                                        // 0x0810(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	uint8                                         Pad_6C01[0x7];                                     // 0x0811(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_HeldObjectSocket_C*                  HoldingSocket;                                     // 0x0818(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_HeldObject_Parent(int32 EntryPoint, class AFortPawn* K2Node_Event_InteractingPawn, EInteractionBeingAttempted K2Node_Event_InteractionBeingAttempted, class AFortPlayerPawn* K2Node_DynamicCast_AsFort_Player_Pawn, bool K2Node_DynamicCast_bSuccess);
	void ReceiveBeginPlay();
	void BlueprintOnInteract(class AFortPawn* InteractingPawn, EInteractionBeingAttempted InteractionBeingAttempted);
	void OnRep_IsHeld(const struct FHitResult& CallFunc_K2_SetActorRelativeLocation_SweepHitResult, const struct FActiveGameplayEffectHandle& CallFunc_ApplyGlobalEnvironmentGameplayEffectToActor_ReturnValue);
	void OnRep_IsSocketed(bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsValid_ReturnValue_1);

	bool BlueprintCanInteract(class AFortPawn* InteractingPawn, EInteractionBeingAttempted InteractionBeingAttempted, ETInteractionType InteractionType, bool CallFunc_Not_PreBool_ReturnValue) const;
	class FText BlueprintGetInteractionString(class AFortPawn* InteractingPawn, EInteractionBeingAttempted InteractionBeingAttempted) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_HeldObject_Parent_C">();
	}
	static class AB_HeldObject_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_HeldObject_Parent_C>();
	}
};
static_assert(alignof(AB_HeldObject_Parent_C) == 0x000008, "Wrong alinment on AB_HeldObject_Parent_C");
static_assert(sizeof(AB_HeldObject_Parent_C) == 0x000820, "Wrong size on AB_HeldObject_Parent_C");
static_assert(offsetof(AB_HeldObject_Parent_C, UberGraphFrame) == 0x0007D0, "Member 'AB_HeldObject_Parent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_HeldObject_Parent_C, Capsule) == 0x0007D8, "Member 'AB_HeldObject_Parent_C::Capsule' has a wrong offset!");
static_assert(offsetof(AB_HeldObject_Parent_C, FortProjectileMovement) == 0x0007E0, "Member 'AB_HeldObject_Parent_C::FortProjectileMovement' has a wrong offset!");
static_assert(offsetof(AB_HeldObject_Parent_C, StaticMesh) == 0x0007E8, "Member 'AB_HeldObject_Parent_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(AB_HeldObject_Parent_C, IsHeld) == 0x0007F0, "Member 'AB_HeldObject_Parent_C::IsHeld' has a wrong offset!");
static_assert(offsetof(AB_HeldObject_Parent_C, HoldingPawn) == 0x0007F8, "Member 'AB_HeldObject_Parent_C::HoldingPawn' has a wrong offset!");
static_assert(offsetof(AB_HeldObject_Parent_C, Vector_HoldingOffset) == 0x000800, "Member 'AB_HeldObject_Parent_C::Vector_HoldingOffset' has a wrong offset!");
static_assert(offsetof(AB_HeldObject_Parent_C, ThrowSpeed) == 0x00080C, "Member 'AB_HeldObject_Parent_C::ThrowSpeed' has a wrong offset!");
static_assert(offsetof(AB_HeldObject_Parent_C, IsSocketed) == 0x000810, "Member 'AB_HeldObject_Parent_C::IsSocketed' has a wrong offset!");
static_assert(offsetof(AB_HeldObject_Parent_C, HoldingSocket) == 0x000818, "Member 'AB_HeldObject_Parent_C::HoldingSocket' has a wrong offset!");

}

