#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Pickups_Default

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "B_Pickups_Parent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Pickups_Default.B_Pickups_Default_C
// 0x0028 (0x04C8 - 0x04A0)
class AB_Pickups_Default_C final  : public AB_Pickups_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_Pickups_Default_C;                // 0x04A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Sm_rare_pickup;                                    // 0x04A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight;                                         // 0x04B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Background;                                        // 0x04B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFXSystemComponent*                     ParticleSystem;                                    // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_Pickups_Default(int32 EntryPoint, bool CallFunc_IsValid_ReturnValue, class AFortPawn* K2Node_Event_PickupTarget, bool CallFunc_IsValid_ReturnValue_1, float CallFunc_Multiply_FloatFloat_ReturnValue, const struct FRotator& CallFunc_MakeRotator_ReturnValue, const struct FHitResult& CallFunc_K2_SetRelativeRotation_SweepHitResult, bool CallFunc_IsValid_ReturnValue_2, bool CallFunc_GreaterEqual_IntInt_ReturnValue, const struct FVector& CallFunc_Conv_LinearColorToVector_ReturnValue, bool CallFunc_GetPickupRarityMID_bNeedsToBeInitialized, class UMaterialInstanceDynamic* CallFunc_GetPickupRarityMID_ReturnValue);
	void ReceiveBeginPlay();
	void HideBackgroundAndSpotlight();
	void OnPickedUp(class AFortPawn* PickupTarget);
	void OnTossed();
	void UserConstructionScript();
	void Setup_Light(bool CallFunc_EqualEqual_IntInt_ReturnValue, bool CallFunc_IsMobilePlatform_ReturnValue, bool CallFunc_BooleanOR_ReturnValue, class UGameUserSettings* CallFunc_GetGameUserSettings_ReturnValue, int32 CallFunc_GetVisualEffectQuality_ReturnValue, bool K2Node_SwitchInteger_CmpSuccess);
	void Set_Initial_BKGD_Param(class UMaterialInstanceDynamic* Mid, float CallFunc_RandomFloatInRange_ReturnValue, bool CallFunc_GreaterEqual_IntInt_ReturnValue, float CallFunc_Multiply_FloatFloat_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Pickups_Default_C">();
	}
	static class AB_Pickups_Default_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Pickups_Default_C>();
	}
};
static_assert(alignof(AB_Pickups_Default_C) == 0x000008, "Wrong alinment on AB_Pickups_Default_C");
static_assert(sizeof(AB_Pickups_Default_C) == 0x0004C8, "Wrong size on AB_Pickups_Default_C");
static_assert(offsetof(AB_Pickups_Default_C, UberGraphFrame_B_Pickups_Default_C) == 0x0004A0, "Member 'AB_Pickups_Default_C::UberGraphFrame_B_Pickups_Default_C' has a wrong offset!");
static_assert(offsetof(AB_Pickups_Default_C, Sm_rare_pickup) == 0x0004A8, "Member 'AB_Pickups_Default_C::Sm_rare_pickup' has a wrong offset!");
static_assert(offsetof(AB_Pickups_Default_C, SpotLight) == 0x0004B0, "Member 'AB_Pickups_Default_C::SpotLight' has a wrong offset!");
static_assert(offsetof(AB_Pickups_Default_C, Background) == 0x0004B8, "Member 'AB_Pickups_Default_C::Background' has a wrong offset!");
static_assert(offsetof(AB_Pickups_Default_C, ParticleSystem) == 0x0004C0, "Member 'AB_Pickups_Default_C::ParticleSystem' has a wrong offset!");

}

