#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Pistol_Flintlock_Athena

#include "Basic.hpp"

#include "B_Pistol_Generic_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Pistol_Flintlock_Athena.B_Pistol_Flintlock_Athena_C
// 0x0018 (0x12E0 - 0x12C8)
class AB_Pistol_Flintlock_Athena_C : public AB_Pistol_Generic_C
{
public:
	class UStaticMeshComponent*                   Flintlock_SingleShot_Powder_Top;                   // 0x12C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Flintlock_SingleShot_Powder_bottom;                // 0x12D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Flintlock_SingleShot_Ram;                          // 0x12D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Pistol_Flintlock_Athena_C">();
	}
	static class AB_Pistol_Flintlock_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Pistol_Flintlock_Athena_C>();
	}
};
static_assert(alignof(AB_Pistol_Flintlock_Athena_C) == 0x000008, "Wrong alinment on AB_Pistol_Flintlock_Athena_C");
static_assert(sizeof(AB_Pistol_Flintlock_Athena_C) == 0x0012E0, "Wrong size on AB_Pistol_Flintlock_Athena_C");
static_assert(offsetof(AB_Pistol_Flintlock_Athena_C, Flintlock_SingleShot_Powder_Top) == 0x0012C8, "Member 'AB_Pistol_Flintlock_Athena_C::Flintlock_SingleShot_Powder_Top' has a wrong offset!");
static_assert(offsetof(AB_Pistol_Flintlock_Athena_C, Flintlock_SingleShot_Powder_bottom) == 0x0012D0, "Member 'AB_Pistol_Flintlock_Athena_C::Flintlock_SingleShot_Powder_bottom' has a wrong offset!");
static_assert(offsetof(AB_Pistol_Flintlock_Athena_C, Flintlock_SingleShot_Ram) == 0x0012D8, "Member 'AB_Pistol_Flintlock_Athena_C::Flintlock_SingleShot_Ram' has a wrong offset!");

}

