#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_CO2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Prj_CO2.B_Prj_CO2_C
// 0x00D8 (0x0A78 - 0x09A0)
class AB_Prj_CO2_C final  : public AFortProjectileAthena
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x09A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               P_Foam_Prj_Trail;                                  // 0x09A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x09B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitLocation;                                       // 0x09B8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WaterTraceRadius;                                  // 0x09C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      WaterTraceObjectTypes;                             // 0x09C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	float                                         LandscapeExtinguishRadius;                         // 0x09D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             LastHit;                                           // 0x09DC(0x008C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                HitNormal;                                         // 0x0A68(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_Prj_CO2(int32 EntryPoint, bool Temp_bool_IsClosed_Variable, struct FHitResult& K2Node_Event_Hit_1, bool Temp_bool_Has_Been_Initd_Variable, class UPrimitiveComponent* K2Node_Event_MyComp, class AActor* K2Node_Event_Other, class UPrimitiveComponent* K2Node_Event_OtherComp, bool K2Node_Event_bSelfMoved, const struct FVector& K2Node_Event_HitLocation, const struct FVector& K2Node_Event_HitNormal, const struct FVector& K2Node_Event_NormalImpulse, struct FHitResult& K2Node_Event_Hit, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue);
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, const struct FVector& Param_HitLocation, const struct FVector& Param_HitNormal, const struct FVector& NormalImpulse, struct FHitResult& Hit);
	void ReceiveDestroyed();
	void OnStop(struct FHitResult& Hit);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void ApplyWaterInRadiusIfCurieEnabled(const struct FHitResult& HitResult, bool CallFunc_IsDedicatedServer_ReturnValue, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable, TArray<class AActor*>& K2Node_MakeArray_Array, const struct FVector& CallFunc_GetActorScale3D_ReturnValue, float CallFunc_VSize_ReturnValue, float CallFunc_Multiply_FloatFloat_ReturnValue, bool CallFunc_IsCurieActive_ReturnValue, TArray<class AActor*>& CallFunc_SphereOverlapActors_OutActors, bool CallFunc_SphereOverlapActors_ReturnValue, class AActor* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, const struct FHitResult& CallFunc_MakeHitResult_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_IsValid_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Prj_CO2_C">();
	}
	static class AB_Prj_CO2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Prj_CO2_C>();
	}
};
static_assert(alignof(AB_Prj_CO2_C) == 0x000008, "Wrong alinment on AB_Prj_CO2_C");
static_assert(sizeof(AB_Prj_CO2_C) == 0x000A78, "Wrong size on AB_Prj_CO2_C");
static_assert(offsetof(AB_Prj_CO2_C, UberGraphFrame) == 0x0009A0, "Member 'AB_Prj_CO2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Prj_CO2_C, P_Foam_Prj_Trail) == 0x0009A8, "Member 'AB_Prj_CO2_C::P_Foam_Prj_Trail' has a wrong offset!");
static_assert(offsetof(AB_Prj_CO2_C, StaticMesh) == 0x0009B0, "Member 'AB_Prj_CO2_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(AB_Prj_CO2_C, HitLocation) == 0x0009B8, "Member 'AB_Prj_CO2_C::HitLocation' has a wrong offset!");
static_assert(offsetof(AB_Prj_CO2_C, WaterTraceRadius) == 0x0009C4, "Member 'AB_Prj_CO2_C::WaterTraceRadius' has a wrong offset!");
static_assert(offsetof(AB_Prj_CO2_C, WaterTraceObjectTypes) == 0x0009C8, "Member 'AB_Prj_CO2_C::WaterTraceObjectTypes' has a wrong offset!");
static_assert(offsetof(AB_Prj_CO2_C, LandscapeExtinguishRadius) == 0x0009D8, "Member 'AB_Prj_CO2_C::LandscapeExtinguishRadius' has a wrong offset!");
static_assert(offsetof(AB_Prj_CO2_C, LastHit) == 0x0009DC, "Member 'AB_Prj_CO2_C::LastHit' has a wrong offset!");
static_assert(offsetof(AB_Prj_CO2_C, HitNormal) == 0x000A68, "Member 'AB_Prj_CO2_C::HitNormal' has a wrong offset!");

}

