#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Athena_ChillBronco

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "B_Prj_ThrownConsumable_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Prj_Athena_ChillBronco.B_Prj_Athena_ChillBronco_C
// 0x0158 (0x0A70 - 0x0918)
class AB_Prj_Athena_ChillBronco_C final  : public AB_Prj_ThrownConsumable_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_Prj_Athena_ChillBronco_C;         // 0x0918(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               Proj_Trail;                                        // 0x0920(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_ChugBomb;                                       // 0x0928(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio_InAirLoop;                                   // 0x0930(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              PlayerPawn;                                        // 0x0938(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitLocation;                                       // 0x0940(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitNormal;                                         // 0x094C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HealthHealAmount;                                  // 0x0958(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ShieldHealAmount;                                  // 0x095C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxHealAmount;                                     // 0x0960(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66F7[0x4];                                     // 0x0964(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         MaxHealValue;                                      // 0x0968(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         HealPool_Duration;                                 // 0x0990(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          GrantHealth;                                       // 0x09B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          GrantShield;                                       // 0x09B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_66F8[0x6];                                     // 0x09BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        HealOnlyFX;                                        // 0x09C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Stopped;                                           // 0x09C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_66F9[0x7];                                     // 0x09C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         HitActors;                                         // 0x09D0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, HasGetValueTypeHash)
	class AFortPlayerPawn*                        HitPlayerPawn;                                     // 0x09E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      Owning_Player_Quest_Manager;                       // 0x09E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  Heal_Teammate_TC;                                  // 0x09F0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  Heal_Squadmate_TC;                                 // 0x0A10(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         WaterTraceRadius;                                  // 0x0A30(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66FA[0x4];                                     // 0x0A34(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      WaterTraceObjectTypes;                             // 0x0A38(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	float                                         LandscapeExtinguishRadius;                         // 0x0A48(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66FB[0x4];                                     // 0x0A4C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  TraceIgnoreTags;                                   // 0x0A50(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_B_Prj_Athena_ChillBronco(int32 EntryPoint, bool Temp_bool_IsClosed_Variable, float CallFunc_GetValueAtLevel_ReturnValue, float CallFunc_Subtract_FloatFloat_ReturnValue, class UPrimitiveComponent* K2Node_Event_MyComp, class AActor* K2Node_Event_Other, class UPrimitiveComponent* K2Node_Event_OtherComp, bool K2Node_Event_bSelfMoved, const struct FVector& K2Node_Event_HitLocation, const struct FVector& K2Node_Event_HitNormal, const struct FVector& K2Node_Event_NormalImpulse, struct FHitResult& K2Node_Event_Hit, class AFortPawn* K2Node_DynamicCast_AsFort_Pawn, bool K2Node_DynamicCast_bSuccess, float CallFunc_Conv_IntToFloat_ReturnValue, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue, const struct FTransform& CallFunc_Conv_VectorToTransform_ReturnValue, class AActor* CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue, class AB_Decal_ChillBronco_C* CallFunc_FinishSpawningActor_ReturnValue, class UAbilitySystemComponent* CallFunc_GetAbilitySystemComponent_ReturnValue, class USceneComponent* CallFunc_K2_GetRootComponent_ReturnValue, bool CallFunc_IsDBNO_ReturnValue, class UAbilitySystemComponent* CallFunc_GetAbilitySystemComponent_ReturnValue_1, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, bool CallFunc_HasAuthority_ReturnValue, float CallFunc_RandomFloatInRange_ReturnValue, const struct FTransform& CallFunc_Conv_VectorToTransform_ReturnValue_1, const struct FRotator& CallFunc_MakeRotFromX_ReturnValue, class AActor* CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1, float CallFunc_BreakRotator_Roll, float CallFunc_BreakRotator_Pitch, float CallFunc_BreakRotator_Yaw, class AB_Decal_ChillBronco_C* CallFunc_FinishSpawningActor_ReturnValue_1, float CallFunc_Multiply_FloatFloat_ReturnValue, class USceneComponent* CallFunc_K2_GetRootComponent_ReturnValue_1, float CallFunc_Add_FloatFloat_ReturnValue, const struct FRotator& CallFunc_MakeRotator_ReturnValue, const struct FHitResult& CallFunc_K2_SetWorldRotation_SweepHitResult, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, float CallFunc_GetValueAtLevel_ReturnValue_1, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, float CallFunc_BreakRotator_Roll_1, float CallFunc_BreakRotator_Pitch_1, float CallFunc_BreakRotator_Yaw_1, float CallFunc_RandomFloatInRange_ReturnValue_1, float CallFunc_Add_FloatFloat_ReturnValue_1, const struct FRotator& CallFunc_MakeRotator_ReturnValue_1, const struct FHitResult& CallFunc_K2_SetWorldRotation_SweepHitResult_1, bool CallFunc_BooleanOR_ReturnValue, class UAbilitySystemComponent* CallFunc_GetAbilitySystemComponent_ReturnValue_2, class UFortAbilitySystemComponent* K2Node_DynamicCast_AsFort_Ability_System_Component, bool K2Node_DynamicCast_bSuccess_1, class AActor* K2Node_Event_OtherActor, class UPrimitiveComponent* K2Node_Event_OtherComp_1, struct FHitResult& K2Node_Event_HitResult, bool K2Node_Event_bIsOverlap, const struct FGameplayEffectContextHandle& CallFunc_MakeFortEffectContext_ReturnValue, const struct FActiveGameplayEffectHandle& CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue, bool CallFunc_BreakHitResult_bBlockingHit, bool CallFunc_BreakHitResult_bInitialOverlap, float CallFunc_BreakHitResult_Time, float CallFunc_BreakHitResult_Distance, const struct FVector& CallFunc_BreakHitResult_Location, const struct FVector& CallFunc_BreakHitResult_ImpactPoint, const struct FVector& CallFunc_BreakHitResult_Normal, const struct FVector& CallFunc_BreakHitResult_ImpactNormal, class UPhysicalMaterial* CallFunc_BreakHitResult_PhysMat, class AActor* CallFunc_BreakHitResult_HitActor, class UPrimitiveComponent* CallFunc_BreakHitResult_HitComponent, class FName CallFunc_BreakHitResult_HitBoneName, int32 CallFunc_BreakHitResult_HitItem, int32 CallFunc_BreakHitResult_ElementIndex, int32 CallFunc_BreakHitResult_FaceIndex, const struct FVector& CallFunc_BreakHitResult_TraceStart, const struct FVector& CallFunc_BreakHitResult_TraceEnd, bool CallFunc_ComponentHasTag_ReturnValue, float CallFunc_Conv_IntToFloat_ReturnValue_1, class UAbilitySystemComponent* CallFunc_GetAbilitySystemComponent_ReturnValue_3, TArray<class AActor*>& K2Node_Event_HitActors, TArray<struct FHitResult>& K2Node_Event_HitResults, class UFortAbilitySystemComponent* K2Node_DynamicCast_AsFort_Ability_System_Component_1, bool K2Node_DynamicCast_bSuccess_2, const struct FGameplayEffectContextHandle& CallFunc_MakeFortEffectContext_ReturnValue_1, const struct FActiveGameplayEffectHandle& CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_1, int32 Temp_int_Array_Index_Variable, class AFortWaterBodyActor* K2Node_ComponentBoundEvent_WaterBody, class UFortWaterInteractionComponent* K2Node_ComponentBoundEvent_WaterInteractionComponent, bool K2Node_ComponentBoundEvent_bIsFirstBody, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, const struct FGameplayAbilityTargetDataHandle& CallFunc_AbilityTargetDataFromActorArray_ReturnValue, const struct FGameplayEventData& K2Node_MakeStruct_GameplayEventData, bool Temp_bool_Has_Been_Initd_Variable, TArray<class AActor*>& K2Node_CustomEvent_HitActors, int32 CallFunc_Array_Length_ReturnValue, class AActor* CallFunc_Array_Get_Item, bool CallFunc_Less_IntInt_ReturnValue, class AFortPawn* K2Node_DynamicCast_AsFort_Pawn_1, bool K2Node_DynamicCast_bSuccess_3, int32 CallFunc_Array_Add_ReturnValue, bool CallFunc_Array_Contains_ReturnValue);
	void DoHealCheck(TArray<class AActor*>& Param_HitActors);
	void BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature(class AFortWaterBodyActor* WaterBody, class UFortWaterInteractionComponent* Param_WaterInteractionComponent, bool bIsFirstBody);
	void EnableCollision();
	void KillDelay();
	void HealPlayer();
	void ReceiveBeginPlay();
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, const struct FVector& Param_HitLocation, const struct FVector& Param_HitNormal, const struct FVector& NormalImpulse, struct FHitResult& Hit);
	void OnTouched(class AActor* OtherActor, class UPrimitiveComponent* OtherComp, struct FHitResult& HitResult, bool bIsOverlap);
	void OnExploded(TArray<class AActor*>& Param_HitActors, TArray<struct FHitResult>& HitResults);
	void UserConstructionScript();
	void GetMissingHealth(float* MissingHealth, float CallFunc_GetHealth_ReturnValue, float CallFunc_GetMaxHealth_ReturnValue, float CallFunc_Subtract_FloatFloat_ReturnValue);
	void GetMissingShield(float* MissingShield, float CallFunc_GetMaxShield_ReturnValue, float CallFunc_GetShield_ReturnValue, float CallFunc_Subtract_FloatFloat_ReturnValue);
	void ResetVariables(float CallFunc_GetValueAtLevel_ReturnValue, float CallFunc_Subtract_FloatFloat_ReturnValue);
	void OnRep_PlayerPawn();
	void QuestCheckSquadMember(class AFortPawn* PlayerPawnHit, bool Is_Team_Mate, bool Is_Squad_Member, class AFortPlayerController* Owning_Player_PC, class AFortPlayerPawn* K2Node_DynamicCast_AsFort_Player_Pawn, bool K2Node_DynamicCast_bSuccess, const class FString& CallFunc_Conv_BoolToString_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue, bool CallFunc_SendComplexCustomStatEvent_QuestActive, bool CallFunc_SendComplexCustomStatEvent_QuestCompleted, bool CallFunc_IsValid_ReturnValue, const class FString& CallFunc_Conv_BoolToString_ReturnValue_1, const class FString& CallFunc_Conv_BoolToString_ReturnValue_2, const class FString& CallFunc_Concat_StrStr_ReturnValue_1, const class FString& CallFunc_Concat_StrStr_ReturnValue_2, bool CallFunc_SendComplexCustomStatEvent_QuestActive_1, bool CallFunc_SendComplexCustomStatEvent_QuestCompleted_1, class UFortQuestManager* CallFunc_GetQuestManager_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue, class AController* CallFunc_GetController_ReturnValue, class AActor* CallFunc_GetOwner_ReturnValue, class AFortPlayerStateAthena* K2Node_DynamicCast_AsFort_Player_State_Athena, bool K2Node_DynamicCast_bSuccess_1, bool CallFunc_NotEqual_ObjectObject_ReturnValue, bool CallFunc_OnSameTeam_ReturnValue, bool CallFunc_IsInSquad_ReturnValue, class AFortPlayerPawnAthena* K2Node_DynamicCast_AsFort_Player_Pawn_Athena, bool K2Node_DynamicCast_bSuccess_2, class AFortPlayerController* CallFunc_GetFortPlayerControllerFromActor_ReturnValue);
	void ApplyWaterInRadiusIfCurieEnabled(const struct FHitResult& HitResult, bool CallFunc_IsDedicatedServer_ReturnValue, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, TArray<class AActor*>& K2Node_MakeArray_Array, bool CallFunc_IsCurieActive_ReturnValue, int32 Temp_int_Array_Index_Variable, const struct FVector& CallFunc_GetActorScale3D_ReturnValue, float CallFunc_VSize_ReturnValue, float CallFunc_Multiply_FloatFloat_ReturnValue, TArray<class AActor*>& CallFunc_SphereOverlapActors_OutActors, bool CallFunc_SphereOverlapActors_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, class AActor* CallFunc_Array_Get_Item, bool CallFunc_Less_IntInt_ReturnValue, const struct FHitResult& CallFunc_MakeHitResult_ReturnValue, bool CallFunc_IsValid_ReturnValue);
	void UpdateHealthShieldHealAmounts(float CallFunc_GetValueAtLevel_ReturnValue, float CallFunc_GetMissingHealth_MissingHealth, float CallFunc_Subtract_FloatFloat_ReturnValue, bool CallFunc_Greater_FloatFloat_ReturnValue, float CallFunc_GetMissingShield_MissingShield, float CallFunc_FClamp_ReturnValue, bool CallFunc_Greater_FloatFloat_ReturnValue_1, int32 CallFunc_FTrunc_ReturnValue, bool CallFunc_Greater_FloatFloat_ReturnValue_2, float CallFunc_GetMissingHealth_MissingHealth_1, float CallFunc_FClamp_ReturnValue_1, int32 CallFunc_FTrunc_ReturnValue_1, float CallFunc_Subtract_FloatFloat_ReturnValue_1);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Prj_Athena_ChillBronco_C">();
	}
	static class AB_Prj_Athena_ChillBronco_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Prj_Athena_ChillBronco_C>();
	}
};
static_assert(alignof(AB_Prj_Athena_ChillBronco_C) == 0x000008, "Wrong alinment on AB_Prj_Athena_ChillBronco_C");
static_assert(sizeof(AB_Prj_Athena_ChillBronco_C) == 0x000A70, "Wrong size on AB_Prj_Athena_ChillBronco_C");
static_assert(offsetof(AB_Prj_Athena_ChillBronco_C, UberGraphFrame_B_Prj_Athena_ChillBronco_C) == 0x000918, "Member 'AB_Prj_Athena_ChillBronco_C::UberGraphFrame_B_Prj_Athena_ChillBronco_C' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_ChillBronco_C, Proj_Trail) == 0x000920, "Member 'AB_Prj_Athena_ChillBronco_C::Proj_Trail' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_ChillBronco_C, SK_ChugBomb) == 0x000928, "Member 'AB_Prj_Athena_ChillBronco_C::SK_ChugBomb' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_ChillBronco_C, Audio_InAirLoop) == 0x000930, "Member 'AB_Prj_Athena_ChillBronco_C::Audio_InAirLoop' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_ChillBronco_C, PlayerPawn) == 0x000938, "Member 'AB_Prj_Athena_ChillBronco_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_ChillBronco_C, HitLocation) == 0x000940, "Member 'AB_Prj_Athena_ChillBronco_C::HitLocation' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_ChillBronco_C, HitNormal) == 0x00094C, "Member 'AB_Prj_Athena_ChillBronco_C::HitNormal' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_ChillBronco_C, HealthHealAmount) == 0x000958, "Member 'AB_Prj_Athena_ChillBronco_C::HealthHealAmount' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_ChillBronco_C, ShieldHealAmount) == 0x00095C, "Member 'AB_Prj_Athena_ChillBronco_C::ShieldHealAmount' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_ChillBronco_C, MaxHealAmount) == 0x000960, "Member 'AB_Prj_Athena_ChillBronco_C::MaxHealAmount' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_ChillBronco_C, MaxHealValue) == 0x000968, "Member 'AB_Prj_Athena_ChillBronco_C::MaxHealValue' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_ChillBronco_C, HealPool_Duration) == 0x000990, "Member 'AB_Prj_Athena_ChillBronco_C::HealPool_Duration' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_ChillBronco_C, GrantHealth) == 0x0009B8, "Member 'AB_Prj_Athena_ChillBronco_C::GrantHealth' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_ChillBronco_C, GrantShield) == 0x0009B9, "Member 'AB_Prj_Athena_ChillBronco_C::GrantShield' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_ChillBronco_C, HealOnlyFX) == 0x0009C0, "Member 'AB_Prj_Athena_ChillBronco_C::HealOnlyFX' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_ChillBronco_C, Stopped) == 0x0009C8, "Member 'AB_Prj_Athena_ChillBronco_C::Stopped' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_ChillBronco_C, HitActors) == 0x0009D0, "Member 'AB_Prj_Athena_ChillBronco_C::HitActors' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_ChillBronco_C, HitPlayerPawn) == 0x0009E0, "Member 'AB_Prj_Athena_ChillBronco_C::HitPlayerPawn' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_ChillBronco_C, Owning_Player_Quest_Manager) == 0x0009E8, "Member 'AB_Prj_Athena_ChillBronco_C::Owning_Player_Quest_Manager' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_ChillBronco_C, Heal_Teammate_TC) == 0x0009F0, "Member 'AB_Prj_Athena_ChillBronco_C::Heal_Teammate_TC' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_ChillBronco_C, Heal_Squadmate_TC) == 0x000A10, "Member 'AB_Prj_Athena_ChillBronco_C::Heal_Squadmate_TC' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_ChillBronco_C, WaterTraceRadius) == 0x000A30, "Member 'AB_Prj_Athena_ChillBronco_C::WaterTraceRadius' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_ChillBronco_C, WaterTraceObjectTypes) == 0x000A38, "Member 'AB_Prj_Athena_ChillBronco_C::WaterTraceObjectTypes' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_ChillBronco_C, LandscapeExtinguishRadius) == 0x000A48, "Member 'AB_Prj_Athena_ChillBronco_C::LandscapeExtinguishRadius' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_ChillBronco_C, TraceIgnoreTags) == 0x000A50, "Member 'AB_Prj_Athena_ChillBronco_C::TraceIgnoreTags' has a wrong offset!");

}

