#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_ThrownConsumable

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "B_Prj_ThrownConsumable_Parent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Prj_ThrownConsumable.B_Prj_ThrownConsumable_C
// 0x0088 (0x0918 - 0x0890)
class AB_Prj_ThrownConsumable_C : public AB_Prj_ThrownConsumable_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_Prj_ThrownConsumable_C;           // 0x0890(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URotatingMovementComponent*             RotatingMovement;                                  // 0x0898(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortCollisionAudioComponent*           FortCollisionAudio;                                // 0x08A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Fuse_Particle;                                     // 0x08A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Mesh;                                              // 0x08B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        GrenadeFuse_AudioComponent;                        // 0x08B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        P_Explosion;                                       // 0x08C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ExplosionRadius;                                   // 0x08C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63A4[0x4];                                     // 0x08CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UForceFeedbackEffect*                   ExplosionForceFeedbackNear;                        // 0x08D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UForceFeedbackEffect*                   ExplosionForceFeedbackFar;                         // 0x08D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 ExplosionCameraShake;                              // 0x08E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Cue_GrenadeFuseSound;                              // 0x08E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Cue_CloseSound;                                    // 0x08F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Cue_DistantSound;                                  // 0x08F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Cue_Bounce;                                        // 0x0900(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               ExplosionRotation;                                 // 0x0908(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_B_Prj_ThrownConsumable(int32 EntryPoint, bool CallFunc_IsDedicatedServer_ReturnValue, float CallFunc_Multiply_FloatFloat_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_1, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_2, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_3, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_4, TArray<EFortTeamAffiliation>& K2Node_MakeArray_Array, uint8 CallFunc_GetActorTeam_ReturnValue, struct FHitResult& K2Node_Event_Hit_1, bool CallFunc_IsValid_ReturnValue, bool CallFunc_BreakHitResult_bBlockingHit, bool CallFunc_BreakHitResult_bInitialOverlap, float CallFunc_BreakHitResult_Time, float CallFunc_BreakHitResult_Distance, const struct FVector& CallFunc_BreakHitResult_Location, const struct FVector& CallFunc_BreakHitResult_ImpactPoint, const struct FVector& CallFunc_BreakHitResult_Normal, const struct FVector& CallFunc_BreakHitResult_ImpactNormal, class UPhysicalMaterial* CallFunc_BreakHitResult_PhysMat, class AActor* CallFunc_BreakHitResult_HitActor, class UPrimitiveComponent* CallFunc_BreakHitResult_HitComponent, class FName CallFunc_BreakHitResult_HitBoneName, int32 CallFunc_BreakHitResult_HitItem, int32 CallFunc_BreakHitResult_ElementIndex, int32 CallFunc_BreakHitResult_FaceIndex, const struct FVector& CallFunc_BreakHitResult_TraceStart, const struct FVector& CallFunc_BreakHitResult_TraceEnd, bool CallFunc_IsValid_ReturnValue_1, uint8 CallFunc_GetActorTeam_ReturnValue_1, TArray<EFortTeamAffiliation>& K2Node_MakeArray_Array_1, class APawn* CallFunc_GetInstigator_ReturnValue, bool CallFunc_IsLocallyControlled_ReturnValue, const struct FVector& CallFunc_Multiply_VectorVector_ReturnValue, TArray<class AActor*>& K2Node_Event_HitActors, TArray<struct FHitResult>& K2Node_Event_HitResults, struct FHitResult& K2Node_Event_Hit, bool CallFunc_IsDedicatedServer_ReturnValue_1, bool CallFunc_OnCollision_OutResult, float CallFunc_OnCollision_OutMagnitude, class UParticleSystemComponent* CallFunc_SpawnEmitterAtLocation_ReturnValue, bool CallFunc_IsDedicatedServer_ReturnValue_2);
	void ResetSimulatedComponents();
	void OnStop(struct FHitResult& Hit);
	void OnBounce(struct FHitResult& Hit);
	void OnExploded(TArray<class AActor*>& HitActors, TArray<struct FHitResult>& HitResults);
	void ReceiveBeginPlay();
	void UserConstructionScript(bool CallFunc_IsDedicatedServer_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Prj_ThrownConsumable_C">();
	}
	static class AB_Prj_ThrownConsumable_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Prj_ThrownConsumable_C>();
	}
};
static_assert(alignof(AB_Prj_ThrownConsumable_C) == 0x000008, "Wrong alinment on AB_Prj_ThrownConsumable_C");
static_assert(sizeof(AB_Prj_ThrownConsumable_C) == 0x000918, "Wrong size on AB_Prj_ThrownConsumable_C");
static_assert(offsetof(AB_Prj_ThrownConsumable_C, UberGraphFrame_B_Prj_ThrownConsumable_C) == 0x000890, "Member 'AB_Prj_ThrownConsumable_C::UberGraphFrame_B_Prj_ThrownConsumable_C' has a wrong offset!");
static_assert(offsetof(AB_Prj_ThrownConsumable_C, RotatingMovement) == 0x000898, "Member 'AB_Prj_ThrownConsumable_C::RotatingMovement' has a wrong offset!");
static_assert(offsetof(AB_Prj_ThrownConsumable_C, FortCollisionAudio) == 0x0008A0, "Member 'AB_Prj_ThrownConsumable_C::FortCollisionAudio' has a wrong offset!");
static_assert(offsetof(AB_Prj_ThrownConsumable_C, Fuse_Particle) == 0x0008A8, "Member 'AB_Prj_ThrownConsumable_C::Fuse_Particle' has a wrong offset!");
static_assert(offsetof(AB_Prj_ThrownConsumable_C, Mesh) == 0x0008B0, "Member 'AB_Prj_ThrownConsumable_C::Mesh' has a wrong offset!");
static_assert(offsetof(AB_Prj_ThrownConsumable_C, GrenadeFuse_AudioComponent) == 0x0008B8, "Member 'AB_Prj_ThrownConsumable_C::GrenadeFuse_AudioComponent' has a wrong offset!");
static_assert(offsetof(AB_Prj_ThrownConsumable_C, P_Explosion) == 0x0008C0, "Member 'AB_Prj_ThrownConsumable_C::P_Explosion' has a wrong offset!");
static_assert(offsetof(AB_Prj_ThrownConsumable_C, ExplosionRadius) == 0x0008C8, "Member 'AB_Prj_ThrownConsumable_C::ExplosionRadius' has a wrong offset!");
static_assert(offsetof(AB_Prj_ThrownConsumable_C, ExplosionForceFeedbackNear) == 0x0008D0, "Member 'AB_Prj_ThrownConsumable_C::ExplosionForceFeedbackNear' has a wrong offset!");
static_assert(offsetof(AB_Prj_ThrownConsumable_C, ExplosionForceFeedbackFar) == 0x0008D8, "Member 'AB_Prj_ThrownConsumable_C::ExplosionForceFeedbackFar' has a wrong offset!");
static_assert(offsetof(AB_Prj_ThrownConsumable_C, ExplosionCameraShake) == 0x0008E0, "Member 'AB_Prj_ThrownConsumable_C::ExplosionCameraShake' has a wrong offset!");
static_assert(offsetof(AB_Prj_ThrownConsumable_C, Cue_GrenadeFuseSound) == 0x0008E8, "Member 'AB_Prj_ThrownConsumable_C::Cue_GrenadeFuseSound' has a wrong offset!");
static_assert(offsetof(AB_Prj_ThrownConsumable_C, Cue_CloseSound) == 0x0008F0, "Member 'AB_Prj_ThrownConsumable_C::Cue_CloseSound' has a wrong offset!");
static_assert(offsetof(AB_Prj_ThrownConsumable_C, Cue_DistantSound) == 0x0008F8, "Member 'AB_Prj_ThrownConsumable_C::Cue_DistantSound' has a wrong offset!");
static_assert(offsetof(AB_Prj_ThrownConsumable_C, Cue_Bounce) == 0x000900, "Member 'AB_Prj_ThrownConsumable_C::Cue_Bounce' has a wrong offset!");
static_assert(offsetof(AB_Prj_ThrownConsumable_C, ExplosionRotation) == 0x000908, "Member 'AB_Prj_ThrownConsumable_C::ExplosionRotation' has a wrong offset!");

}

