#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Athena_Grenade_MolotovCocktail

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "B_Prj_Athena_Grenade_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Prj_Athena_Grenade_MolotovCocktail.B_Prj_Athena_Grenade_MolotovCocktail_C
// 0x01B8 (0x0BA0 - 0x09E8)
class AB_Prj_Athena_Grenade_MolotovCocktail_C final  : public AB_Prj_Athena_Grenade_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_Prj_Athena_Grenade_MolotovCocktail_C; // 0x09E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Niagara_Projectile_Particles;                      // 0x09F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Hit_Location;                                      // 0x09F8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7145[0x4];                                     // 0x0A04(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Bottle_Smash_Audio_Cue;                            // 0x0A08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Ignite_Audio_Cue;                                  // 0x0A10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Hit_Normal;                                        // 0x0A18(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7146[0x4];                                     // 0x0A24(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        ProjectileSpawnVectors;                            // 0x0A28(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FScalableFloat                         SpawnedProjectileMinSpeed;                         // 0x0A38(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         SpawnedProjectileMaxSpeed;                         // 0x0A60(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         ConeHalfAngleInDegrees;                            // 0x0A88(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         FireBallsToSpawn;                                  // 0x0AB0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          CurieActivated;                                    // 0x0AD8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7147[0x7];                                     // 0x0AD9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         DoWeUseHomingProjectile;                           // 0x0AE0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector                                ReflectionVector;                                  // 0x0B08(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FireflyProjectileAngleExtreme;                     // 0x0B14(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FireflyProjectileDirection;                        // 0x0B18(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FireflyProjectileRadius_Min;                       // 0x0B24(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FireflyProjectileRadius_Max;                       // 0x0B28(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FireflyProjectileEndPoint;                         // 0x0B2C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumProjectileSpawned;                              // 0x0B38(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumProjectilesToSpawn;                             // 0x0B3C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NewTemp;                                           // 0x0B40(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnteredWater;                                      // 0x0B4C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Hit;                                               // 0x0B4D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7148[0x2];                                     // 0x0B4E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemAsset*                         Sound_EnterWater;                                  // 0x0B50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWorldItemDefinition*               ItemToSpawn_Molotov;                               // 0x0B58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanInteractWithWater;                              // 0x0B60(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7149[0xF];                                     // 0x0B61(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             SpawnBGATransform;                                 // 0x0B70(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_B_Prj_Athena_Grenade_MolotovCocktail(int32 EntryPoint, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, bool CallFunc_HasAuthority_ReturnValue, bool Temp_bool_Has_Been_Initd_Variable, bool Temp_bool_IsClosed_Variable, const struct FRotator& CallFunc_Conv_VectorToRotator_ReturnValue, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue, class AFortPickup* CallFunc_K2_SpawnPickupInWorld_ReturnValue, class UFXSystemComponent* CallFunc_SpawnFXAtLocation_ReturnValue, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_1, class UPrimitiveComponent* K2Node_Event_MyComp, class AActor* K2Node_Event_Other, class UPrimitiveComponent* K2Node_Event_OtherComp, bool K2Node_Event_bSelfMoved, const struct FVector& K2Node_Event_HitLocation, const struct FVector& K2Node_Event_HitNormal, const struct FVector& K2Node_Event_NormalImpulse, struct FHitResult& K2Node_Event_Hit, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue_1, class UFXSystemComponent* CallFunc_SpawnFXAtLocation_ReturnValue_1, class AActor* CallFunc_GetOwner_ReturnValue, bool Temp_bool_IsClosed_Variable_1, TArray<class AFortPlayerController*>& Temp_object_Variable, const struct FVector& CallFunc_MirrorVectorByNormal_ReturnValue, const struct FVector& CallFunc_ProjectVectorOnToPlane_ReturnValue, const struct FVector& CallFunc_Normal_ReturnValue, bool CallFunc_IsDedicatedServer_ReturnValue, float CallFunc_Multiply_FloatFloat_ReturnValue, const struct FVector& CallFunc_RotateAngleAxis_ReturnValue, float CallFunc_GetValueAtLevel_ReturnValue, bool CallFunc_EqualEqual_FloatFloat_ReturnValue, const struct FRotator& CallFunc_Conv_VectorToRotator_ReturnValue_1, class UFortAsyncAction_OnCurieActivated* CallFunc_OnCurieActivated_ReturnValue, const struct FTransform& CallFunc_MakeTransform_ReturnValue, bool CallFunc_IsValid_ReturnValue, const struct FTimerHandle& CallFunc_K2_SetTimer_ReturnValue, float CallFunc_GetValueAtLevel_ReturnValue_1, int32 CallFunc_FTrunc_ReturnValue, class AFortWaterBodyActor* K2Node_ComponentBoundEvent_WaterBody, class UFortWaterInteractionComponent* K2Node_ComponentBoundEvent_WaterInteractionComponent, bool K2Node_ComponentBoundEvent_bIsFirstBody, bool Temp_bool_Has_Been_Initd_Variable_1, bool CallFunc_IsInWater_ReturnValue, class ABuildingGameplayActor* CallFunc_SpawnBuildingGameplayActor_ReturnValue);
	void Defer_BGA_Spawn();
	void HasEnteredWater();
	void BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature(class AFortWaterBodyActor* WaterBody, class UFortWaterInteractionComponent* Param_WaterInteractionComponent, bool bIsFirstBody);
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, const struct FVector& HitLocation, const struct FVector& HitNormal, const struct FVector& NormalImpulse, struct FHitResult& Param_Hit);
	void ReceiveBeginPlay();
	void OnCurieActive_7575DCC3440AA42836D7988BCA6485E5();
	void Drunk_Projectiles(class UCurveFloat* Temp_object_Variable, class UCurveFloat* Temp_object_Variable_1, float CallFunc_GetValueAtLevel_ReturnValue, bool CallFunc_RandomBool_ReturnValue, int32 CallFunc_FTrunc_ReturnValue, float CallFunc_RandomFloatInRange_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue, float CallFunc_GetValueAtLevel_ReturnValue_1, float CallFunc_GetValueAtLevel_ReturnValue_2, float CallFunc_RandomFloatInRange_ReturnValue_1, bool Temp_bool_Variable, float CallFunc_GetValueAtLevel_ReturnValue_3, int32 Temp_int_Variable, class UCurveFloat* K2Node_Select_Default, const struct FProjectileMovementDrunkConfig& CallFunc_MakeProjectileMovementDrunkConfig_ReturnValue, bool CallFunc_LessEqual_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, const struct FVector& CallFunc_Array_Get_Item, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue, const struct FVector& CallFunc_Add_VectorVector_ReturnValue, class AActor* CallFunc_GetOwner_ReturnValue, const struct FVector& CallFunc_RandomUnitVectorInConeInDegrees_ReturnValue, const struct FRotator& CallFunc_MakeRotFromX_ReturnValue, class AFortProjectileBase* CallFunc_SpawnProjectile_ReturnValue);
	void FireflyProjectileLogic(const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue, bool CallFunc_EqualEqual_IntInt_ReturnValue, bool CallFunc_EqualEqual_IntInt_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue, float CallFunc_Divide_FloatFloat_ReturnValue, float CallFunc_Multiply_IntFloat_ReturnValue, float CallFunc_RandomFloatInRange_ReturnValue, float CallFunc_Subtract_FloatFloat_ReturnValue, float CallFunc_RandomFloatInRange_ReturnValue_1, const struct FVector& CallFunc_RotateAngleAxis_ReturnValue, const struct FVector& CallFunc_Add_VectorVector_ReturnValue, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue_1, const struct FRotator& CallFunc_MakeRotFromX_ReturnValue, float CallFunc_RandomFloatInRange_ReturnValue_2, int32 Temp_int_Variable, const struct FProjectileHomingData& K2Node_MakeStruct_ProjectileHomingData, bool CallFunc_LessEqual_IntInt_ReturnValue, float CallFunc_RandomFloatInRange_ReturnValue_3, class AActor* CallFunc_GetOwner_ReturnValue, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue, class AFortProjectileBase* CallFunc_SpawnProjectile_ReturnValue, TScriptInterface<class IFortProjectileMovementInterface> CallFunc_SetHomingData_self_CastInput);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Prj_Athena_Grenade_MolotovCocktail_C">();
	}
	static class AB_Prj_Athena_Grenade_MolotovCocktail_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Prj_Athena_Grenade_MolotovCocktail_C>();
	}
};
static_assert(alignof(AB_Prj_Athena_Grenade_MolotovCocktail_C) == 0x000010, "Wrong alinment on AB_Prj_Athena_Grenade_MolotovCocktail_C");
static_assert(sizeof(AB_Prj_Athena_Grenade_MolotovCocktail_C) == 0x000BA0, "Wrong size on AB_Prj_Athena_Grenade_MolotovCocktail_C");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, UberGraphFrame_B_Prj_Athena_Grenade_MolotovCocktail_C) == 0x0009E8, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::UberGraphFrame_B_Prj_Athena_Grenade_MolotovCocktail_C' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, Niagara_Projectile_Particles) == 0x0009F0, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::Niagara_Projectile_Particles' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, Hit_Location) == 0x0009F8, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::Hit_Location' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, Bottle_Smash_Audio_Cue) == 0x000A08, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::Bottle_Smash_Audio_Cue' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, Ignite_Audio_Cue) == 0x000A10, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::Ignite_Audio_Cue' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, Hit_Normal) == 0x000A18, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::Hit_Normal' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, ProjectileSpawnVectors) == 0x000A28, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::ProjectileSpawnVectors' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, SpawnedProjectileMinSpeed) == 0x000A38, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::SpawnedProjectileMinSpeed' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, SpawnedProjectileMaxSpeed) == 0x000A60, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::SpawnedProjectileMaxSpeed' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, ConeHalfAngleInDegrees) == 0x000A88, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::ConeHalfAngleInDegrees' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, FireBallsToSpawn) == 0x000AB0, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::FireBallsToSpawn' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, CurieActivated) == 0x000AD8, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::CurieActivated' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, DoWeUseHomingProjectile) == 0x000AE0, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::DoWeUseHomingProjectile' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, ReflectionVector) == 0x000B08, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::ReflectionVector' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, FireflyProjectileAngleExtreme) == 0x000B14, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::FireflyProjectileAngleExtreme' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, FireflyProjectileDirection) == 0x000B18, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::FireflyProjectileDirection' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, FireflyProjectileRadius_Min) == 0x000B24, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::FireflyProjectileRadius_Min' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, FireflyProjectileRadius_Max) == 0x000B28, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::FireflyProjectileRadius_Max' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, FireflyProjectileEndPoint) == 0x000B2C, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::FireflyProjectileEndPoint' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, NumProjectileSpawned) == 0x000B38, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::NumProjectileSpawned' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, NumProjectilesToSpawn) == 0x000B3C, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::NumProjectilesToSpawn' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, NewTemp) == 0x000B40, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::NewTemp' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, EnteredWater) == 0x000B4C, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::EnteredWater' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, Hit) == 0x000B4D, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::Hit' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, Sound_EnterWater) == 0x000B50, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::Sound_EnterWater' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, ItemToSpawn_Molotov) == 0x000B58, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::ItemToSpawn_Molotov' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, CanInteractWithWater) == 0x000B60, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::CanInteractWithWater' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, SpawnBGATransform) == 0x000B70, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::SpawnBGATransform' has a wrong offset!");

}

