#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Ranged_Rocket_Athena

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Prj_Ranged_Rocket_Athena.B_Prj_Ranged_Rocket_Athena_C
// 0x0220 (0x0A98 - 0x0878)
class AB_Prj_Ranged_Rocket_Athena_C final  : public AFortProjectileBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0878(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_SurfaceTypeSoundComponent_C*        BP_SurfaceTypeSoundComponent;                      // 0x0880(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Rocket_AudioComponent;                             // 0x0888(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Mesh;                                              // 0x0890(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CollisionMesh;                                     // 0x0898(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPostProcessComponent*                  PP_Explode;                                        // 0x08A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         PPFader_PPFade_6840155342A20C80B8C71EB25DE77BD9;   // 0x08A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            PPFader__Direction_6840155342A20C80B8C71EB25DE77BD9; // 0x08AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F8C[0x3];                                     // 0x08AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     PPFader;                                           // 0x08B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Ribbon_Trail_PSC;                                  // 0x08B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Water_Explosion_PSC;                               // 0x08C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        Ribbon_Trail_PS;                                   // 0x08C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        Water_Explosion_PS;                                // 0x08D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Explosion_Generic_PSC;                             // 0x08D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Rocket_Projectile_Explosion_Sound;                 // 0x08E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                StopLocation;                                      // 0x08E8(0x000C)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_6F8D[0x4];                                     // 0x08F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      ObjectsToTraceAgainst;                             // 0x08F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UParticleSystem*                        Explosion_Flesh_Damage_PS;                         // 0x0908(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               StopRotZ;                                          // 0x0910(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay)
	float                                         TrailLifetime;                                     // 0x091C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Explosion_Flesh_Damage_PSC;                        // 0x0920(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Rocket_Projectile_Explosion_Water_Sound;           // 0x0928(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Rocket_Projectile_InAir_Sound;                     // 0x0930(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               RocketTrailPS;                                     // 0x0938(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Tick_Delta;                                        // 0x0940(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	float                                         RocketSpinRate;                                    // 0x0944(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Explosion_Impact_Offset;                           // 0x0948(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               RocketSpin;                                        // 0x094C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                RocketScale;                                       // 0x0958(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TimerMaxReached_;                                  // 0x0964(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay)
	uint8                                         Pad_6F8E[0x3];                                     // 0x0965(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Ground_Decal;                                      // 0x0968(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Ground_Decal_MID;                                  // 0x0970(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Decal_Size_Max;                                    // 0x0978(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Decal_Size_Min;                                    // 0x097C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DecalLocation;                                     // 0x0980(0x000C)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              SurfaceType;                                       // 0x098C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_6F8F[0x3];                                     // 0x098D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               Explosion_PS;                                      // 0x0990(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           FeedbackCue;                                       // 0x0998(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         WaterInteractionDelay;                             // 0x09A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_6F90[0x4];                                     // 0x09A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      RocketTrailPS_Niagara;                             // 0x09A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemComponent*                     Grenade_Explosion_FX_System;                       // 0x09B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortPortableSoftParticles             Grenade_Explosion_Asset;                           // 0x09B8(0x0058)(Edit, BlueprintVisible)
	class UFXSystemAsset*                         Explosion_Asset;                                   // 0x0A10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	struct FFortPortableSoftParticles             Rocket_Trail_Asset;                                // 0x0A18(0x0058)(Edit, BlueprintVisible)
	class UFXSystemAsset*                         Rocket_Trial_Asset;                                // 0x0A70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	bool                                          IsNiagaraEnabled;                                  // 0x0A78(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay)
	uint8                                         Pad_6F91[0x3];                                     // 0x0A79(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PlayRate;                                          // 0x0A7C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Radius;                                            // 0x0A80(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Strength;                                          // 0x0A84(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Time_Decay;                                        // 0x0A88(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F92[0x4];                                     // 0x0A8C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemAsset*                         Explosion_Asset_Water;                             // 0x0A90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_Prj_Ranged_Rocket_Athena(int32 EntryPoint, TArray<class AFortPlayerController*>& Temp_object_Variable, int32 CallFunc_GetConsoleVariableIntValue_ReturnValue, bool CallFunc_EqualEqual_IntInt_ReturnValue, struct FHitResult& K2Node_Event_Hit_1, struct FHitResult& K2Node_Event_Hit, bool CallFunc_BreakHitResult_bBlockingHit, bool CallFunc_BreakHitResult_bInitialOverlap, float CallFunc_BreakHitResult_Time, float CallFunc_BreakHitResult_Distance, const struct FVector& CallFunc_BreakHitResult_Location, const struct FVector& CallFunc_BreakHitResult_ImpactPoint, const struct FVector& CallFunc_BreakHitResult_Normal, const struct FVector& CallFunc_BreakHitResult_ImpactNormal, class UPhysicalMaterial* CallFunc_BreakHitResult_PhysMat, class AActor* CallFunc_BreakHitResult_HitActor, class UPrimitiveComponent* CallFunc_BreakHitResult_HitComponent, class FName CallFunc_BreakHitResult_HitBoneName, int32 CallFunc_BreakHitResult_HitItem, int32 CallFunc_BreakHitResult_ElementIndex, int32 CallFunc_BreakHitResult_FaceIndex, const struct FVector& CallFunc_BreakHitResult_TraceStart, const struct FVector& CallFunc_BreakHitResult_TraceEnd, const struct FRotator& CallFunc_MakeRotFromZ_ReturnValue, bool CallFunc_IsBeingKilled_ReturnValue, TArray<class AActor*>& K2Node_Event_HitActors, TArray<struct FHitResult>& K2Node_Event_HitResults, bool CallFunc_IsDedicatedServer_ReturnValue, bool CallFunc_IsDedicatedServer_ReturnValue_1, float K2Node_Event_DeltaSeconds, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue, float CallFunc_Multiply_FloatFloat_ReturnValue, const struct FRotator& CallFunc_MakeRotator_ReturnValue, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue, const struct FVector& CallFunc_Add_VectorVector_ReturnValue, const struct FHitResult& CallFunc_K2_AddLocalRotation_SweepHitResult, bool CallFunc_IsActive_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsDedicatedServer_ReturnValue_2, bool CallFunc_EqualEqual_ByteByte_ReturnValue, class APlayerCameraManager* CallFunc_GetPlayerCameraManager_ReturnValue, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue_1, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue, float CallFunc_VSize_ReturnValue, bool CallFunc_LessEqual_FloatFloat_ReturnValue, const struct FTimerHandle& CallFunc_K2_SetTimer_ReturnValue, class AActor* K2Node_Event_OtherActor, class UPrimitiveComponent* K2Node_Event_OtherComp, struct FHitResult& K2Node_Event_HitResult, bool K2Node_Event_bIsOverlap, bool CallFunc_BreakHitResult_bBlockingHit_1, bool CallFunc_BreakHitResult_bInitialOverlap_1, float CallFunc_BreakHitResult_Time_1, float CallFunc_BreakHitResult_Distance_1, const struct FVector& CallFunc_BreakHitResult_Location_1, const struct FVector& CallFunc_BreakHitResult_ImpactPoint_1, const struct FVector& CallFunc_BreakHitResult_Normal_1, const struct FVector& CallFunc_BreakHitResult_ImpactNormal_1, class UPhysicalMaterial* CallFunc_BreakHitResult_PhysMat_1, class AActor* CallFunc_BreakHitResult_HitActor_1, class UPrimitiveComponent* CallFunc_BreakHitResult_HitComponent_1, class FName CallFunc_BreakHitResult_HitBoneName_1, int32 CallFunc_BreakHitResult_HitItem_1, int32 CallFunc_BreakHitResult_ElementIndex_1, int32 CallFunc_BreakHitResult_FaceIndex_1, const struct FVector& CallFunc_BreakHitResult_TraceStart_1, const struct FVector& CallFunc_BreakHitResult_TraceEnd_1, bool CallFunc_ComponentHasTag_ReturnValue, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue_1, const struct FTransform& CallFunc_MakeTransform_ReturnValue, class AActor* CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue, class AFN_RadialForce_C* CallFunc_FinishSpawningActor_ReturnValue, const struct FGameplayCueParameters& CallFunc_MakeGameplayCueParameters_ReturnValue, bool CallFunc_IsInWater_ReturnValue, bool CallFunc_BooleanOR_ReturnValue, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, bool CallFunc_Greater_FloatFloat_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_IsBeingKilled_ReturnValue_1, bool CallFunc_IsInWater_ReturnValue_1, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, bool CallFunc_IsActive_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_2, float CallFunc_RandomFloatInRange_ReturnValue, const struct FRotator& CallFunc_MakeRotator_ReturnValue_1, bool CallFunc_IsDedicatedServer_ReturnValue_3, class UFXSystemComponent* CallFunc_SpawnFXAtLocation_ReturnValue, bool CallFunc_IsValid_ReturnValue_3, bool CallFunc_IsValid_ReturnValue_4, class UFXSystemComponent* CallFunc_SpawnFXSystemAttached_ReturnValue, class UParticleSystemComponent* K2Node_DynamicCast_AsParticle_System_Component, bool K2Node_DynamicCast_bSuccess, class UNiagaraComponent* K2Node_DynamicCast_AsNiagara_Particle_System, bool K2Node_DynamicCast_bSuccess_1, class UFXSystemComponent* CallFunc_SpawnFXAtLocation_ReturnValue_1);
	void RocketWaterDelay();
	void OnTouched(class AActor* OtherActor, class UPrimitiveComponent* OtherComp, struct FHitResult& HitResult, bool bIsOverlap);
	void ReceiveDestroyed();
	void ReceiveTick(float DeltaSeconds);
	void OnExploded(TArray<class AActor*>& HitActors, TArray<struct FHitResult>& HitResults);
	void FuseTimerMax();
	void ReceiveBeginPlay();
	void OnStop(struct FHitResult& Hit);
	void OnBounce(struct FHitResult& Hit);
	void PPFader__UpdateFunc();
	void PPFader__FinishedFunc();
	void UserConstructionScript(bool Temp_bool_Variable, class UFXSystemAsset* Temp_object_Variable, class UFXSystemAsset* Temp_object_Variable_1, bool Temp_bool_Variable_1, class UFXSystemAsset* Temp_object_Variable_2, class UFXSystemAsset* Temp_object_Variable_3, bool CallFunc_IsNiagaraFXTypeEnabled_ReturnValue, bool CallFunc_IsNiagaraFXTypeEnabled_ReturnValue_1, class UFXSystemAsset* K2Node_Select_Default, class UFXSystemAsset* K2Node_Select_Default_1);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Prj_Ranged_Rocket_Athena_C">();
	}
	static class AB_Prj_Ranged_Rocket_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Prj_Ranged_Rocket_Athena_C>();
	}
};
static_assert(alignof(AB_Prj_Ranged_Rocket_Athena_C) == 0x000008, "Wrong alinment on AB_Prj_Ranged_Rocket_Athena_C");
static_assert(sizeof(AB_Prj_Ranged_Rocket_Athena_C) == 0x000A98, "Wrong size on AB_Prj_Ranged_Rocket_Athena_C");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, UberGraphFrame) == 0x000878, "Member 'AB_Prj_Ranged_Rocket_Athena_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, BP_SurfaceTypeSoundComponent) == 0x000880, "Member 'AB_Prj_Ranged_Rocket_Athena_C::BP_SurfaceTypeSoundComponent' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, Rocket_AudioComponent) == 0x000888, "Member 'AB_Prj_Ranged_Rocket_Athena_C::Rocket_AudioComponent' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, Mesh) == 0x000890, "Member 'AB_Prj_Ranged_Rocket_Athena_C::Mesh' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, CollisionMesh) == 0x000898, "Member 'AB_Prj_Ranged_Rocket_Athena_C::CollisionMesh' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, PP_Explode) == 0x0008A0, "Member 'AB_Prj_Ranged_Rocket_Athena_C::PP_Explode' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, PPFader_PPFade_6840155342A20C80B8C71EB25DE77BD9) == 0x0008A8, "Member 'AB_Prj_Ranged_Rocket_Athena_C::PPFader_PPFade_6840155342A20C80B8C71EB25DE77BD9' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, PPFader__Direction_6840155342A20C80B8C71EB25DE77BD9) == 0x0008AC, "Member 'AB_Prj_Ranged_Rocket_Athena_C::PPFader__Direction_6840155342A20C80B8C71EB25DE77BD9' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, PPFader) == 0x0008B0, "Member 'AB_Prj_Ranged_Rocket_Athena_C::PPFader' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, Ribbon_Trail_PSC) == 0x0008B8, "Member 'AB_Prj_Ranged_Rocket_Athena_C::Ribbon_Trail_PSC' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, Water_Explosion_PSC) == 0x0008C0, "Member 'AB_Prj_Ranged_Rocket_Athena_C::Water_Explosion_PSC' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, Ribbon_Trail_PS) == 0x0008C8, "Member 'AB_Prj_Ranged_Rocket_Athena_C::Ribbon_Trail_PS' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, Water_Explosion_PS) == 0x0008D0, "Member 'AB_Prj_Ranged_Rocket_Athena_C::Water_Explosion_PS' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, Explosion_Generic_PSC) == 0x0008D8, "Member 'AB_Prj_Ranged_Rocket_Athena_C::Explosion_Generic_PSC' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, Rocket_Projectile_Explosion_Sound) == 0x0008E0, "Member 'AB_Prj_Ranged_Rocket_Athena_C::Rocket_Projectile_Explosion_Sound' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, StopLocation) == 0x0008E8, "Member 'AB_Prj_Ranged_Rocket_Athena_C::StopLocation' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, ObjectsToTraceAgainst) == 0x0008F8, "Member 'AB_Prj_Ranged_Rocket_Athena_C::ObjectsToTraceAgainst' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, Explosion_Flesh_Damage_PS) == 0x000908, "Member 'AB_Prj_Ranged_Rocket_Athena_C::Explosion_Flesh_Damage_PS' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, StopRotZ) == 0x000910, "Member 'AB_Prj_Ranged_Rocket_Athena_C::StopRotZ' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, TrailLifetime) == 0x00091C, "Member 'AB_Prj_Ranged_Rocket_Athena_C::TrailLifetime' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, Explosion_Flesh_Damage_PSC) == 0x000920, "Member 'AB_Prj_Ranged_Rocket_Athena_C::Explosion_Flesh_Damage_PSC' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, Rocket_Projectile_Explosion_Water_Sound) == 0x000928, "Member 'AB_Prj_Ranged_Rocket_Athena_C::Rocket_Projectile_Explosion_Water_Sound' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, Rocket_Projectile_InAir_Sound) == 0x000930, "Member 'AB_Prj_Ranged_Rocket_Athena_C::Rocket_Projectile_InAir_Sound' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, RocketTrailPS) == 0x000938, "Member 'AB_Prj_Ranged_Rocket_Athena_C::RocketTrailPS' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, Tick_Delta) == 0x000940, "Member 'AB_Prj_Ranged_Rocket_Athena_C::Tick_Delta' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, RocketSpinRate) == 0x000944, "Member 'AB_Prj_Ranged_Rocket_Athena_C::RocketSpinRate' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, Explosion_Impact_Offset) == 0x000948, "Member 'AB_Prj_Ranged_Rocket_Athena_C::Explosion_Impact_Offset' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, RocketSpin) == 0x00094C, "Member 'AB_Prj_Ranged_Rocket_Athena_C::RocketSpin' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, RocketScale) == 0x000958, "Member 'AB_Prj_Ranged_Rocket_Athena_C::RocketScale' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, TimerMaxReached_) == 0x000964, "Member 'AB_Prj_Ranged_Rocket_Athena_C::TimerMaxReached_' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, Ground_Decal) == 0x000968, "Member 'AB_Prj_Ranged_Rocket_Athena_C::Ground_Decal' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, Ground_Decal_MID) == 0x000970, "Member 'AB_Prj_Ranged_Rocket_Athena_C::Ground_Decal_MID' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, Decal_Size_Max) == 0x000978, "Member 'AB_Prj_Ranged_Rocket_Athena_C::Decal_Size_Max' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, Decal_Size_Min) == 0x00097C, "Member 'AB_Prj_Ranged_Rocket_Athena_C::Decal_Size_Min' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, DecalLocation) == 0x000980, "Member 'AB_Prj_Ranged_Rocket_Athena_C::DecalLocation' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, SurfaceType) == 0x00098C, "Member 'AB_Prj_Ranged_Rocket_Athena_C::SurfaceType' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, Explosion_PS) == 0x000990, "Member 'AB_Prj_Ranged_Rocket_Athena_C::Explosion_PS' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, FeedbackCue) == 0x000998, "Member 'AB_Prj_Ranged_Rocket_Athena_C::FeedbackCue' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, WaterInteractionDelay) == 0x0009A0, "Member 'AB_Prj_Ranged_Rocket_Athena_C::WaterInteractionDelay' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, RocketTrailPS_Niagara) == 0x0009A8, "Member 'AB_Prj_Ranged_Rocket_Athena_C::RocketTrailPS_Niagara' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, Grenade_Explosion_FX_System) == 0x0009B0, "Member 'AB_Prj_Ranged_Rocket_Athena_C::Grenade_Explosion_FX_System' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, Grenade_Explosion_Asset) == 0x0009B8, "Member 'AB_Prj_Ranged_Rocket_Athena_C::Grenade_Explosion_Asset' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, Explosion_Asset) == 0x000A10, "Member 'AB_Prj_Ranged_Rocket_Athena_C::Explosion_Asset' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, Rocket_Trail_Asset) == 0x000A18, "Member 'AB_Prj_Ranged_Rocket_Athena_C::Rocket_Trail_Asset' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, Rocket_Trial_Asset) == 0x000A70, "Member 'AB_Prj_Ranged_Rocket_Athena_C::Rocket_Trial_Asset' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, IsNiagaraEnabled) == 0x000A78, "Member 'AB_Prj_Ranged_Rocket_Athena_C::IsNiagaraEnabled' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, PlayRate) == 0x000A7C, "Member 'AB_Prj_Ranged_Rocket_Athena_C::PlayRate' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, Radius) == 0x000A80, "Member 'AB_Prj_Ranged_Rocket_Athena_C::Radius' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, Strength) == 0x000A84, "Member 'AB_Prj_Ranged_Rocket_Athena_C::Strength' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, Time_Decay) == 0x000A88, "Member 'AB_Prj_Ranged_Rocket_Athena_C::Time_Decay' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, Explosion_Asset_Water) == 0x000A90, "Member 'AB_Prj_Ranged_Rocket_Athena_C::Explosion_Asset_Water' has a wrong offset!");

}

