#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Athena_Grenade_MolotovCocktail_AdditionalProjectile

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Prj_Athena_Grenade_MolotovCocktail_AdditionalProjectile.B_Prj_Athena_Grenade_MolotovCocktail_AdditionalProjectile_C
// 0x0040 (0x08B8 - 0x0878)
class AB_Prj_Athena_Grenade_MolotovCocktail_AdditionalProjectile_C final  : public AFortProjectile_DrunkHoming
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0878(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        FireflyProjectileAudio;                            // 0x0880(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Fire_Trail_Niagara;                                // 0x0888(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Fire_Plane_Spawn_Offset;                           // 0x0890(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          DoesMeshAngleNeedAdjusted;                         // 0x0894(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EFE[0x3];                                     // 0x0895(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 BGAToSpawn;                                        // 0x0898(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          HasHit;                                            // 0x08A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EFF[0x7];                                     // 0x08A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Sound_Explode;                                     // 0x08A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsHomingToGround;                                  // 0x08B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_B_Prj_Athena_Grenade_MolotovCocktail_AdditionalProjectile(int32 EntryPoint, const struct FRotator& CallFunc_K2_GetActorRotation_ReturnValue, class AActor* CallFunc_GetOwner_ReturnValue, float CallFunc_RandomFloatInRange_ReturnValue, class UPrimitiveComponent* K2Node_Event_MyComp, class AActor* K2Node_Event_Other, class UPrimitiveComponent* K2Node_Event_OtherComp, bool K2Node_Event_bSelfMoved, const struct FVector& K2Node_Event_HitLocation, const struct FVector& K2Node_Event_HitNormal, const struct FVector& K2Node_Event_NormalImpulse, struct FHitResult& K2Node_Event_Hit, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, const struct FTransform& CallFunc_Find_Mesh_Angle_ReturnValue, const struct FVector& CallFunc_RandomUnitVector_ReturnValue, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue, const struct FVector& CallFunc_Add_VectorVector_ReturnValue, float CallFunc_SelectFloat_ReturnValue, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue, const struct FProjectileHomingData& K2Node_MakeStruct_ProjectileHomingData, float CallFunc_RandomFloatInRange_ReturnValue_1, TScriptInterface<class IFortProjectileMovementInterface> CallFunc_SetHomingData_self_CastInput, class AFortWaterBodyActor* K2Node_ComponentBoundEvent_WaterBody, class UFortWaterInteractionComponent* K2Node_ComponentBoundEvent_WaterInteractionComponent, bool K2Node_ComponentBoundEvent_bIsFirstBody, const struct FVector& K2Node_CustomEvent_HitLocationData, class UFXSystemComponent* CallFunc_SpawnFXAtLocation_ReturnValue, class ABuildingGameplayActor* CallFunc_SpawnBuildingGameplayActor_ReturnValue, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, bool CallFunc_IsDedicatedServer_ReturnValue, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, bool CallFunc_IsDedicatedServer_ReturnValue_1, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_1, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue_1);
	void PlayClientFX(const struct FVector& HitLocationData);
	void ReceiveBeginPlay();
	void BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature(class AFortWaterBodyActor* WaterBody, class UFortWaterInteractionComponent* Param_WaterInteractionComponent, bool bIsFirstBody);
	void BeginDrunkenMovement();
	void HasNotLandedFadeOut();
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, const struct FVector& HitLocation, const struct FVector& HitNormal, const struct FVector& NormalImpulse, struct FHitResult& Hit);
	void Landed_In_Water();
	struct FTransform Find_Mesh_Angle(struct FVector& HitLoc, struct FVector& HitNotmal, const struct FVector& CallFunc_MakeVector_ReturnValue, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue, const struct FRotator& CallFunc_MakeRotFromZX_ReturnValue, const struct FTransform& CallFunc_MakeTransform_ReturnValue, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue, const struct FVector& CallFunc_Add_VectorVector_ReturnValue, const struct FTransform& CallFunc_MakeTransform_ReturnValue_1, const struct FTransform& CallFunc_SelectTransform_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Prj_Athena_Grenade_MolotovCocktail_AdditionalProjectile_C">();
	}
	static class AB_Prj_Athena_Grenade_MolotovCocktail_AdditionalProjectile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Prj_Athena_Grenade_MolotovCocktail_AdditionalProjectile_C>();
	}
};
static_assert(alignof(AB_Prj_Athena_Grenade_MolotovCocktail_AdditionalProjectile_C) == 0x000008, "Wrong alinment on AB_Prj_Athena_Grenade_MolotovCocktail_AdditionalProjectile_C");
static_assert(sizeof(AB_Prj_Athena_Grenade_MolotovCocktail_AdditionalProjectile_C) == 0x0008B8, "Wrong size on AB_Prj_Athena_Grenade_MolotovCocktail_AdditionalProjectile_C");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_AdditionalProjectile_C, UberGraphFrame) == 0x000878, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_AdditionalProjectile_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_AdditionalProjectile_C, FireflyProjectileAudio) == 0x000880, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_AdditionalProjectile_C::FireflyProjectileAudio' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_AdditionalProjectile_C, Fire_Trail_Niagara) == 0x000888, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_AdditionalProjectile_C::Fire_Trail_Niagara' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_AdditionalProjectile_C, Fire_Plane_Spawn_Offset) == 0x000890, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_AdditionalProjectile_C::Fire_Plane_Spawn_Offset' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_AdditionalProjectile_C, DoesMeshAngleNeedAdjusted) == 0x000894, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_AdditionalProjectile_C::DoesMeshAngleNeedAdjusted' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_AdditionalProjectile_C, BGAToSpawn) == 0x000898, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_AdditionalProjectile_C::BGAToSpawn' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_AdditionalProjectile_C, HasHit) == 0x0008A0, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_AdditionalProjectile_C::HasHit' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_AdditionalProjectile_C, Sound_Explode) == 0x0008A8, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_AdditionalProjectile_C::Sound_Explode' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_AdditionalProjectile_C, IsHomingToGround) == 0x0008B0, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_AdditionalProjectile_C::IsHomingToGround' has a wrong offset!");

}

