#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Ranged_GrenadeLauncher_Egg_Athena

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function B_Prj_Ranged_GrenadeLauncher_Egg_Athena.B_Prj_Ranged_GrenadeLauncher_Egg_Athena_C.ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Egg_Athena
// 0x0090 (0x0090 - 0x0000)
struct B_Prj_Ranged_GrenadeLauncher_Egg_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Egg_Athena final 
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0004(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(B_Prj_Ranged_GrenadeLauncher_Egg_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Egg_Athena) == 0x000004, "Wrong alinment on B_Prj_Ranged_GrenadeLauncher_Egg_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Egg_Athena");
static_assert(sizeof(B_Prj_Ranged_GrenadeLauncher_Egg_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Egg_Athena) == 0x000090, "Wrong size on B_Prj_Ranged_GrenadeLauncher_Egg_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Egg_Athena");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Egg_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Egg_Athena, EntryPoint) == 0x000000, "Member 'B_Prj_Ranged_GrenadeLauncher_Egg_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Egg_Athena::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Egg_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Egg_Athena, K2Node_Event_Hit) == 0x000004, "Member 'B_Prj_Ranged_GrenadeLauncher_Egg_Athena_C_ExecuteUbergraph_B_Prj_Ranged_GrenadeLauncher_Egg_Athena::K2Node_Event_Hit' has a wrong offset!");

// Function B_Prj_Ranged_GrenadeLauncher_Egg_Athena.B_Prj_Ranged_GrenadeLauncher_Egg_Athena_C.OnStop
// 0x008C (0x008C - 0x0000)
struct B_Prj_Ranged_GrenadeLauncher_Egg_Athena_C_OnStop final 
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(B_Prj_Ranged_GrenadeLauncher_Egg_Athena_C_OnStop) == 0x000004, "Wrong alinment on B_Prj_Ranged_GrenadeLauncher_Egg_Athena_C_OnStop");
static_assert(sizeof(B_Prj_Ranged_GrenadeLauncher_Egg_Athena_C_OnStop) == 0x00008C, "Wrong size on B_Prj_Ranged_GrenadeLauncher_Egg_Athena_C_OnStop");
static_assert(offsetof(B_Prj_Ranged_GrenadeLauncher_Egg_Athena_C_OnStop, Hit) == 0x000000, "Member 'B_Prj_Ranged_GrenadeLauncher_Egg_Athena_C_OnStop::Hit' has a wrong offset!");

}

