#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Athena_Consumable_Thrown

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Prj_Athena_Consumable_Thrown.B_Prj_Athena_Consumable_Thrown_C
// 0x0088 (0x0900 - 0x0878)
class AB_Prj_Athena_Consumable_Thrown_C : public AFortProjectileBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0878(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0880(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0888(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               FX_Trail;                                          // 0x0890(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortWorldItemDefinition*               ItemDefinition;                                    // 0x0898(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         Projectile_Max_Lifetime;                           // 0x08A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasExploded_;                                     // 0x08A4(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_485A[0x3];                                     // 0x08A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Impact_location;                                   // 0x08A8(0x000C)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	float                                         FX_Linger_Time;                                    // 0x08B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Lifespan_Timer;                                    // 0x08B8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpawnPositionOffset;                               // 0x08C0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_485B[0x4];                                     // 0x08CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPickup*                            Pickup;                                            // 0x08D0(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        SpawnFX;                                           // 0x08D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        SpawnFX_Water;                                     // 0x08E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SpawnSound;                                        // 0x08E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Splash_Sound_;                                     // 0x08F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WaterSpawnDelay;                                   // 0x08F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_Prj_Athena_Consumable_Thrown(int32 EntryPoint, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, class AFortPlayerController* Temp_object_Variable, struct FHitResult& K2Node_Event_Hit_1, bool CallFunc_BreakHitResult_bBlockingHit, bool CallFunc_BreakHitResult_bInitialOverlap, float CallFunc_BreakHitResult_Time, float CallFunc_BreakHitResult_Distance, const struct FVector& CallFunc_BreakHitResult_Location, const struct FVector& CallFunc_BreakHitResult_ImpactPoint, const struct FVector& CallFunc_BreakHitResult_Normal, const struct FVector& CallFunc_BreakHitResult_ImpactNormal, class UPhysicalMaterial* CallFunc_BreakHitResult_PhysMat, class AActor* CallFunc_BreakHitResult_HitActor, class UPrimitiveComponent* CallFunc_BreakHitResult_HitComponent, class FName CallFunc_BreakHitResult_HitBoneName, int32 CallFunc_BreakHitResult_HitItem, int32 CallFunc_BreakHitResult_ElementIndex, int32 CallFunc_BreakHitResult_FaceIndex, const struct FVector& CallFunc_BreakHitResult_TraceStart, const struct FVector& CallFunc_BreakHitResult_TraceEnd, float CallFunc_RandomFloatInRange_ReturnValue, bool CallFunc_HasAuthority_ReturnValue, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, const struct FVector& CallFunc_GetActorForwardVector_ReturnValue, const struct FVector& CallFunc_Add_VectorVector_ReturnValue, struct FHitResult& K2Node_Event_Hit, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_1, bool CallFunc_BreakHitResult_bBlockingHit_1, bool CallFunc_BreakHitResult_bInitialOverlap_1, float CallFunc_BreakHitResult_Time_1, float CallFunc_BreakHitResult_Distance_1, const struct FVector& CallFunc_BreakHitResult_Location_1, const struct FVector& CallFunc_BreakHitResult_ImpactPoint_1, const struct FVector& CallFunc_BreakHitResult_Normal_1, const struct FVector& CallFunc_BreakHitResult_ImpactNormal_1, class UPhysicalMaterial* CallFunc_BreakHitResult_PhysMat_1, class AActor* CallFunc_BreakHitResult_HitActor_1, class UPrimitiveComponent* CallFunc_BreakHitResult_HitComponent_1, class FName CallFunc_BreakHitResult_HitBoneName_1, int32 CallFunc_BreakHitResult_HitItem_1, int32 CallFunc_BreakHitResult_ElementIndex_1, int32 CallFunc_BreakHitResult_FaceIndex_1, const struct FVector& CallFunc_BreakHitResult_TraceStart_1, const struct FVector& CallFunc_BreakHitResult_TraceEnd_1, bool CallFunc_BreakHitResult_bBlockingHit_2, bool CallFunc_BreakHitResult_bInitialOverlap_2, float CallFunc_BreakHitResult_Time_2, float CallFunc_BreakHitResult_Distance_2, const struct FVector& CallFunc_BreakHitResult_Location_2, const struct FVector& CallFunc_BreakHitResult_ImpactPoint_2, const struct FVector& CallFunc_BreakHitResult_Normal_2, const struct FVector& CallFunc_BreakHitResult_ImpactNormal_2, class UPhysicalMaterial* CallFunc_BreakHitResult_PhysMat_2, class AActor* CallFunc_BreakHitResult_HitActor_2, class UPrimitiveComponent* CallFunc_BreakHitResult_HitComponent_2, class FName CallFunc_BreakHitResult_HitBoneName_2, int32 CallFunc_BreakHitResult_HitItem_2, int32 CallFunc_BreakHitResult_ElementIndex_2, int32 CallFunc_BreakHitResult_FaceIndex_2, const struct FVector& CallFunc_BreakHitResult_TraceStart_2, const struct FVector& CallFunc_BreakHitResult_TraceEnd_2, TArray<class AActor*>& K2Node_Event_HitActors, TArray<struct FHitResult>& K2Node_Event_HitResults, const struct FRotator& CallFunc_Conv_VectorToRotator_ReturnValue, const struct FRotator& CallFunc_Conv_VectorToRotator_ReturnValue_1, const struct FRotator& CallFunc_Conv_VectorToRotator_ReturnValue_2, class UParticleSystemComponent* CallFunc_SpawnEmitterAtLocation_ReturnValue, bool Temp_bool_Has_Been_Initd_Variable, bool Temp_bool_Has_Been_Initd_Variable_1, bool Temp_bool_Variable, bool Temp_bool_Variable_1, bool CallFunc_Not_PreBool_ReturnValue, const struct FVector& CallFunc_Vector_Up_ReturnValue, float CallFunc_Dot_VectorVector_ReturnValue, bool CallFunc_HasAuthority_ReturnValue_1, float CallFunc_DegAcos_ReturnValue, bool CallFunc_Less_FloatFloat_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_2, bool Temp_bool_IsClosed_Variable, class AActor* CallFunc_GetOwner_ReturnValue, class AActor* K2Node_CustomEvent_NewParam, class AFortPlayerPawnAthena* K2Node_DynamicCast_AsFort_Player_Pawn_Athena, bool K2Node_DynamicCast_bSuccess, class AFortWaterBodyActor* K2Node_ComponentBoundEvent_WaterBody, class UFortWaterInteractionComponent* K2Node_ComponentBoundEvent_WaterInteractionComponent, bool K2Node_ComponentBoundEvent_bIsFirstBody, class AController* CallFunc_GetController_ReturnValue, class AFortPlayerControllerAthena* K2Node_DynamicCast_AsFort_Player_Controller_Athena, bool K2Node_DynamicCast_bSuccess_1, class UAthenaMarkerComponent* CallFunc_GetMarkerComponent_ReturnValue, const struct FMarkerID& CallFunc_MarkActorOnClient_ReturnValue, class UParticleSystemComponent* CallFunc_SpawnEmitterAtLocation_ReturnValue_1, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_3, class UParticleSystemComponent* CallFunc_SpawnEmitterAtLocation_ReturnValue_2, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_4, class AFortPlayerController* CallFunc_GetOwnerPlayerController_ReturnValue, class AGameStateBase* CallFunc_GetGameState_ReturnValue, bool CallFunc_IsDedicatedServer_ReturnValue, class AAthena_GameState_C* K2Node_DynamicCast_AsAthena_Game_State, bool K2Node_DynamicCast_bSuccess_2, bool CallFunc_IsCreativeModePlaylist_ReturnValue, bool Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable, bool CallFunc_BooleanAND_ReturnValue, class AFortPlayerController* K2Node_Select_Default, class AFortPickup* CallFunc_K2_SpawnPickupInWorld_ReturnValue, class AActor* CallFunc_GetOwner_ReturnValue_1, class AFortPlayerPawnAthena* K2Node_DynamicCast_AsFort_Player_Pawn_Athena_1, bool K2Node_DynamicCast_bSuccess_3, class AFortPlayerController* CallFunc_GetFortPlayerControllerFromActor_ReturnValue, bool CallFunc_IsValid_ReturnValue, class UFortQuestManager* CallFunc_GetQuestManager_ReturnValue, TScriptInterface<class IGameplayTagAssetInterface> CallFunc_GetOwnedGameplayTags_self_CastInput, const struct FGameplayTagContainer& CallFunc_GetOwnedGameplayTags_TagContainer, bool Temp_bool_IsClosed_Variable_1, bool CallFunc_SendComplexCustomStatEvent_QuestActive, bool CallFunc_SendComplexCustomStatEvent_QuestCompleted);
	void WaterImpactItemFX();
	void SpawnItem();
	void BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature(class AFortWaterBodyActor* WaterBody, class UFortWaterInteractionComponent* Param_WaterInteractionComponent, bool bIsFirstBody);
	void Mark(class AActor* NewParam);
	void SpawnedItemFx();
	void OnExploded(TArray<class AActor*>& HitActors, TArray<struct FHitResult>& HitResults);
	void OnBounce(struct FHitResult& Hit);
	void OnReachedLockTargetDistanceThreshold();
	void OnHomingPassedTarget();
	void Timeout();
	void OnStop(struct FHitResult& Hit);
	void ReceiveBeginPlay();
	void OnRep_Impact_Location();
	void OnRep_Pickup(bool CallFunc_IsDedicatedServer_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Prj_Athena_Consumable_Thrown_C">();
	}
	static class AB_Prj_Athena_Consumable_Thrown_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Prj_Athena_Consumable_Thrown_C>();
	}
};
static_assert(alignof(AB_Prj_Athena_Consumable_Thrown_C) == 0x000008, "Wrong alinment on AB_Prj_Athena_Consumable_Thrown_C");
static_assert(sizeof(AB_Prj_Athena_Consumable_Thrown_C) == 0x000900, "Wrong size on AB_Prj_Athena_Consumable_Thrown_C");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, UberGraphFrame) == 0x000878, "Member 'AB_Prj_Athena_Consumable_Thrown_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, SkeletalMesh) == 0x000880, "Member 'AB_Prj_Athena_Consumable_Thrown_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, StaticMesh) == 0x000888, "Member 'AB_Prj_Athena_Consumable_Thrown_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, FX_Trail) == 0x000890, "Member 'AB_Prj_Athena_Consumable_Thrown_C::FX_Trail' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, ItemDefinition) == 0x000898, "Member 'AB_Prj_Athena_Consumable_Thrown_C::ItemDefinition' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, Projectile_Max_Lifetime) == 0x0008A0, "Member 'AB_Prj_Athena_Consumable_Thrown_C::Projectile_Max_Lifetime' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, bHasExploded_) == 0x0008A4, "Member 'AB_Prj_Athena_Consumable_Thrown_C::bHasExploded_' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, Impact_location) == 0x0008A8, "Member 'AB_Prj_Athena_Consumable_Thrown_C::Impact_location' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, FX_Linger_Time) == 0x0008B4, "Member 'AB_Prj_Athena_Consumable_Thrown_C::FX_Linger_Time' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, Lifespan_Timer) == 0x0008B8, "Member 'AB_Prj_Athena_Consumable_Thrown_C::Lifespan_Timer' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, SpawnPositionOffset) == 0x0008C0, "Member 'AB_Prj_Athena_Consumable_Thrown_C::SpawnPositionOffset' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, Pickup) == 0x0008D0, "Member 'AB_Prj_Athena_Consumable_Thrown_C::Pickup' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, SpawnFX) == 0x0008D8, "Member 'AB_Prj_Athena_Consumable_Thrown_C::SpawnFX' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, SpawnFX_Water) == 0x0008E0, "Member 'AB_Prj_Athena_Consumable_Thrown_C::SpawnFX_Water' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, SpawnSound) == 0x0008E8, "Member 'AB_Prj_Athena_Consumable_Thrown_C::SpawnSound' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, Splash_Sound_) == 0x0008F0, "Member 'AB_Prj_Athena_Consumable_Thrown_C::Splash_Sound_' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Consumable_Thrown_C, WaterSpawnDelay) == 0x0008F8, "Member 'AB_Prj_Athena_Consumable_Thrown_C::WaterSpawnDelay' has a wrong offset!");

}

