#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Bullet_Cowboy_v1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Prj_Bullet_Cowboy_v1.B_Prj_Bullet_Cowboy_v1_C
// 0x0130 (0x0AD0 - 0x09A0)
class AB_Prj_Bullet_Cowboy_v1_C final  : public AFortProjectileAthena
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x09A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   TracerMesh;                                        // 0x09A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_Sniper_Bullet_Trail;                             // 0x09B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Sniper_Rifle_SurfaceImpactSound;                   // 0x09B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Sniper_Rifle_PlayerImpactSound;                    // 0x09C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DecalSize;                                         // 0x09C8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F23[0x4];                                     // 0x09D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         ProjectileGravityScale;                            // 0x09D8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UParticleSystem*                        WaterImpactFX;                                     // 0x0A00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             WaterHit;                                          // 0x0A08(0x008C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_6F24[0x4];                                     // 0x0A94(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      WaterHitMat;                                       // 0x0A98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WaterDepthTrace;                                   // 0x0AA0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         WaterIndexTrace;                                   // 0x0AA4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TraceImpactLocation;                               // 0x0AA8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TraceImpactNormal;                                 // 0x0AB4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Sniper_Rifle_WaterImpactSound;                     // 0x0AC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasPlayedWaterSound;                              // 0x0AC8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_B_Prj_Bullet_Cowboy_v1(int32 EntryPoint, class APawn* CallFunc_GetInstigator_ReturnValue, bool CallFunc_IsLocallyControlled_ReturnValue, bool CallFunc_IsDedicatedServer_ReturnValue, bool CallFunc_IsMobilePlatform_ReturnValue, struct FHitResult& K2Node_Event_Hit, bool CallFunc_BreakHitResult_bBlockingHit, bool CallFunc_BreakHitResult_bInitialOverlap, float CallFunc_BreakHitResult_Time, float CallFunc_BreakHitResult_Distance, const struct FVector& CallFunc_BreakHitResult_Location, const struct FVector& CallFunc_BreakHitResult_ImpactPoint, const struct FVector& CallFunc_BreakHitResult_Normal, const struct FVector& CallFunc_BreakHitResult_ImpactNormal, class UPhysicalMaterial* CallFunc_BreakHitResult_PhysMat, class AActor* CallFunc_BreakHitResult_HitActor, class UPrimitiveComponent* CallFunc_BreakHitResult_HitComponent, class FName CallFunc_BreakHitResult_HitBoneName, int32 CallFunc_BreakHitResult_HitItem, int32 CallFunc_BreakHitResult_ElementIndex, int32 CallFunc_BreakHitResult_FaceIndex, const struct FVector& CallFunc_BreakHitResult_TraceStart, const struct FVector& CallFunc_BreakHitResult_TraceEnd, class AFortPawn* K2Node_DynamicCast_AsFort_Pawn, bool K2Node_DynamicCast_bSuccess, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue, const struct FRotator& CallFunc_Conv_VectorToRotator_ReturnValue, bool CallFunc_BooleanOR_ReturnValue, class UDecalComponent* CallFunc_SpawnDecalAtLocation_ReturnValue, bool CallFunc_IsDedicatedServer_ReturnValue_1, class AFortPlayerPawn* K2Node_DynamicCast_AsFort_Player_Pawn, bool K2Node_DynamicCast_bSuccess_1, float CallFunc_GetGameTimeInSeconds_ReturnValue, const struct FVector& CallFunc_GetSocketLocation_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue, class AActor* K2Node_Event_OtherActor, class UPrimitiveComponent* K2Node_Event_OtherComp, struct FHitResult& K2Node_Event_HitResult, bool K2Node_Event_bIsOverlap, struct FHitResult& K2Node_Event_WaterHit, class AFortWaterBodyActor* K2Node_Event_WaterBody, bool CallFunc_BreakHitResult_bBlockingHit_1, bool CallFunc_BreakHitResult_bInitialOverlap_1, float CallFunc_BreakHitResult_Time_1, float CallFunc_BreakHitResult_Distance_1, const struct FVector& CallFunc_BreakHitResult_Location_1, const struct FVector& CallFunc_BreakHitResult_ImpactPoint_1, const struct FVector& CallFunc_BreakHitResult_Normal_1, const struct FVector& CallFunc_BreakHitResult_ImpactNormal_1, class UPhysicalMaterial* CallFunc_BreakHitResult_PhysMat_1, class AActor* CallFunc_BreakHitResult_HitActor_1, class UPrimitiveComponent* CallFunc_BreakHitResult_HitComponent_1, class FName CallFunc_BreakHitResult_HitBoneName_1, int32 CallFunc_BreakHitResult_HitItem_1, int32 CallFunc_BreakHitResult_ElementIndex_1, int32 CallFunc_BreakHitResult_FaceIndex_1, const struct FVector& CallFunc_BreakHitResult_TraceStart_1, const struct FVector& CallFunc_BreakHitResult_TraceEnd_1, const struct FVector& CallFunc_GetLastWaterSurfaceInfo_WaterPlaneLocation, const struct FVector& CallFunc_GetLastWaterSurfaceInfo_WaterPlaneNormal, const struct FVector& CallFunc_GetLastWaterSurfaceInfo_WaterSurfacePosition, float CallFunc_GetLastWaterSurfaceInfo_WaterDepth, int32 CallFunc_GetLastWaterSurfaceInfo_WaterBodyIdx, const struct FVector& CallFunc_GetLastWaterSurfaceInfo_WaterVelocity, bool CallFunc_IsDedicatedServer_ReturnValue_2, float CallFunc_Conv_IntToFloat_ReturnValue, const struct FRotator& CallFunc_Conv_VectorToRotator_ReturnValue_1, bool Temp_bool_Has_Been_Initd_Variable, bool Temp_bool_IsClosed_Variable, bool CallFunc_IsDedicatedServer_ReturnValue_3, bool CallFunc_BreakHitResult_bBlockingHit_2, bool CallFunc_BreakHitResult_bInitialOverlap_2, float CallFunc_BreakHitResult_Time_2, float CallFunc_BreakHitResult_Distance_2, const struct FVector& CallFunc_BreakHitResult_Location_2, const struct FVector& CallFunc_BreakHitResult_ImpactPoint_2, const struct FVector& CallFunc_BreakHitResult_Normal_2, const struct FVector& CallFunc_BreakHitResult_ImpactNormal_2, class UPhysicalMaterial* CallFunc_BreakHitResult_PhysMat_2, class AActor* CallFunc_BreakHitResult_HitActor_2, class UPrimitiveComponent* CallFunc_BreakHitResult_HitComponent_2, class FName CallFunc_BreakHitResult_HitBoneName_2, int32 CallFunc_BreakHitResult_HitItem_2, int32 CallFunc_BreakHitResult_ElementIndex_2, int32 CallFunc_BreakHitResult_FaceIndex_2, const struct FVector& CallFunc_BreakHitResult_TraceStart_2, const struct FVector& CallFunc_BreakHitResult_TraceEnd_2, class UParticleSystemComponent* CallFunc_SpawnEmitterAtLocation_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_EqualEqual_ByteByte_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue, float CallFunc_Conv_IntToFloat_ReturnValue_1, const struct FRotator& CallFunc_MakeRotFromX_ReturnValue, class UParticleSystemComponent* CallFunc_SpawnEmitterAtLocation_ReturnValue_1, const struct FVector& CallFunc_GetWaterSurfaceInfo_WaterPlaneLocation, const struct FVector& CallFunc_GetWaterSurfaceInfo_WaterPlaneNormal, const struct FVector& CallFunc_GetWaterSurfaceInfo_WaterSurfacePosition, float CallFunc_GetWaterSurfaceInfo_WaterDepth, int32 CallFunc_GetWaterSurfaceInfo_WaterBodyIdx, const struct FVector& CallFunc_GetWaterSurfaceInfo_WaterVelocity);
	void OnSniperTraceWaterHit(struct FHitResult& Param_WaterHit, class AFortWaterBodyActor* WaterBody);
	void OnTouched(class AActor* OtherActor, class UPrimitiveComponent* OtherComp, struct FHitResult& HitResult, bool bIsOverlap);
	void ReceiveBeginPlay();
	void OnStop(struct FHitResult& Hit);
	void UserConstructionScript(float CallFunc_GetValueAtLevel_ReturnValue);
	void PlayImpactSFX(bool IsPlayer, bool IsWater, bool Temp_bool_Variable, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, class USoundBase* K2Node_Select_Default);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Prj_Bullet_Cowboy_v1_C">();
	}
	static class AB_Prj_Bullet_Cowboy_v1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Prj_Bullet_Cowboy_v1_C>();
	}
};
static_assert(alignof(AB_Prj_Bullet_Cowboy_v1_C) == 0x000008, "Wrong alinment on AB_Prj_Bullet_Cowboy_v1_C");
static_assert(sizeof(AB_Prj_Bullet_Cowboy_v1_C) == 0x000AD0, "Wrong size on AB_Prj_Bullet_Cowboy_v1_C");
static_assert(offsetof(AB_Prj_Bullet_Cowboy_v1_C, UberGraphFrame) == 0x0009A0, "Member 'AB_Prj_Bullet_Cowboy_v1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Prj_Bullet_Cowboy_v1_C, TracerMesh) == 0x0009A8, "Member 'AB_Prj_Bullet_Cowboy_v1_C::TracerMesh' has a wrong offset!");
static_assert(offsetof(AB_Prj_Bullet_Cowboy_v1_C, P_Sniper_Bullet_Trail) == 0x0009B0, "Member 'AB_Prj_Bullet_Cowboy_v1_C::P_Sniper_Bullet_Trail' has a wrong offset!");
static_assert(offsetof(AB_Prj_Bullet_Cowboy_v1_C, Sniper_Rifle_SurfaceImpactSound) == 0x0009B8, "Member 'AB_Prj_Bullet_Cowboy_v1_C::Sniper_Rifle_SurfaceImpactSound' has a wrong offset!");
static_assert(offsetof(AB_Prj_Bullet_Cowboy_v1_C, Sniper_Rifle_PlayerImpactSound) == 0x0009C0, "Member 'AB_Prj_Bullet_Cowboy_v1_C::Sniper_Rifle_PlayerImpactSound' has a wrong offset!");
static_assert(offsetof(AB_Prj_Bullet_Cowboy_v1_C, DecalSize) == 0x0009C8, "Member 'AB_Prj_Bullet_Cowboy_v1_C::DecalSize' has a wrong offset!");
static_assert(offsetof(AB_Prj_Bullet_Cowboy_v1_C, ProjectileGravityScale) == 0x0009D8, "Member 'AB_Prj_Bullet_Cowboy_v1_C::ProjectileGravityScale' has a wrong offset!");
static_assert(offsetof(AB_Prj_Bullet_Cowboy_v1_C, WaterImpactFX) == 0x000A00, "Member 'AB_Prj_Bullet_Cowboy_v1_C::WaterImpactFX' has a wrong offset!");
static_assert(offsetof(AB_Prj_Bullet_Cowboy_v1_C, WaterHit) == 0x000A08, "Member 'AB_Prj_Bullet_Cowboy_v1_C::WaterHit' has a wrong offset!");
static_assert(offsetof(AB_Prj_Bullet_Cowboy_v1_C, WaterHitMat) == 0x000A98, "Member 'AB_Prj_Bullet_Cowboy_v1_C::WaterHitMat' has a wrong offset!");
static_assert(offsetof(AB_Prj_Bullet_Cowboy_v1_C, WaterDepthTrace) == 0x000AA0, "Member 'AB_Prj_Bullet_Cowboy_v1_C::WaterDepthTrace' has a wrong offset!");
static_assert(offsetof(AB_Prj_Bullet_Cowboy_v1_C, WaterIndexTrace) == 0x000AA4, "Member 'AB_Prj_Bullet_Cowboy_v1_C::WaterIndexTrace' has a wrong offset!");
static_assert(offsetof(AB_Prj_Bullet_Cowboy_v1_C, TraceImpactLocation) == 0x000AA8, "Member 'AB_Prj_Bullet_Cowboy_v1_C::TraceImpactLocation' has a wrong offset!");
static_assert(offsetof(AB_Prj_Bullet_Cowboy_v1_C, TraceImpactNormal) == 0x000AB4, "Member 'AB_Prj_Bullet_Cowboy_v1_C::TraceImpactNormal' has a wrong offset!");
static_assert(offsetof(AB_Prj_Bullet_Cowboy_v1_C, Sniper_Rifle_WaterImpactSound) == 0x000AC0, "Member 'AB_Prj_Bullet_Cowboy_v1_C::Sniper_Rifle_WaterImpactSound' has a wrong offset!");
static_assert(offsetof(AB_Prj_Bullet_Cowboy_v1_C, bHasPlayedWaterSound) == 0x000AC8, "Member 'AB_Prj_Bullet_Cowboy_v1_C::bHasPlayedWaterSound' has a wrong offset!");

}

