#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "B_Rifle_Generic_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena.B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C
// 0x0020 (0x12E8 - 0x12C8)
class AB_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C final  : public AB_Rifle_Generic_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C; // 0x12C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         ScalePlayerThermal_NewTrack_0_253E51B74F624080BF58BDA99C8B5B64; // 0x12D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ScalePlayerThermal__Direction_253E51B74F624080BF58BDA99C8B5B64; // 0x12D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_747A[0x3];                                     // 0x12D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     ScalePlayerThermal;                                // 0x12D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BlendInTime;                                       // 0x12E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena(int32 EntryPoint, bool CallFunc_IsDedicatedServer_ReturnValue, bool K2Node_Event_bNewIsTargeting, class APawn* CallFunc_GetInstigator_ReturnValue, bool Temp_bool_IsClosed_Variable, class AFortPawn* K2Node_DynamicCast_AsFort_Pawn, bool K2Node_DynamicCast_bSuccess, class APlayerController* CallFunc_GetLocalViewingPlayerController_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool Temp_bool_Has_Been_Initd_Variable, class APawn* CallFunc_GetInstigator_ReturnValue_1, bool CallFunc_GetIsTargeting_ReturnValue, class AFortPawn* K2Node_DynamicCast_AsFort_Pawn_1, bool K2Node_DynamicCast_bSuccess_1, class APlayerController* CallFunc_GetLocalViewingPlayerController_ReturnValue_1, bool CallFunc_GetIsTargeting_ReturnValue_1, class AFortPlayerControllerAthena* K2Node_DynamicCast_AsFort_Player_Controller_Athena, bool K2Node_DynamicCast_bSuccess_2, float CallFunc_Divide_FloatFloat_ReturnValue);
	void ForceScopeBackImmediatly();
	void ReverseScopePP();
	void PlayScopePP();
	void OnSetTargeting(bool bNewIsTargeting);
	void ScalePlayerThermal__UpdateFunc();
	void ScalePlayerThermal__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C">();
	}
	static class AB_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C>();
	}
};
static_assert(alignof(AB_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C) == 0x000008, "Wrong alinment on AB_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C");
static_assert(sizeof(AB_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C) == 0x0012E8, "Wrong size on AB_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C");
static_assert(offsetof(AB_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C, UberGraphFrame_B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C) == 0x0012C8, "Member 'AB_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C::UberGraphFrame_B_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C' has a wrong offset!");
static_assert(offsetof(AB_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C, ScalePlayerThermal_NewTrack_0_253E51B74F624080BF58BDA99C8B5B64) == 0x0012D0, "Member 'AB_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C::ScalePlayerThermal_NewTrack_0_253E51B74F624080BF58BDA99C8B5B64' has a wrong offset!");
static_assert(offsetof(AB_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C, ScalePlayerThermal__Direction_253E51B74F624080BF58BDA99C8B5B64) == 0x0012D4, "Member 'AB_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C::ScalePlayerThermal__Direction_253E51B74F624080BF58BDA99C8B5B64' has a wrong offset!");
static_assert(offsetof(AB_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C, ScalePlayerThermal) == 0x0012D8, "Member 'AB_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C::ScalePlayerThermal' has a wrong offset!");
static_assert(offsetof(AB_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C, BlendInTime) == 0x0012E0, "Member 'AB_Rifle_Sniper_Suppressed_ThermalScope_SpyTech_Athena_C::BlendInTime' has a wrong offset!");

}

