#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Rifle_Sniper_Cosmos

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "B_Rifle_Generic_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Rifle_Sniper_Cosmos.B_Rifle_Sniper_Cosmos_C
// 0x0038 (0x1300 - 0x12C8)
class AB_Rifle_Sniper_Cosmos_C final  : public AB_Rifle_Generic_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_Rifle_Sniper_Cosmos_C;            // 0x12C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      MuzzleLightning;                                   // 0x12D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         ScalePlayerThermal_NewTrack_0_CA52A1664DE22D9CFC966BAE1D8D4135; // 0x12D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ScalePlayerThermal__Direction_CA52A1664DE22D9CFC966BAE1D8D4135; // 0x12DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7CBB[0x3];                                     // 0x12DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     ScalePlayerThermal;                                // 0x12E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BlendInTime;                                       // 0x12E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7CBC[0x4];                                     // 0x12EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             NoAmmoSound;                                       // 0x12F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsScoped;                                          // 0x12F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_B_Rifle_Sniper_Cosmos(int32 EntryPoint, bool CallFunc_IsDedicatedServer_ReturnValue, bool CallFunc_GetIsTargeting_ReturnValue, float CallFunc_Divide_FloatFloat_ReturnValue, bool K2Node_Event_bNewIsTargeting, class APawn* CallFunc_GetInstigator_ReturnValue, class AFortPawn* K2Node_DynamicCast_AsFort_Pawn, bool K2Node_DynamicCast_bSuccess, bool Temp_bool_IsClosed_Variable, class APlayerController* CallFunc_GetLocalViewingPlayerController_ReturnValue, bool CallFunc_IsValid_ReturnValue, class APawn* CallFunc_GetInstigator_ReturnValue_1, bool CallFunc_GetIsTargeting_ReturnValue_1, class AFortPawn* K2Node_DynamicCast_AsFort_Pawn_1, bool K2Node_DynamicCast_bSuccess_1, class APlayerController* CallFunc_GetLocalViewingPlayerController_ReturnValue_1, class AFortPlayerControllerAthena* K2Node_DynamicCast_AsFort_Player_Controller_Athena, bool K2Node_DynamicCast_bSuccess_2, bool Temp_bool_Has_Been_Initd_Variable);
	void StopScopedAudio();
	void StartScopedAudio();
	void OnOutOfAmmoFire();
	void OnSetTargeting(bool bNewIsTargeting);
	void PlayScopePP();
	void ScalePlayerThermal__UpdateFunc();
	void ScalePlayerThermal__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Rifle_Sniper_Cosmos_C">();
	}
	static class AB_Rifle_Sniper_Cosmos_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Rifle_Sniper_Cosmos_C>();
	}
};
static_assert(alignof(AB_Rifle_Sniper_Cosmos_C) == 0x000008, "Wrong alinment on AB_Rifle_Sniper_Cosmos_C");
static_assert(sizeof(AB_Rifle_Sniper_Cosmos_C) == 0x001300, "Wrong size on AB_Rifle_Sniper_Cosmos_C");
static_assert(offsetof(AB_Rifle_Sniper_Cosmos_C, UberGraphFrame_B_Rifle_Sniper_Cosmos_C) == 0x0012C8, "Member 'AB_Rifle_Sniper_Cosmos_C::UberGraphFrame_B_Rifle_Sniper_Cosmos_C' has a wrong offset!");
static_assert(offsetof(AB_Rifle_Sniper_Cosmos_C, MuzzleLightning) == 0x0012D0, "Member 'AB_Rifle_Sniper_Cosmos_C::MuzzleLightning' has a wrong offset!");
static_assert(offsetof(AB_Rifle_Sniper_Cosmos_C, ScalePlayerThermal_NewTrack_0_CA52A1664DE22D9CFC966BAE1D8D4135) == 0x0012D8, "Member 'AB_Rifle_Sniper_Cosmos_C::ScalePlayerThermal_NewTrack_0_CA52A1664DE22D9CFC966BAE1D8D4135' has a wrong offset!");
static_assert(offsetof(AB_Rifle_Sniper_Cosmos_C, ScalePlayerThermal__Direction_CA52A1664DE22D9CFC966BAE1D8D4135) == 0x0012DC, "Member 'AB_Rifle_Sniper_Cosmos_C::ScalePlayerThermal__Direction_CA52A1664DE22D9CFC966BAE1D8D4135' has a wrong offset!");
static_assert(offsetof(AB_Rifle_Sniper_Cosmos_C, ScalePlayerThermal) == 0x0012E0, "Member 'AB_Rifle_Sniper_Cosmos_C::ScalePlayerThermal' has a wrong offset!");
static_assert(offsetof(AB_Rifle_Sniper_Cosmos_C, BlendInTime) == 0x0012E8, "Member 'AB_Rifle_Sniper_Cosmos_C::BlendInTime' has a wrong offset!");
static_assert(offsetof(AB_Rifle_Sniper_Cosmos_C, NoAmmoSound) == 0x0012F0, "Member 'AB_Rifle_Sniper_Cosmos_C::NoAmmoSound' has a wrong offset!");
static_assert(offsetof(AB_Rifle_Sniper_Cosmos_C, IsScoped) == 0x0012F8, "Member 'AB_Rifle_Sniper_Cosmos_C::IsScoped' has a wrong offset!");

}

