#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_RocketLauncher_Generic_Athena_HighTier

#include "Basic.hpp"

#include "B_Ranged_Generic_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_RocketLauncher_Generic_Athena_HighTier.B_RocketLauncher_Generic_Athena_HighTier_C
// 0x0028 (0x12F0 - 0x12C8)
class AB_RocketLauncher_Generic_Athena_HighTier_C final  : public AB_Ranged_Generic_C
{
public:
	uint8                                         Pad_6BB4[0x4];                                     // 0x12C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_B_RocketLauncher_Generic_Athena_HighTier_C; // 0x12C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UArrowComponent*                        RearMuzzleLoc;                                     // 0x12D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFXSystemAsset*                         RearMuzzleFXSystem;                                // 0x12D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	struct FVector                                RearMuzzleOffsetMultiplier;                        // 0x12E0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_RocketLauncher_Generic_Athena_HighTier(int32 EntryPoint, bool K2Node_Event_Persistent_Fire, class UNiagaraSystem* K2Node_DynamicCast_AsNiagara_System, bool K2Node_DynamicCast_bSuccess, class UFXSystemComponent* CallFunc_SpawnFXSystemAttached_ReturnValue, const struct FHitResult& CallFunc_K2_AddLocalOffset_SweepHitResult);
	void Muzzle_Flash_FX(bool Persistent_Fire);
	void UserConstructionScript(bool Temp_bool_Variable, class UFXSystemAsset* Temp_object_Variable, class UFXSystemAsset* Temp_object_Variable_1, bool CallFunc_IsNiagaraFXTypeEnabled_ReturnValue, class UFXSystemAsset* K2Node_Select_Default);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_RocketLauncher_Generic_Athena_HighTier_C">();
	}
	static class AB_RocketLauncher_Generic_Athena_HighTier_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_RocketLauncher_Generic_Athena_HighTier_C>();
	}
};
static_assert(alignof(AB_RocketLauncher_Generic_Athena_HighTier_C) == 0x000008, "Wrong alinment on AB_RocketLauncher_Generic_Athena_HighTier_C");
static_assert(sizeof(AB_RocketLauncher_Generic_Athena_HighTier_C) == 0x0012F0, "Wrong size on AB_RocketLauncher_Generic_Athena_HighTier_C");
static_assert(offsetof(AB_RocketLauncher_Generic_Athena_HighTier_C, UberGraphFrame_B_RocketLauncher_Generic_Athena_HighTier_C) == 0x0012C8, "Member 'AB_RocketLauncher_Generic_Athena_HighTier_C::UberGraphFrame_B_RocketLauncher_Generic_Athena_HighTier_C' has a wrong offset!");
static_assert(offsetof(AB_RocketLauncher_Generic_Athena_HighTier_C, RearMuzzleLoc) == 0x0012D0, "Member 'AB_RocketLauncher_Generic_Athena_HighTier_C::RearMuzzleLoc' has a wrong offset!");
static_assert(offsetof(AB_RocketLauncher_Generic_Athena_HighTier_C, RearMuzzleFXSystem) == 0x0012D8, "Member 'AB_RocketLauncher_Generic_Athena_HighTier_C::RearMuzzleFXSystem' has a wrong offset!");
static_assert(offsetof(AB_RocketLauncher_Generic_Athena_HighTier_C, RearMuzzleOffsetMultiplier) == 0x0012E0, "Member 'AB_RocketLauncher_Generic_Athena_HighTier_C::RearMuzzleOffsetMultiplier' has a wrong offset!");

}

