#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Shotgun_Charge_Athena

#include "Basic.hpp"

#include "B_Shotgun_Generic_classes.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Shotgun_Charge_Athena.B_Shotgun_Charge_Athena_C
// 0x0038 (0x1300 - 0x12C8)
class AB_Shotgun_Charge_Athena_C final  : public AB_Shotgun_Generic_C
{
public:
	uint8                                         Pad_56ED[0x4];                                     // 0x12C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_B_Shotgun_Charge_Athena_C;          // 0x12C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               P_PartialCharged_MF;                               // 0x12D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_FullyCharged_MF;                                 // 0x12D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          MaxChargeForSwap;                                  // 0x12E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_56EE[0x7];                                     // 0x12E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             MaxChargeSwapAudio;                                // 0x12E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AudioVisualizerEnabled;                            // 0x12F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_56EF[0x7];                                     // 0x12F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           AudioVisualizerTimer;                              // 0x12F8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_Shotgun_Charge_Athena(int32 EntryPoint, EFortWeaponChargeStateForFireFX CallFunc_GetWeaponChargeStateForFireFX_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, class UAudioComponent* CallFunc_SpawnSoundAttached_ReturnValue, TArray<EFortTeamAffiliation>& K2Node_MakeArray_Array, uint8 CallFunc_GetActorTeam_ReturnValue, bool K2Node_Event_bPersistentFire, bool K2Node_Event_bSecondaryFire, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue);
	void OnPlayWeaponFireFX(bool bPersistentFire, bool bSecondaryFire);
	void ChargeAudioVisualizer();
	void OnEndCharge();
	void OnReachedMaxCharge();
	void OnStartCharge();
	void K2_OnUnEquip();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Shotgun_Charge_Athena_C">();
	}
	static class AB_Shotgun_Charge_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Shotgun_Charge_Athena_C>();
	}
};
static_assert(alignof(AB_Shotgun_Charge_Athena_C) == 0x000008, "Wrong alinment on AB_Shotgun_Charge_Athena_C");
static_assert(sizeof(AB_Shotgun_Charge_Athena_C) == 0x001300, "Wrong size on AB_Shotgun_Charge_Athena_C");
static_assert(offsetof(AB_Shotgun_Charge_Athena_C, UberGraphFrame_B_Shotgun_Charge_Athena_C) == 0x0012C8, "Member 'AB_Shotgun_Charge_Athena_C::UberGraphFrame_B_Shotgun_Charge_Athena_C' has a wrong offset!");
static_assert(offsetof(AB_Shotgun_Charge_Athena_C, P_PartialCharged_MF) == 0x0012D0, "Member 'AB_Shotgun_Charge_Athena_C::P_PartialCharged_MF' has a wrong offset!");
static_assert(offsetof(AB_Shotgun_Charge_Athena_C, P_FullyCharged_MF) == 0x0012D8, "Member 'AB_Shotgun_Charge_Athena_C::P_FullyCharged_MF' has a wrong offset!");
static_assert(offsetof(AB_Shotgun_Charge_Athena_C, MaxChargeForSwap) == 0x0012E0, "Member 'AB_Shotgun_Charge_Athena_C::MaxChargeForSwap' has a wrong offset!");
static_assert(offsetof(AB_Shotgun_Charge_Athena_C, MaxChargeSwapAudio) == 0x0012E8, "Member 'AB_Shotgun_Charge_Athena_C::MaxChargeSwapAudio' has a wrong offset!");
static_assert(offsetof(AB_Shotgun_Charge_Athena_C, AudioVisualizerEnabled) == 0x0012F0, "Member 'AB_Shotgun_Charge_Athena_C::AudioVisualizerEnabled' has a wrong offset!");
static_assert(offsetof(AB_Shotgun_Charge_Athena_C, AudioVisualizerTimer) == 0x0012F8, "Member 'AB_Shotgun_Charge_Athena_C::AudioVisualizerTimer' has a wrong offset!");

}

