#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_SneakySnowmanV2_Athena

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "B_UtilityItem_Generic_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_SneakySnowmanV2_Athena.B_SneakySnowmanV2_Athena_C
// 0x0050 (0x0D78 - 0x0D28)
class AB_SneakySnowmanV2_Athena_C final  : public AB_UtilityItem_Generic_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0D28(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortWorldItemDefinition*               SnowmanItemDef;                                    // 0x0D30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0D38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         ShouldSnowmanInTurret;                             // 0x0D40(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UFortItem*>                      SnowmanItemInstances;                              // 0x0D68(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_SneakySnowmanV2_Athena(int32 EntryPoint);
	void K2_OnUnEquip();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_SneakySnowmanV2_Athena_C">();
	}
	static class AB_SneakySnowmanV2_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_SneakySnowmanV2_Athena_C>();
	}
};
static_assert(alignof(AB_SneakySnowmanV2_Athena_C) == 0x000008, "Wrong alinment on AB_SneakySnowmanV2_Athena_C");
static_assert(sizeof(AB_SneakySnowmanV2_Athena_C) == 0x000D78, "Wrong size on AB_SneakySnowmanV2_Athena_C");
static_assert(offsetof(AB_SneakySnowmanV2_Athena_C, UberGraphFrame) == 0x000D28, "Member 'AB_SneakySnowmanV2_Athena_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_SneakySnowmanV2_Athena_C, SnowmanItemDef) == 0x000D30, "Member 'AB_SneakySnowmanV2_Athena_C::SnowmanItemDef' has a wrong offset!");
static_assert(offsetof(AB_SneakySnowmanV2_Athena_C, PlayerPawn) == 0x000D38, "Member 'AB_SneakySnowmanV2_Athena_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(AB_SneakySnowmanV2_Athena_C, ShouldSnowmanInTurret) == 0x000D40, "Member 'AB_SneakySnowmanV2_Athena_C::ShouldSnowmanInTurret' has a wrong offset!");
static_assert(offsetof(AB_SneakySnowmanV2_Athena_C, SnowmanItemInstances) == 0x000D68, "Member 'AB_SneakySnowmanV2_Athena_C::SnowmanItemInstances' has a wrong offset!");

}

