#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattlePassVaultWorld

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "VaultWorld_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BattlePassVaultWorld.BattlePassVaultWorld_C
// 0x0070 (0x0340 - 0x02D0)
class ABattlePassVaultWorld_C final  : public AVaultWorld_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BattlePassVaultWorld_C;             // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Floor;                                             // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Floor_Visibility_FloorMask_CE7E338346E82397065B65AA77823F50; // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Floor_Visibility__Direction_CE7E338346E82397065B65AA77823F50; // 0x02E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5ED4[0x3];                                     // 0x02E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     FloorMinusVisibility;                              // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Background_Effects_SetStreaks_50767E4640E86998EC96B7B2D57E5E27; // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Background_Effects__Direction_50767E4640E86998EC96B7B2D57E5E27; // 0x02F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5ED5[0x3];                                     // 0x02F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     BackgroundMinusEffects;                            // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TransitionForward_FX_Transition_Fade_46DACBD74D0A8B2278950785C007984A; // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TransitionForward_Pre_TransitionOffset_46DACBD74D0A8B2278950785C007984A; // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TransitionForward_Forward_46DACBD74D0A8B2278950785C007984A; // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TransitionForward__Direction_46DACBD74D0A8B2278950785C007984A; // 0x030C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5ED6[0x3];                                     // 0x030D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TransitionForward;                                 // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TransitionBackward_fx_Transition_fade_7073CD0840227233D3A64795A5A1B1B8; // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TransitionBackward_Pre_Transition_Offset_7073CD0840227233D3A64795A5A1B1B8; // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TransitionBackward_Backward_7073CD0840227233D3A64795A5A1B1B8; // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TransitionBackward__Direction_7073CD0840227233D3A64795A5A1B1B8; // 0x0324(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5ED7[0x3];                                     // 0x0325(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TransitionBackward;                                // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      FloorMI;                                           // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               FloorMID;                                          // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BattlePassVaultWorld(int32 EntryPoint, bool CallFunc_Not_PreBool_ReturnValue, class UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue, bool K2Node_Event_bPlayForward, bool CallFunc_Not_PreBool_ReturnValue_1, bool CallFunc_Not_PreBool_ReturnValue_2, class UTexture2D* K2Node_Event_LoadedBackgroundTexture, struct FTrackDynamicBackground& K2Node_Event_BackgroundInfo, bool K2Node_Event_bShowFloor, bool K2Node_Event_bShowEffects);
	void OnInitialBackgroundTransition();
	void OnUpdateDisplay(bool bShowFloor, bool bShowEffects);
	void OnSetupBackground(class UTexture2D* LoadedBackgroundTexture, struct FTrackDynamicBackground& BackgroundInfo);
	void OnTransitionBackground(bool bPlayForward);
	void ReceiveBeginPlay();
	void FloorMinusVisibility__UpdateFunc();
	void FloorMinusVisibility__FinishedFunc();
	void BackgroundMinusEffects__UpdateFunc();
	void BackgroundMinusEffects__FinishedFunc();
	void TransitionBackward__UpdateFunc();
	void TransitionBackward__FinishedFunc();
	void TransitionForward__UpdateFunc();
	void TransitionForward__FinishedFunc();
	void UserConstructionScript(class AFortStaticMeshActor* K2Node_DynamicCast_AsFort_Static_Mesh_Actor, bool K2Node_DynamicCast_bSuccess);
	void SetupBackgroundMaterial(class UTexture2D*& TextureBackground, struct FTrackDynamicBackground& BackgroundInfo, class UMaterialInstanceDynamic* Mid, class FName Temp_name_Variable, float CallFunc_Conv_BoolToFloat_ReturnValue, float CallFunc_Conv_BoolToFloat_ReturnValue_1, bool CallFunc_IsValid_ReturnValue, class FName Temp_name_Variable_1, bool Temp_bool_Variable, class FName Temp_name_Variable_2, class FName Temp_name_Variable_3, bool Temp_bool_Variable_1, class FName Temp_name_Variable_4, class FName Temp_name_Variable_5, bool Temp_bool_Variable_2, class FName Temp_name_Variable_6, class FName Temp_name_Variable_7, bool Temp_bool_Variable_3, class FName Temp_name_Variable_8, class FName K2Node_Select_Default, class FName K2Node_Select_Default_1, class FName K2Node_Select_Default_2, class FName K2Node_Select_Default_3, class FName Temp_name_Variable_9, bool Temp_bool_Variable_4, class FName Temp_name_Variable_10, class FName K2Node_Select_Default_4, class FName Temp_name_Variable_11, bool Temp_bool_Variable_5, class FName K2Node_Select_Default_5);
	void TransitionBackgroundForward(float Forward, float PreTransitionOffset, float FXTransitionFade, class UMaterialInstanceDynamic* Mid, float CallFunc_Lerp_ReturnValue, float CallFunc_Lerp_ReturnValue_1, float CallFunc_Lerp_ReturnValue_2, float CallFunc_Lerp_ReturnValue_3, float CallFunc_Lerp_ReturnValue_4, float CallFunc_Lerp_ReturnValue_5, float CallFunc_Lerp_ReturnValue_6, float CallFunc_Lerp_ReturnValue_7);
	void TransitionBackgroundBackward(float Backward, float PreTransitionOffset, float FXTransitionFade, class UMaterialInstanceDynamic* Mid, float CallFunc_Lerp_ReturnValue, float CallFunc_Lerp_ReturnValue_1, float CallFunc_Lerp_ReturnValue_2, float CallFunc_Lerp_ReturnValue_3, float CallFunc_Lerp_ReturnValue_4, float CallFunc_Lerp_ReturnValue_5, float CallFunc_Lerp_ReturnValue_6, float CallFunc_Lerp_ReturnValue_7);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BattlePassVaultWorld_C">();
	}
	static class ABattlePassVaultWorld_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABattlePassVaultWorld_C>();
	}
};
static_assert(alignof(ABattlePassVaultWorld_C) == 0x000008, "Wrong alinment on ABattlePassVaultWorld_C");
static_assert(sizeof(ABattlePassVaultWorld_C) == 0x000340, "Wrong size on ABattlePassVaultWorld_C");
static_assert(offsetof(ABattlePassVaultWorld_C, UberGraphFrame_BattlePassVaultWorld_C) == 0x0002D0, "Member 'ABattlePassVaultWorld_C::UberGraphFrame_BattlePassVaultWorld_C' has a wrong offset!");
static_assert(offsetof(ABattlePassVaultWorld_C, Floor) == 0x0002D8, "Member 'ABattlePassVaultWorld_C::Floor' has a wrong offset!");
static_assert(offsetof(ABattlePassVaultWorld_C, Floor_Visibility_FloorMask_CE7E338346E82397065B65AA77823F50) == 0x0002E0, "Member 'ABattlePassVaultWorld_C::Floor_Visibility_FloorMask_CE7E338346E82397065B65AA77823F50' has a wrong offset!");
static_assert(offsetof(ABattlePassVaultWorld_C, Floor_Visibility__Direction_CE7E338346E82397065B65AA77823F50) == 0x0002E4, "Member 'ABattlePassVaultWorld_C::Floor_Visibility__Direction_CE7E338346E82397065B65AA77823F50' has a wrong offset!");
static_assert(offsetof(ABattlePassVaultWorld_C, FloorMinusVisibility) == 0x0002E8, "Member 'ABattlePassVaultWorld_C::FloorMinusVisibility' has a wrong offset!");
static_assert(offsetof(ABattlePassVaultWorld_C, Background_Effects_SetStreaks_50767E4640E86998EC96B7B2D57E5E27) == 0x0002F0, "Member 'ABattlePassVaultWorld_C::Background_Effects_SetStreaks_50767E4640E86998EC96B7B2D57E5E27' has a wrong offset!");
static_assert(offsetof(ABattlePassVaultWorld_C, Background_Effects__Direction_50767E4640E86998EC96B7B2D57E5E27) == 0x0002F4, "Member 'ABattlePassVaultWorld_C::Background_Effects__Direction_50767E4640E86998EC96B7B2D57E5E27' has a wrong offset!");
static_assert(offsetof(ABattlePassVaultWorld_C, BackgroundMinusEffects) == 0x0002F8, "Member 'ABattlePassVaultWorld_C::BackgroundMinusEffects' has a wrong offset!");
static_assert(offsetof(ABattlePassVaultWorld_C, TransitionForward_FX_Transition_Fade_46DACBD74D0A8B2278950785C007984A) == 0x000300, "Member 'ABattlePassVaultWorld_C::TransitionForward_FX_Transition_Fade_46DACBD74D0A8B2278950785C007984A' has a wrong offset!");
static_assert(offsetof(ABattlePassVaultWorld_C, TransitionForward_Pre_TransitionOffset_46DACBD74D0A8B2278950785C007984A) == 0x000304, "Member 'ABattlePassVaultWorld_C::TransitionForward_Pre_TransitionOffset_46DACBD74D0A8B2278950785C007984A' has a wrong offset!");
static_assert(offsetof(ABattlePassVaultWorld_C, TransitionForward_Forward_46DACBD74D0A8B2278950785C007984A) == 0x000308, "Member 'ABattlePassVaultWorld_C::TransitionForward_Forward_46DACBD74D0A8B2278950785C007984A' has a wrong offset!");
static_assert(offsetof(ABattlePassVaultWorld_C, TransitionForward__Direction_46DACBD74D0A8B2278950785C007984A) == 0x00030C, "Member 'ABattlePassVaultWorld_C::TransitionForward__Direction_46DACBD74D0A8B2278950785C007984A' has a wrong offset!");
static_assert(offsetof(ABattlePassVaultWorld_C, TransitionForward) == 0x000310, "Member 'ABattlePassVaultWorld_C::TransitionForward' has a wrong offset!");
static_assert(offsetof(ABattlePassVaultWorld_C, TransitionBackward_fx_Transition_fade_7073CD0840227233D3A64795A5A1B1B8) == 0x000318, "Member 'ABattlePassVaultWorld_C::TransitionBackward_fx_Transition_fade_7073CD0840227233D3A64795A5A1B1B8' has a wrong offset!");
static_assert(offsetof(ABattlePassVaultWorld_C, TransitionBackward_Pre_Transition_Offset_7073CD0840227233D3A64795A5A1B1B8) == 0x00031C, "Member 'ABattlePassVaultWorld_C::TransitionBackward_Pre_Transition_Offset_7073CD0840227233D3A64795A5A1B1B8' has a wrong offset!");
static_assert(offsetof(ABattlePassVaultWorld_C, TransitionBackward_Backward_7073CD0840227233D3A64795A5A1B1B8) == 0x000320, "Member 'ABattlePassVaultWorld_C::TransitionBackward_Backward_7073CD0840227233D3A64795A5A1B1B8' has a wrong offset!");
static_assert(offsetof(ABattlePassVaultWorld_C, TransitionBackward__Direction_7073CD0840227233D3A64795A5A1B1B8) == 0x000324, "Member 'ABattlePassVaultWorld_C::TransitionBackward__Direction_7073CD0840227233D3A64795A5A1B1B8' has a wrong offset!");
static_assert(offsetof(ABattlePassVaultWorld_C, TransitionBackward) == 0x000328, "Member 'ABattlePassVaultWorld_C::TransitionBackward' has a wrong offset!");
static_assert(offsetof(ABattlePassVaultWorld_C, FloorMI) == 0x000330, "Member 'ABattlePassVaultWorld_C::FloorMI' has a wrong offset!");
static_assert(offsetof(ABattlePassVaultWorld_C, FloorMID) == 0x000338, "Member 'ABattlePassVaultWorld_C::FloorMID' has a wrong offset!");

}

