#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_Athena_FlopperSpawn_World

#include "Basic.hpp"

#include "BGA_Athena_FlopperSpawn_Parent_classes.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BGA_Athena_FlopperSpawn_World.BGA_Athena_FlopperSpawn_World_C
// 0x0150 (0x0D48 - 0x0BF8)
class ABGA_Athena_FlopperSpawn_World_C final  : public ABGA_Athena_FlopperSpawn_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BGA_Athena_FlopperSpawn_World_C;    // 0x0BF8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Audio_FlopperLoop;                                 // 0x0C00(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Flopper_Spot;                                   // 0x0C08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Time_Interval;                                     // 0x0C10(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OffsetDistance;                                    // 0x0C14(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TimeIntervalOffset;                                // 0x0C18(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A4F[0x4];                                     // 0x0C1C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         NS_FX_Jump;                                        // 0x0C20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        FX_Jump;                                           // 0x0C28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TraceOffsetAmount;                                 // 0x0C30(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A50[0x4];                                     // 0x0C3C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortWaterBodyActor*                    FortWaterBody;                                     // 0x0C40(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	struct FVector                                WaterPlaneOffset;                                  // 0x0C48(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A51[0x4];                                     // 0x0C54(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Sound_AmbientFishFlop;                             // 0x0C58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ExplosionItemSpawnOffset;                          // 0x0C60(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A52[0x4];                                     // 0x0C6C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  T_FlopperSpawn;                                    // 0x0C70(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         MinDistanceToExplosion;                            // 0x0C90(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A53[0x4];                                     // 0x0C94(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FGameplayTag, class FName>        MAP_TagToLootExplode;                              // 0x0C98(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                   ExplodeItemsToDrop;                                // 0x0CE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ExplodeRolls;                                      // 0x0CF0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                WaterNormalHit;                                    // 0x0CF4(0x000C)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasWrittenAnalytic;                               // 0x0D00(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A54[0x7];                                     // 0x0D01(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  BattleLabProjectileTag;                            // 0x0D08(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  ExplosionSpawnTag;                                 // 0x0D28(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BGA_Athena_FlopperSpawn_World(int32 EntryPoint, float CallFunc_RandomTimeInterval_ReturnValue, bool CallFunc_IsServer_ReturnValue, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, float CallFunc_RandomTimeInterval_ReturnValue_1, float CallFunc_RandomTimeInterval_ReturnValue_2, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, float CallFunc_Add_FloatFloat_ReturnValue, const struct FVector& CallFunc_Add_VectorVector_ReturnValue, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, float CallFunc_RandomFloatInRange_ReturnValue, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_1, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_2, float CallFunc_BreakVector_X, float CallFunc_BreakVector_Y, float CallFunc_BreakVector_Z, int32 Temp_int_Array_Index_Variable, float K2Node_Event_Damage, struct FGameplayTagContainer& K2Node_Event_DamageTags, const struct FVector& K2Node_Event_Momentum, struct FHitResult& K2Node_Event_HitInfo, class AController* K2Node_Event_InstigatedBy, class AActor* K2Node_Event_DamageCauser, const struct FGameplayEffectContextHandle& K2Node_Event_EffectContext, const struct FVector& CallFunc_GetActorForwardVector_ReturnValue, TArray<struct FFortItemEntry>& CallFunc_PickLootDrops_OutLootToDrop, bool CallFunc_PickLootDrops_ReturnValue, const struct FVector& CallFunc_GetActorForwardVector_ReturnValue_1, const struct FVector& CallFunc_RotateAngleAxis_ReturnValue, const struct FFortItemEntry& CallFunc_Array_Get_Item, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, class UFortWorldItemDefinition* K2Node_DynamicCast_AsFort_World_Item_Definition, bool K2Node_DynamicCast_bSuccess, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_3, bool CallFunc_IsServer_ReturnValue_1, const struct FVector& CallFunc_Add_VectorVector_ReturnValue_1, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue_1, const struct FVector& CallFunc_Normal_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_4, const struct FRotator& CallFunc_MakeRotFromX_ReturnValue, class AActor* K2Node_CustomEvent_Instigator, class AActor* K2Node_CustomEvent_DamageCauser, class AFortPlayerController* CallFunc_GetFortPlayerControllerFromActor_ReturnValue, bool CallFunc_IsValid_ReturnValue, class APawn* CallFunc_K2_GetPawn_ReturnValue, class AFortPlayerPawn* K2Node_DynamicCast_AsFort_Player_Pawn, bool K2Node_DynamicCast_bSuccess_1, class UFortQuestManager* CallFunc_GetQuestManager_ReturnValue, const struct FVector& CallFunc_Add_VectorVector_ReturnValue_2, class AFortPickup* CallFunc_K2_SpawnPickupInWorld_ReturnValue, float CallFunc_GetDistanceTo_ReturnValue, struct FFortItemEntry& CallFunc_GetItemEntry_ReturnValue, class UFortWeaponItemDefinition* K2Node_DynamicCast_AsFort_Weapon_Item_Definition, bool K2Node_DynamicCast_bSuccess_2, bool CallFunc_Less_FloatFloat_ReturnValue, float K2Node_Event_Damage_1, struct FGameplayTagContainer& K2Node_Event_DamageTags_1, const struct FVector& K2Node_Event_Momentum_1, struct FHitResult& K2Node_Event_HitInfo_1, class AFortPawn* K2Node_Event_InstigatedBy_1, class AActor* K2Node_Event_DamageCauser_1, const struct FGameplayEffectContextHandle& K2Node_Event_EffectContext_1, int32 Temp_int_Variable, class UNiagaraComponent* CallFunc_SpawnSystemAtLocation_ReturnValue, bool CallFunc_LessEqual_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_5, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_1, const struct FVector& CallFunc_Add_VectorVector_ReturnValue_3, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue_1, TArray<class AActor*>& Temp_object_Variable, const struct FHitResult& CallFunc_BoxTraceSingle_OutHit, bool CallFunc_BoxTraceSingle_ReturnValue, int32 Temp_int_Loop_Counter_Variable, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_1, TArray<class AActor*>& Temp_object_Variable_1, const struct FVector& CallFunc_GetWaterSurfaceInfo_WaterPlaneLocation, const struct FVector& CallFunc_GetWaterSurfaceInfo_WaterPlaneNormal, const struct FVector& CallFunc_GetWaterSurfaceInfo_WaterSurfacePosition, float CallFunc_GetWaterSurfaceInfo_WaterDepth, int32 CallFunc_GetWaterSurfaceInfo_WaterBodyIdx, const struct FVector& CallFunc_GetWaterSurfaceInfo_WaterVelocity, const struct FHitResult& CallFunc_LineTraceSingle_OutHit, bool CallFunc_LineTraceSingle_ReturnValue, float CallFunc_BreakVector_X_1, float CallFunc_BreakVector_Y_1, float CallFunc_BreakVector_Z_1, const struct FVector& CallFunc_MakeVector_ReturnValue, bool CallFunc_BreakHitResult_bBlockingHit, bool CallFunc_BreakHitResult_bInitialOverlap, float CallFunc_BreakHitResult_Time, float CallFunc_BreakHitResult_Distance, const struct FVector& CallFunc_BreakHitResult_Location, const struct FVector& CallFunc_BreakHitResult_ImpactPoint, const struct FVector& CallFunc_BreakHitResult_Normal, const struct FVector& CallFunc_BreakHitResult_ImpactNormal, class UPhysicalMaterial* CallFunc_BreakHitResult_PhysMat, class AActor* CallFunc_BreakHitResult_HitActor, class UPrimitiveComponent* CallFunc_BreakHitResult_HitComponent, class FName CallFunc_BreakHitResult_HitBoneName, int32 CallFunc_BreakHitResult_HitItem, int32 CallFunc_BreakHitResult_ElementIndex, int32 CallFunc_BreakHitResult_FaceIndex, const struct FVector& CallFunc_BreakHitResult_TraceStart, const struct FVector& CallFunc_BreakHitResult_TraceEnd, const struct FHitResult& CallFunc_K2_SetActorLocation_SweepHitResult, bool CallFunc_K2_SetActorLocation_ReturnValue, class AFortWaterBodyActor* K2Node_DynamicCast_AsFort_Water_Body_Actor, bool K2Node_DynamicCast_bSuccess_3, bool CallFunc_SendComplexCustomStatEvent_QuestActive, bool CallFunc_SendComplexCustomStatEvent_QuestCompleted, bool CallFunc_Can_Respawn_ReturnValue, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_2, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue_2);
	void SpawnFromExplosion(class AActor* Param_Instigator, class AActor* DamageCauser);
	void OnDamageServer(float Damage, struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void SpawnJumpingFish();
	void OnDeathPlayEffects(float Damage, struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void ReceiveBeginPlay();
	float RandomTimeInterval(float CallFunc_Add_FloatFloat_ReturnValue, float CallFunc_Subtract_FloatFloat_ReturnValue, float CallFunc_RandomFloatInRange_ReturnValue);
	void OnRep_FortWaterBody(const struct FRotator& CallFunc_MakeRotFromZ_ReturnValue, bool CallFunc_IsServer_ReturnValue, float CallFunc_BreakRotator_Roll, float CallFunc_BreakRotator_Pitch, float CallFunc_BreakRotator_Yaw, const struct FRotator& CallFunc_MakeRotator_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, const struct FVector& CallFunc_GetWaterSurfaceInfo_WaterPlaneLocation, const struct FVector& CallFunc_GetWaterSurfaceInfo_WaterPlaneNormal, const struct FVector& CallFunc_GetWaterSurfaceInfo_WaterSurfacePosition, float CallFunc_GetWaterSurfaceInfo_WaterDepth, int32 CallFunc_GetWaterSurfaceInfo_WaterBodyIdx, const struct FVector& CallFunc_GetWaterSurfaceInfo_WaterVelocity, const struct FVector& CallFunc_Add_VectorVector_ReturnValue, float CallFunc_Conv_IntToFloat_ReturnValue, const struct FTransform& CallFunc_MakeTransform_ReturnValue, const struct FHitResult& CallFunc_K2_SetWorldTransform_SweepHitResult);
	void ExplosionQuestProgress(class AActor* Param_Instigator, class AActor* DamageCauser, const struct FGameplayTagContainer& Temp_struct_Variable, TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface, bool K2Node_DynamicCast_bSuccess, class AActor* CallFunc_GetOwner_ReturnValue, class AFortPlayerController* K2Node_DynamicCast_AsFort_Player_Controller, bool K2Node_DynamicCast_bSuccess_1, class AFortPlayerPawn* CallFunc_GetHeldObjectsOwningPlayer_ReturnValue, TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface_1, bool K2Node_DynamicCast_bSuccess_2, class AFortPlayerController* CallFunc_GetFortPlayerControllerFromActor_ReturnValue, const struct FGameplayTagContainer& CallFunc_GetOwnedGameplayTags_TagContainer, class UFortQuestManager* CallFunc_GetQuestManager_ReturnValue, bool CallFunc_SendComplexCustomStatEvent_QuestActive, bool CallFunc_SendComplexCustomStatEvent_QuestCompleted, bool CallFunc_IsValid_ReturnValue, class AFortPlayerController* CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1, class UFortQuestManager* CallFunc_GetQuestManager_ReturnValue_1, bool CallFunc_SendComplexCustomStatEvent_QuestActive_1, bool CallFunc_SendComplexCustomStatEvent_QuestCompleted_1, bool CallFunc_HasAnyMatchingGameplayTags_ReturnValue, bool Temp_bool_Variable);
	void GetLootTier(bool IsExplosion, bool IsProFishingRod, class FName* Output_Get, class FName CallFunc_GetLootTier_Output_Get);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BGA_Athena_FlopperSpawn_World_C">();
	}
	static class ABGA_Athena_FlopperSpawn_World_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABGA_Athena_FlopperSpawn_World_C>();
	}
};
static_assert(alignof(ABGA_Athena_FlopperSpawn_World_C) == 0x000008, "Wrong alinment on ABGA_Athena_FlopperSpawn_World_C");
static_assert(sizeof(ABGA_Athena_FlopperSpawn_World_C) == 0x000D48, "Wrong size on ABGA_Athena_FlopperSpawn_World_C");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, UberGraphFrame_BGA_Athena_FlopperSpawn_World_C) == 0x000BF8, "Member 'ABGA_Athena_FlopperSpawn_World_C::UberGraphFrame_BGA_Athena_FlopperSpawn_World_C' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, Audio_FlopperLoop) == 0x000C00, "Member 'ABGA_Athena_FlopperSpawn_World_C::Audio_FlopperLoop' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, NS_Flopper_Spot) == 0x000C08, "Member 'ABGA_Athena_FlopperSpawn_World_C::NS_Flopper_Spot' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, Time_Interval) == 0x000C10, "Member 'ABGA_Athena_FlopperSpawn_World_C::Time_Interval' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, OffsetDistance) == 0x000C14, "Member 'ABGA_Athena_FlopperSpawn_World_C::OffsetDistance' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, TimeIntervalOffset) == 0x000C18, "Member 'ABGA_Athena_FlopperSpawn_World_C::TimeIntervalOffset' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, NS_FX_Jump) == 0x000C20, "Member 'ABGA_Athena_FlopperSpawn_World_C::NS_FX_Jump' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, FX_Jump) == 0x000C28, "Member 'ABGA_Athena_FlopperSpawn_World_C::FX_Jump' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, TraceOffsetAmount) == 0x000C30, "Member 'ABGA_Athena_FlopperSpawn_World_C::TraceOffsetAmount' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, FortWaterBody) == 0x000C40, "Member 'ABGA_Athena_FlopperSpawn_World_C::FortWaterBody' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, WaterPlaneOffset) == 0x000C48, "Member 'ABGA_Athena_FlopperSpawn_World_C::WaterPlaneOffset' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, Sound_AmbientFishFlop) == 0x000C58, "Member 'ABGA_Athena_FlopperSpawn_World_C::Sound_AmbientFishFlop' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, ExplosionItemSpawnOffset) == 0x000C60, "Member 'ABGA_Athena_FlopperSpawn_World_C::ExplosionItemSpawnOffset' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, T_FlopperSpawn) == 0x000C70, "Member 'ABGA_Athena_FlopperSpawn_World_C::T_FlopperSpawn' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, MinDistanceToExplosion) == 0x000C90, "Member 'ABGA_Athena_FlopperSpawn_World_C::MinDistanceToExplosion' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, MAP_TagToLootExplode) == 0x000C98, "Member 'ABGA_Athena_FlopperSpawn_World_C::MAP_TagToLootExplode' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, ExplodeItemsToDrop) == 0x000CE8, "Member 'ABGA_Athena_FlopperSpawn_World_C::ExplodeItemsToDrop' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, ExplodeRolls) == 0x000CF0, "Member 'ABGA_Athena_FlopperSpawn_World_C::ExplodeRolls' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, WaterNormalHit) == 0x000CF4, "Member 'ABGA_Athena_FlopperSpawn_World_C::WaterNormalHit' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, bHasWrittenAnalytic) == 0x000D00, "Member 'ABGA_Athena_FlopperSpawn_World_C::bHasWrittenAnalytic' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, BattleLabProjectileTag) == 0x000D08, "Member 'ABGA_Athena_FlopperSpawn_World_C::BattleLabProjectileTag' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_FlopperSpawn_World_C, ExplosionSpawnTag) == 0x000D28, "Member 'ABGA_Athena_FlopperSpawn_World_C::ExplosionSpawnTag' has a wrong offset!");

}

