#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_Athena_Petrol

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Curie_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BGA_Athena_Petrol.BGA_Athena_Petrol_C
// 0x00C0 (0x0930 - 0x0870)
class ABGA_Athena_Petrol_C final  : public ABuildingGameplayActorPetrol
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0870(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0878(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortCurieComponent*                    FortCurie;                                         // 0x0880(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ImpactNormal;                                      // 0x0888(0x000C)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_6E97[0x4];                                     // 0x0894(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class AActor*, struct FCurieInteractHandle> InteractHandleMap;                                 // 0x0898(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                          Lit;                                               // 0x08E8(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	uint8                                         Pad_6E98[0x3];                                     // 0x08E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ActorLifespanAfterIgnition;                        // 0x08EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SelfFireMagnitude;                                 // 0x08F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SelfPropagationFuel;                               // 0x08F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SelfCurieLandscapeIgnitionRadius;                  // 0x08F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IgniteSelf;                                        // 0x08FC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E99[0x3];                                     // 0x08FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         IgniteNearbyMaterialsRadius;                       // 0x0900(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E9A[0x4];                                     // 0x0904(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      IgniteMaterialsObjectTypes;                        // 0x0908(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UClass*                                 IgniteMaterialsClassFilter;                        // 0x0918(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         IgniteNearbyMaterialsFireMagnitude;                // 0x0920(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         IgniteNearbyMaterialsPropogationFuel;              // 0x0924(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         IgniteNearbyMaterialsLandscapeIgnitionRadius;      // 0x0928(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BGA_Athena_Petrol(int32 EntryPoint, bool CallFunc_IsCurieActive_ReturnValue, int32 Temp_int_Array_Index_Variable, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, class UParticleSystemComponent* CallFunc_SpawnEmitterAtLocation_ReturnValue, class UPrimitiveComponent* K2Node_ComponentBoundEvent_OverlappedComponent_1, class AActor* K2Node_ComponentBoundEvent_OtherActor_1, class UPrimitiveComponent* K2Node_ComponentBoundEvent_OtherComp_1, int32 K2Node_ComponentBoundEvent_OtherBodyIndex_1, bool K2Node_ComponentBoundEvent_bFromSweep, struct FHitResult& K2Node_ComponentBoundEvent_SweepResult, struct FHitResult& Temp_struct_Variable, bool CallFunc_HasElementAttached_ReturnValue, bool CallFunc_HasAuthority_ReturnValue, class UPrimitiveComponent* K2Node_ComponentBoundEvent_OverlappedComponent, class AActor* K2Node_ComponentBoundEvent_OtherActor, class UPrimitiveComponent* K2Node_ComponentBoundEvent_OtherComp, int32 K2Node_ComponentBoundEvent_OtherBodyIndex, bool CallFunc_HasElementAttached_ReturnValue_1, bool CallFunc_Map_Remove_ReturnValue, class AActor* K2Node_CustomEvent_OverlappingActor, const struct FHitResult& K2Node_CustomEvent_HitResult, bool CallFunc_Map_Contains_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, TArray<class AActor*>& CallFunc_GetOverlappingActors_OverlappingActors, const struct FCurieInteractHandle& CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_ExecuteEndFireInteract_ReturnValue, int32 Temp_int_Loop_Counter_Variable, class AActor* CallFunc_GetOwner_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, TArray<class AActor*>& CallFunc_Map_Keys_Keys, int32 Temp_int_Array_Index_Variable_1, class AActor* CallFunc_Array_Get_Item, class AActor* CallFunc_Array_Get_Item_1, const struct FCurieInteractHandle& CallFunc_Map_Find_Value_1, bool CallFunc_Map_Find_ReturnValue_1, bool CallFunc_ExecuteEndFireInteract_ReturnValue_1, class ABGA_Athena_Petrol_C* K2Node_DynamicCast_AsBGA_Athena_Petrol, bool K2Node_DynamicCast_bSuccess, class ALandscape* K2Node_DynamicCast_AsLandscape, bool K2Node_DynamicCast_bSuccess_1, const struct FHitResult& CallFunc_MakeHitResult_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_1, class AActor* CallFunc_GetOwner_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue, class AActor* CallFunc_GetOwner_ReturnValue_2, int32 Temp_int_Loop_Counter_Variable_1, const struct FCurieInteractHandle& CallFunc_ExecuteBeginFireInteract_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue_1, bool CallFunc_HasAuthority_ReturnValue_1, struct FCurieContainerHandle& K2Node_Event_CurieContainerHandle_1, struct FGameplayTag& K2Node_Event_ElementTag, struct FCurieInteractParamsHandle& K2Node_Event_InteractParamsHandle, bool CallFunc_EqualEqual_GameplayTag_ReturnValue, struct FCurieContainerHandle& K2Node_Event_CurieContainerHandle, struct FGameplayTag& K2Node_Event_StateTag, bool CallFunc_EqualEqual_GameplayTag_ReturnValue_1);
	void OnCurieStateDetached_BP(struct FCurieContainerHandle& CurieContainerHandle, struct FGameplayTag& StateTag);
	void OnCurieElementInteract_BP(struct FCurieContainerHandle& CurieContainerHandle, struct FGameplayTag& ElementTag, struct FCurieInteractParamsHandle& InteractParamsHandle);
	void ReceiveDestroyed();
	void InteractingWithFire(class AActor* OverlappingActor, const struct FHitResult& HitResult);
	void ReceiveBeginPlay();
	void BndEvt__SphereCollisionComponent_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__SphereCollisionComponent_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult);
	void ClientOnIgnite();
	void UserConstructionScript();
	void OnRep_Lit();
	void Ignite_Self(bool CallFunc_HasAuthority_ReturnValue, class AActor* CallFunc_GetOwner_ReturnValue, struct FHitResult& Temp_struct_Variable);
	void IgniteNearbyMaterials(int32 Temp_int_Array_Index_Variable, struct FHitResult& Temp_struct_Variable, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, class AActor* CallFunc_GetOwner_ReturnValue, int32 Temp_int_Loop_Counter_Variable, TArray<class AActor*>& K2Node_MakeArray_Array, int32 CallFunc_Add_IntInt_ReturnValue, TArray<class AActor*>& CallFunc_SphereOverlapActors_OutActors, bool CallFunc_SphereOverlapActors_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, class AActor* CallFunc_Array_Get_Item, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_IsValid_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BGA_Athena_Petrol_C">();
	}
	static class ABGA_Athena_Petrol_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABGA_Athena_Petrol_C>();
	}
};
static_assert(alignof(ABGA_Athena_Petrol_C) == 0x000008, "Wrong alinment on ABGA_Athena_Petrol_C");
static_assert(sizeof(ABGA_Athena_Petrol_C) == 0x000930, "Wrong size on ABGA_Athena_Petrol_C");
static_assert(offsetof(ABGA_Athena_Petrol_C, UberGraphFrame) == 0x000870, "Member 'ABGA_Athena_Petrol_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_Petrol_C, StaticMesh) == 0x000878, "Member 'ABGA_Athena_Petrol_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_Petrol_C, FortCurie) == 0x000880, "Member 'ABGA_Athena_Petrol_C::FortCurie' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_Petrol_C, ImpactNormal) == 0x000888, "Member 'ABGA_Athena_Petrol_C::ImpactNormal' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_Petrol_C, InteractHandleMap) == 0x000898, "Member 'ABGA_Athena_Petrol_C::InteractHandleMap' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_Petrol_C, Lit) == 0x0008E8, "Member 'ABGA_Athena_Petrol_C::Lit' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_Petrol_C, ActorLifespanAfterIgnition) == 0x0008EC, "Member 'ABGA_Athena_Petrol_C::ActorLifespanAfterIgnition' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_Petrol_C, SelfFireMagnitude) == 0x0008F0, "Member 'ABGA_Athena_Petrol_C::SelfFireMagnitude' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_Petrol_C, SelfPropagationFuel) == 0x0008F4, "Member 'ABGA_Athena_Petrol_C::SelfPropagationFuel' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_Petrol_C, SelfCurieLandscapeIgnitionRadius) == 0x0008F8, "Member 'ABGA_Athena_Petrol_C::SelfCurieLandscapeIgnitionRadius' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_Petrol_C, IgniteSelf) == 0x0008FC, "Member 'ABGA_Athena_Petrol_C::IgniteSelf' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_Petrol_C, IgniteNearbyMaterialsRadius) == 0x000900, "Member 'ABGA_Athena_Petrol_C::IgniteNearbyMaterialsRadius' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_Petrol_C, IgniteMaterialsObjectTypes) == 0x000908, "Member 'ABGA_Athena_Petrol_C::IgniteMaterialsObjectTypes' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_Petrol_C, IgniteMaterialsClassFilter) == 0x000918, "Member 'ABGA_Athena_Petrol_C::IgniteMaterialsClassFilter' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_Petrol_C, IgniteNearbyMaterialsFireMagnitude) == 0x000920, "Member 'ABGA_Athena_Petrol_C::IgniteNearbyMaterialsFireMagnitude' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_Petrol_C, IgniteNearbyMaterialsPropogationFuel) == 0x000924, "Member 'ABGA_Athena_Petrol_C::IgniteNearbyMaterialsPropogationFuel' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_Petrol_C, IgniteNearbyMaterialsLandscapeIgnitionRadius) == 0x000928, "Member 'ABGA_Athena_Petrol_C::IgniteNearbyMaterialsLandscapeIgnitionRadius' has a wrong offset!");

}

