#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bodyguard_Prj_ReviveGrenade

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function Bodyguard_Prj_ReviveGrenade.Bodyguard_Prj_ReviveGrenade_C.ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade
// 0x0270 (0x0270 - 0x0000)
struct Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade final 
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7CD9[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_Event_HitActors;                            // 0x0008(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	TArray<struct FHitResult>                     K2Node_Event_HitResults;                           // 0x0018(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7CDA[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena;      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7CDB[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        CallFunc_GetDBNOHoister_ReturnValue;               // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDBNO_ReturnValue;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7CDC[0x6];                                     // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7CDD[0x3];                                     // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0088(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0115(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7CDE[0x2];                                     // 0x0116(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0120(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x012C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0138(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0144(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0160(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x017C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0188(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7CDF[0x4];                                     // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortWaterBodyActor*                    K2Node_ComponentBoundEvent_WaterBody;              // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWaterInteractionComponent*         K2Node_ComponentBoundEvent_WaterInteractionComponent; // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsFirstBody;           // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7CE0[0x7];                                     // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7CE1[0x6];                                     // 0x01BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_1;              // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnSameTeam_ReturnValue;                   // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue_1;      // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7CE2[0x1];                                     // 0x01CB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x01CC(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7CE3[0x3];                                     // 0x0259(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x025C(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7CE4[0x3];                                     // 0x0269(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade) == 0x000008, "Wrong alinment on Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade");
static_assert(sizeof(Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade) == 0x000270, "Wrong size on Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade, EntryPoint) == 0x000000, "Member 'Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade::EntryPoint' has a wrong offset!");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade, Temp_bool_IsClosed_Variable) == 0x000004, "Member 'Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade, CallFunc_HasAuthority_ReturnValue) == 0x000005, "Member 'Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade, K2Node_Event_HitActors) == 0x000008, "Member 'Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade::K2Node_Event_HitActors' has a wrong offset!");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade, K2Node_Event_HitResults) == 0x000018, "Member 'Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade::K2Node_Event_HitResults' has a wrong offset!");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade, Temp_int_Array_Index_Variable) == 0x000028, "Member 'Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade, CallFunc_Array_Get_Item) == 0x000030, "Member 'Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade, K2Node_DynamicCast_AsFort_Player_Pawn_Athena) == 0x000038, "Member 'Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade::K2Node_DynamicCast_AsFort_Player_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade, CallFunc_Array_Length_ReturnValue) == 0x000044, "Member 'Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000048, "Member 'Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade, CallFunc_GetDBNOHoister_ReturnValue) == 0x000050, "Member 'Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade::CallFunc_GetDBNOHoister_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade, CallFunc_IsDBNO_ReturnValue) == 0x000058, "Member 'Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade::CallFunc_IsDBNO_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade, CallFunc_IsValid_ReturnValue) == 0x000059, "Member 'Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade, CallFunc_GetInstigator_ReturnValue) == 0x000060, "Member 'Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000068, "Member 'Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade, K2Node_ComponentBoundEvent_OtherActor) == 0x000070, "Member 'Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade, K2Node_ComponentBoundEvent_OtherComp) == 0x000078, "Member 'Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000080, "Member 'Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade, K2Node_ComponentBoundEvent_bFromSweep) == 0x000084, "Member 'Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade, K2Node_ComponentBoundEvent_SweepResult) == 0x000088, "Member 'Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade, CallFunc_BreakHitResult_bBlockingHit) == 0x000114, "Member 'Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade, CallFunc_BreakHitResult_bInitialOverlap) == 0x000115, "Member 'Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade, CallFunc_BreakHitResult_Time) == 0x000118, "Member 'Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade, CallFunc_BreakHitResult_Distance) == 0x00011C, "Member 'Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade, CallFunc_BreakHitResult_Location) == 0x000120, "Member 'Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade, CallFunc_BreakHitResult_ImpactPoint) == 0x00012C, "Member 'Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade, CallFunc_BreakHitResult_Normal) == 0x000138, "Member 'Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade, CallFunc_BreakHitResult_ImpactNormal) == 0x000144, "Member 'Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade, CallFunc_BreakHitResult_PhysMat) == 0x000150, "Member 'Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade, CallFunc_BreakHitResult_HitActor) == 0x000158, "Member 'Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade, CallFunc_BreakHitResult_HitComponent) == 0x000160, "Member 'Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade, CallFunc_BreakHitResult_HitBoneName) == 0x000168, "Member 'Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade, CallFunc_BreakHitResult_HitItem) == 0x000170, "Member 'Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade, CallFunc_BreakHitResult_ElementIndex) == 0x000174, "Member 'Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade, CallFunc_BreakHitResult_FaceIndex) == 0x000178, "Member 'Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade, CallFunc_BreakHitResult_TraceStart) == 0x00017C, "Member 'Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade, CallFunc_BreakHitResult_TraceEnd) == 0x000188, "Member 'Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade, K2Node_ComponentBoundEvent_WaterBody) == 0x000198, "Member 'Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade::K2Node_ComponentBoundEvent_WaterBody' has a wrong offset!");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade, K2Node_ComponentBoundEvent_WaterInteractionComponent) == 0x0001A0, "Member 'Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade::K2Node_ComponentBoundEvent_WaterInteractionComponent' has a wrong offset!");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade, K2Node_ComponentBoundEvent_bIsFirstBody) == 0x0001A8, "Member 'Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade::K2Node_ComponentBoundEvent_bIsFirstBody' has a wrong offset!");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x0001B0, "Member 'Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade, K2Node_DynamicCast_bSuccess_1) == 0x0001B8, "Member 'Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x0001B9, "Member 'Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade, CallFunc_GetInstigator_ReturnValue_1) == 0x0001C0, "Member 'Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade::CallFunc_GetInstigator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade, CallFunc_OnSameTeam_ReturnValue) == 0x0001C8, "Member 'Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade::CallFunc_OnSameTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade, CallFunc_NotEqual_ObjectObject_ReturnValue_1) == 0x0001C9, "Member 'Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade::CallFunc_NotEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade, CallFunc_BooleanAND_ReturnValue) == 0x0001CA, "Member 'Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade, K2Node_Event_Hit) == 0x0001CC, "Member 'Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade, Temp_bool_Has_Been_Initd_Variable) == 0x000258, "Member 'Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x00025C, "Member 'Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade, Temp_int_Loop_Counter_Variable) == 0x000264, "Member 'Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade, CallFunc_Less_IntInt_ReturnValue) == 0x000268, "Member 'Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade, CallFunc_Add_IntInt_ReturnValue) == 0x00026C, "Member 'Bodyguard_Prj_ReviveGrenade_C_ExecuteUbergraph_Bodyguard_Prj_ReviveGrenade::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function Bodyguard_Prj_ReviveGrenade.Bodyguard_Prj_ReviveGrenade_C.OnStop
// 0x008C (0x008C - 0x0000)
struct Bodyguard_Prj_ReviveGrenade_C_OnStop final 
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Bodyguard_Prj_ReviveGrenade_C_OnStop) == 0x000004, "Wrong alinment on Bodyguard_Prj_ReviveGrenade_C_OnStop");
static_assert(sizeof(Bodyguard_Prj_ReviveGrenade_C_OnStop) == 0x00008C, "Wrong size on Bodyguard_Prj_ReviveGrenade_C_OnStop");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_OnStop, Hit) == 0x000000, "Member 'Bodyguard_Prj_ReviveGrenade_C_OnStop::Hit' has a wrong offset!");

// Function Bodyguard_Prj_ReviveGrenade.Bodyguard_Prj_ReviveGrenade_C.BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct Bodyguard_Prj_ReviveGrenade_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature final 
{
public:
	class AFortWaterBodyActor*                    WaterBody;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWaterInteractionComponent*         Param_WaterInteractionComponent;                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFirstBody;                                      // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Bodyguard_Prj_ReviveGrenade_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature) == 0x000008, "Wrong alinment on Bodyguard_Prj_ReviveGrenade_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature");
static_assert(sizeof(Bodyguard_Prj_ReviveGrenade_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature) == 0x000018, "Wrong size on Bodyguard_Prj_ReviveGrenade_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature, WaterBody) == 0x000000, "Member 'Bodyguard_Prj_ReviveGrenade_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature::WaterBody' has a wrong offset!");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature, Param_WaterInteractionComponent) == 0x000008, "Member 'Bodyguard_Prj_ReviveGrenade_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature::Param_WaterInteractionComponent' has a wrong offset!");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature, bIsFirstBody) == 0x000010, "Member 'Bodyguard_Prj_ReviveGrenade_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature::bIsFirstBody' has a wrong offset!");

// Function Bodyguard_Prj_ReviveGrenade.Bodyguard_Prj_ReviveGrenade_C.BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature
// 0x00B0 (0x00B0 - 0x0000)
struct Bodyguard_Prj_ReviveGrenade_C_BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature final 
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7CE5[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Bodyguard_Prj_ReviveGrenade_C_BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alinment on Bodyguard_Prj_ReviveGrenade_C_BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Bodyguard_Prj_ReviveGrenade_C_BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000B0, "Wrong size on Bodyguard_Prj_ReviveGrenade_C_BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Bodyguard_Prj_ReviveGrenade_C_BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Bodyguard_Prj_ReviveGrenade_C_BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Bodyguard_Prj_ReviveGrenade_C_BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Bodyguard_Prj_ReviveGrenade_C_BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'Bodyguard_Prj_ReviveGrenade_C_BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'Bodyguard_Prj_ReviveGrenade_C_BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function Bodyguard_Prj_ReviveGrenade.Bodyguard_Prj_ReviveGrenade_C.OnExploded
// 0x0020 (0x0020 - 0x0000)
struct Bodyguard_Prj_ReviveGrenade_C_OnExploded final 
{
public:
	TArray<class AActor*>                         HitActors;                                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	TArray<struct FHitResult>                     HitResults;                                        // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(Bodyguard_Prj_ReviveGrenade_C_OnExploded) == 0x000008, "Wrong alinment on Bodyguard_Prj_ReviveGrenade_C_OnExploded");
static_assert(sizeof(Bodyguard_Prj_ReviveGrenade_C_OnExploded) == 0x000020, "Wrong size on Bodyguard_Prj_ReviveGrenade_C_OnExploded");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_OnExploded, HitActors) == 0x000000, "Member 'Bodyguard_Prj_ReviveGrenade_C_OnExploded::HitActors' has a wrong offset!");
static_assert(offsetof(Bodyguard_Prj_ReviveGrenade_C_OnExploded, HitResults) == 0x000010, "Member 'Bodyguard_Prj_ReviveGrenade_C_OnExploded::HitResults' has a wrong offset!");

}

