#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BodyguardUI

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "BodyguardRuntime_structs.hpp"


namespace SDK
{

// Class BodyguardUI.BodyguardWidgetBase
// 0x0008 (0x0320 - 0x0318)
class UBodyguardWidgetBase : public ULTMWidgetBase
{
public:
	class AFortAthenaMutator_Bodyguard*           CachedBodyguardMutator;                            // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void HandleLocalPlayerEliminatedVIP_BP();
	void HandleOnBodyguardIsTooFarFromBodyguard_BP();
	void HandleOnNotifyVIPTeammateDBNO_BP();
	void HandleOnRevealPlayerRole_BP();
	void HandleOnTeamVIPReassignment_BP(class AFortPlayerStateAthena* NewVIPPlayerState);
	void HandleOnVIPDataChange();
	void HandlePlayerRoleChange_BP(EBodyguardPlayerRole NewPlayerRole);
	void HandleVIPTookDamage_BP();
	void MutatorReady();
	void OnMutatorAvailable(class AFortGameplayMutator* MutatorActor);
	void UpdateEnemyVIPCount_BP(uint8 EnemyVIPCount);

	class AFortAthenaMutator_Bodyguard* GetBodyguardMutator() const;
	EBodyguardPlayerRole GetOwningPlayerRole() const;
	class AFortPlayerState* GetVIPPlayerStateForTeam(uint8 TeamNum) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BodyguardWidgetBase">();
	}
	static class UBodyguardWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBodyguardWidgetBase>();
	}
};
static_assert(alignof(UBodyguardWidgetBase) == 0x000008, "Wrong alinment on UBodyguardWidgetBase");
static_assert(sizeof(UBodyguardWidgetBase) == 0x000320, "Wrong size on UBodyguardWidgetBase");
static_assert(offsetof(UBodyguardWidgetBase, CachedBodyguardMutator) == 0x000318, "Member 'UBodyguardWidgetBase::CachedBodyguardMutator' has a wrong offset!");

// Class BodyguardUI.BodyguardPlayerInfoBase
// 0x0010 (0x0330 - 0x0320)
class UBodyguardPlayerInfoBase final  : public UBodyguardWidgetBase
{
public:
	uint8                                         Pad_463D[0x10];                                    // 0x0320(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleViewingPlayerStateChanged();

	bool IsViewingPlayerVIP() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BodyguardPlayerInfoBase">();
	}
	static class UBodyguardPlayerInfoBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBodyguardPlayerInfoBase>();
	}
};
static_assert(alignof(UBodyguardPlayerInfoBase) == 0x000008, "Wrong alinment on UBodyguardPlayerInfoBase");
static_assert(sizeof(UBodyguardPlayerInfoBase) == 0x000330, "Wrong size on UBodyguardPlayerInfoBase");

// Class BodyguardUI.BodyguardPlayerRoleRevealWidget
// 0x0000 (0x0320 - 0x0320)
class UBodyguardPlayerRoleRevealWidget final  : public UBodyguardWidgetBase
{
public:
	void SetTeamVIPAvatarImage(uint8 TeamNum, class UFortLazyImage* AvatarImageWidget) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BodyguardPlayerRoleRevealWidget">();
	}
	static class UBodyguardPlayerRoleRevealWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBodyguardPlayerRoleRevealWidget>();
	}
};
static_assert(alignof(UBodyguardPlayerRoleRevealWidget) == 0x000008, "Wrong alinment on UBodyguardPlayerRoleRevealWidget");
static_assert(sizeof(UBodyguardPlayerRoleRevealWidget) == 0x000320, "Wrong size on UBodyguardPlayerRoleRevealWidget");

// Class BodyguardUI.BodyguardRumbleHUD
// 0x0000 (0x0320 - 0x0320)
class UBodyguardRumbleHUD final  : public UBodyguardWidgetBase
{
public:
	void UpdatedVIPCount_BP(uint8 EnemyVIPs, uint8 FriendlyVIPs);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BodyguardRumbleHUD">();
	}
	static class UBodyguardRumbleHUD* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBodyguardRumbleHUD>();
	}
};
static_assert(alignof(UBodyguardRumbleHUD) == 0x000008, "Wrong alinment on UBodyguardRumbleHUD");
static_assert(sizeof(UBodyguardRumbleHUD) == 0x000320, "Wrong size on UBodyguardRumbleHUD");

// Class BodyguardUI.BodyguardVIPEliminatedWidget
// 0x0000 (0x0320 - 0x0320)
class UBodyguardVIPEliminatedWidget final  : public UBodyguardWidgetBase
{
public:
	void HandleLocalTeamEliminated_BP();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BodyguardVIPEliminatedWidget">();
	}
	static class UBodyguardVIPEliminatedWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBodyguardVIPEliminatedWidget>();
	}
};
static_assert(alignof(UBodyguardVIPEliminatedWidget) == 0x000008, "Wrong alinment on UBodyguardVIPEliminatedWidget");
static_assert(sizeof(UBodyguardVIPEliminatedWidget) == 0x000320, "Wrong size on UBodyguardVIPEliminatedWidget");

}

