#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP13_StyleChallenge_Mannequin

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP13_StyleChallenge_Mannequin.BP13_StyleChallenge_Mannequin_C
// 0x0030 (0x04F8 - 0x04C8)
class ABP13_StyleChallenge_Mannequin_C final  : public AFortPlayerMannequin
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCustomCharacterPart*                   NewPart;                                           // 0x04D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      ProfPupVFXs;                                       // 0x04D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               RacerZeroBody1VFX;                                 // 0x04E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Racer_Zero_Body2VFX;                               // 0x04E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Racer_Zero_Head_VFX;                               // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP13_StyleChallenge_Mannequin(int32 EntryPoint, const struct FGameplayTag& K2Node_Event_VariantChannel, const struct FGameplayTag& K2Node_Event_OldVariantTag, const struct FGameplayTag& K2Node_Event_NewVariantTag, class UCustomCharacterPart* K2Node_Event_OldPart, class UCustomCharacterPart* K2Node_Event_NewPart, EFortCustomPartType K2Node_Event_PartType, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue, class UFXSystemComponent* CallFunc_SpawnFXSystemAttached_ReturnValue);
	void OnPartChanged(class UCustomCharacterPart* OldPart, class UCustomCharacterPart* Param_NewPart, EFortCustomPartType PartType);
	void OnVariantChanged(const struct FGameplayTag& VariantChannel, const struct FGameplayTag& OldVariantTag, const struct FGameplayTag& NewVariantTag);
	void ProfPupSetup(bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_2, bool CallFunc_IsValid_ReturnValue_3, class USkeletalMeshComponent* CallFunc_GetPartSkeletalMeshComponent_ReturnValue, class UNiagaraComponent* CallFunc_SpawnSystemAttached_ReturnValue, bool CallFunc_EqualEqual_ObjectObject_ReturnValue, class USkeletalMeshComponent* CallFunc_GetPartSkeletalMeshComponent_ReturnValue_1, bool CallFunc_EqualEqual_ObjectObject_ReturnValue_1, class UNiagaraComponent* CallFunc_SpawnSystemAttached_ReturnValue_1, class USkeletalMeshComponent* CallFunc_GetPartSkeletalMeshComponent_ReturnValue_2, class UNiagaraComponent* CallFunc_SpawnSystemAttached_ReturnValue_2, bool CallFunc_EqualEqual_ObjectObject_ReturnValue_2);
	void RacerZeroSetup(bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_EqualEqual_ObjectObject_ReturnValue, bool CallFunc_IsValid_ReturnValue_2, bool CallFunc_EqualEqual_ObjectObject_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue, bool CallFunc_IsValid_ReturnValue_3, bool CallFunc_IsValid_ReturnValue_4, bool CallFunc_IsValid_ReturnValue_5, class USkeletalMeshComponent* CallFunc_GetPartSkeletalMeshComponent_ReturnValue, class UParticleSystemComponent* CallFunc_SpawnEmitterAttached_ReturnValue, class USkeletalMeshComponent* CallFunc_GetPartSkeletalMeshComponent_ReturnValue_1, class UParticleSystemComponent* CallFunc_SpawnEmitterAttached_ReturnValue_1, class USkeletalMeshComponent* CallFunc_GetPartSkeletalMeshComponent_ReturnValue_2, class UParticleSystemComponent* CallFunc_SpawnEmitterAttached_ReturnValue_2, bool CallFunc_EqualEqual_ObjectObject_ReturnValue_2);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP13_StyleChallenge_Mannequin_C">();
	}
	static class ABP13_StyleChallenge_Mannequin_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP13_StyleChallenge_Mannequin_C>();
	}
};
static_assert(alignof(ABP13_StyleChallenge_Mannequin_C) == 0x000008, "Wrong alinment on ABP13_StyleChallenge_Mannequin_C");
static_assert(sizeof(ABP13_StyleChallenge_Mannequin_C) == 0x0004F8, "Wrong size on ABP13_StyleChallenge_Mannequin_C");
static_assert(offsetof(ABP13_StyleChallenge_Mannequin_C, UberGraphFrame) == 0x0004C8, "Member 'ABP13_StyleChallenge_Mannequin_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP13_StyleChallenge_Mannequin_C, NewPart) == 0x0004D0, "Member 'ABP13_StyleChallenge_Mannequin_C::NewPart' has a wrong offset!");
static_assert(offsetof(ABP13_StyleChallenge_Mannequin_C, ProfPupVFXs) == 0x0004D8, "Member 'ABP13_StyleChallenge_Mannequin_C::ProfPupVFXs' has a wrong offset!");
static_assert(offsetof(ABP13_StyleChallenge_Mannequin_C, RacerZeroBody1VFX) == 0x0004E0, "Member 'ABP13_StyleChallenge_Mannequin_C::RacerZeroBody1VFX' has a wrong offset!");
static_assert(offsetof(ABP13_StyleChallenge_Mannequin_C, Racer_Zero_Body2VFX) == 0x0004E8, "Member 'ABP13_StyleChallenge_Mannequin_C::Racer_Zero_Body2VFX' has a wrong offset!");
static_assert(offsetof(ABP13_StyleChallenge_Mannequin_C, Racer_Zero_Head_VFX) == 0x0004F0, "Member 'ABP13_StyleChallenge_Mannequin_C::Racer_Zero_Head_VFX' has a wrong offset!");

}

