#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AISC_Cosmetics_DangerGrape

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function BP_AISC_Cosmetics_DangerGrape.BP_AISC_Cosmetics_DangerGrape_C.GetLoadout
// 0x00F0 (0x00F0 - 0x0000)
struct BP_AISC_Cosmetics_DangerGrape_C_GetLoadout final 
{
public:
	struct FFortAthenaLoadout                     OutLoadout;                                        // 0x0000(0x00F0)(Parm, OutParm)
};
static_assert(alignof(BP_AISC_Cosmetics_DangerGrape_C_GetLoadout) == 0x000008, "Wrong alinment on BP_AISC_Cosmetics_DangerGrape_C_GetLoadout");
static_assert(sizeof(BP_AISC_Cosmetics_DangerGrape_C_GetLoadout) == 0x0000F0, "Wrong size on BP_AISC_Cosmetics_DangerGrape_C_GetLoadout");
static_assert(offsetof(BP_AISC_Cosmetics_DangerGrape_C_GetLoadout, OutLoadout) == 0x000000, "Member 'BP_AISC_Cosmetics_DangerGrape_C_GetLoadout::OutLoadout' has a wrong offset!");

// Function BP_AISC_Cosmetics_DangerGrape.BP_AISC_Cosmetics_DangerGrape_C.GetCustomCharacterParts
// 0x0010 (0x0010 - 0x0000)
struct BP_AISC_Cosmetics_DangerGrape_C_GetCustomCharacterParts final 
{
public:
	TArray<class UCustomCharacterPart*>           OutCustomCharacterParts;                           // 0x0000(0x0010)(Parm, OutParm, HasGetValueTypeHash)
};
static_assert(alignof(BP_AISC_Cosmetics_DangerGrape_C_GetCustomCharacterParts) == 0x000008, "Wrong alinment on BP_AISC_Cosmetics_DangerGrape_C_GetCustomCharacterParts");
static_assert(sizeof(BP_AISC_Cosmetics_DangerGrape_C_GetCustomCharacterParts) == 0x000010, "Wrong size on BP_AISC_Cosmetics_DangerGrape_C_GetCustomCharacterParts");
static_assert(offsetof(BP_AISC_Cosmetics_DangerGrape_C_GetCustomCharacterParts, OutCustomCharacterParts) == 0x000000, "Member 'BP_AISC_Cosmetics_DangerGrape_C_GetCustomCharacterParts::OutCustomCharacterParts' has a wrong offset!");

}

