#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AmbientAudioController

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AmbientAudioController.BP_AmbientAudioController_C
// 0x0090 (0x0170 - 0x00E0)
class UBP_AmbientAudioController_C final  : public UFortAmbientAudioController
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         CheckFrequency;                                    // 0x00E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAboveSnowAltitude;                                // 0x00EC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5677[0x3];                                     // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPOIAmbientAudioBank*               WinterAudioBank;                                   // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSnowAltitudeEnabled;                              // 0x00F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5678[0x7];                                     // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPOIAmbientAudioBank*               StormAudioBank;                                    // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           AmbientAudioInsideTag;                             // 0x0108(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAmbientAudioDataAsset*                 CurieAudioBank;                                    // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SnowOriginWorldLoc;                                // 0x0118(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SnowRadius;                                        // 0x0124(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FGameplayTag>                   SnowTagsToApply;                                   // 0x0128(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class FName                                   SnowEntryName;                                     // 0x0138(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         IndoorInterpTime;                                  // 0x0140(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         IndoorStateChangedTime;                            // 0x0144(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsIndoors;                                        // 0x0148(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5679[0x3];                                     // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         IsPlayerIndoorsInterp;                             // 0x014C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CurrViewTarget;                                    // 0x0150(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FGameplayTag>                   GenericTagsToApply;                                // 0x0158(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          bTagApplicationEnabled;                            // 0x0168(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_AmbientAudioController(int32 EntryPoint, EInteriorAudioState Temp_byte_Variable, TDelegate<void(EInteriorAudioState PreviousState, EInteriorAudioState CurrentState)> K2Node_CreateDelegate_OutputDelegate, bool Temp_bool_Variable, bool Temp_bool_Variable_1, bool Temp_bool_Variable_2, bool Temp_bool_Variable_3, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_1, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, class UFortInteriorAudioSubsystem* CallFunc_GetWorldSubsystem_ReturnValue, bool CallFunc_IsDedicatedServer_ReturnValue, EInteriorAudioState K2Node_CustomEvent_PreviousState, EInteriorAudioState K2Node_CustomEvent_CurrentState, float K2Node_Event_DeltaSeconds, float CallFunc_GetGameTimeInSeconds_ReturnValue, bool K2Node_Select_Default, float CallFunc_GetGameTimeInSeconds_ReturnValue_1, float CallFunc_Subtract_FloatFloat_ReturnValue, float CallFunc_MapRangeClamped_ReturnValue, float CallFunc_SelectFloat_ReturnValue, float CallFunc_SelectFloat_ReturnValue_1, float CallFunc_Lerp_ReturnValue, bool CallFunc_EqualEqual_FloatFloat_ReturnValue);
	void EnableWorldPFXTags();
	void ReceiveTick(float DeltaSeconds);
	void InteriorStateChanged(EInteriorAudioState PreviousState, EInteriorAudioState CurrentState);
	void Update();
	void ReceiveBeginPlay();
	void UpdateSnowSetupBP(bool CallFunc_IsValid_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, float CallFunc_BreakVector_X, float CallFunc_BreakVector_Y, float CallFunc_BreakVector_Z, float CallFunc_BreakVector_X_1, float CallFunc_BreakVector_Y_1, float CallFunc_BreakVector_Z_1, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue, const struct FVector& CallFunc_GetGlobalSnowOrigin_ReturnValue, float CallFunc_BreakVector_X_2, float CallFunc_BreakVector_Y_2, float CallFunc_BreakVector_Z_2, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue_1, float CallFunc_GetGlobalSnowRadius_ReturnValue, float CallFunc_Distance2D_ReturnValue, float CallFunc_GetGlobalSnowAltitude_ReturnValue, bool CallFunc_LessEqual_FloatFloat_ReturnValue, bool CallFunc_GreaterEqual_FloatFloat_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_NotEqual_BoolBool_ReturnValue);
	void ApplyPlayerTags(class AActor* Player, TArray<struct FGameplayTag>& Tag_Array, int32 CallFunc_Array_Length_ReturnValue, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, const struct FGameplayTag& CallFunc_Array_Get_Item, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, const struct FGameplayCueParameters& CallFunc_MakeGameplayCueParameters_ReturnValue);
	void RemovePlayerTags(class AActor* Player, TArray<struct FGameplayTag>& Array, int32 CallFunc_Array_Length_ReturnValue, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, const struct FGameplayTag& CallFunc_Array_Get_Item, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, const struct FGameplayCueParameters& CallFunc_MakeGameplayCueParameters_ReturnValue);
	void CacheViewTarget(class AActor* NewViewTarget, bool CallFunc_NotEqual_ObjectObject_ReturnValue, class AFortPlayerController* CallFunc_GetFirstLocalFortPlayerController_ReturnValue, class AActor* CallFunc_GetViewTarget_ReturnValue);
	void OnViewTargetChanged(class AActor* New_Target, class AActor* Prev_Target);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AmbientAudioController_C">();
	}
	static class UBP_AmbientAudioController_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AmbientAudioController_C>();
	}
};
static_assert(alignof(UBP_AmbientAudioController_C) == 0x000008, "Wrong alinment on UBP_AmbientAudioController_C");
static_assert(sizeof(UBP_AmbientAudioController_C) == 0x000170, "Wrong size on UBP_AmbientAudioController_C");
static_assert(offsetof(UBP_AmbientAudioController_C, UberGraphFrame) == 0x0000E0, "Member 'UBP_AmbientAudioController_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_AmbientAudioController_C, CheckFrequency) == 0x0000E8, "Member 'UBP_AmbientAudioController_C::CheckFrequency' has a wrong offset!");
static_assert(offsetof(UBP_AmbientAudioController_C, bAboveSnowAltitude) == 0x0000EC, "Member 'UBP_AmbientAudioController_C::bAboveSnowAltitude' has a wrong offset!");
static_assert(offsetof(UBP_AmbientAudioController_C, WinterAudioBank) == 0x0000F0, "Member 'UBP_AmbientAudioController_C::WinterAudioBank' has a wrong offset!");
static_assert(offsetof(UBP_AmbientAudioController_C, bSnowAltitudeEnabled) == 0x0000F8, "Member 'UBP_AmbientAudioController_C::bSnowAltitudeEnabled' has a wrong offset!");
static_assert(offsetof(UBP_AmbientAudioController_C, StormAudioBank) == 0x000100, "Member 'UBP_AmbientAudioController_C::StormAudioBank' has a wrong offset!");
static_assert(offsetof(UBP_AmbientAudioController_C, AmbientAudioInsideTag) == 0x000108, "Member 'UBP_AmbientAudioController_C::AmbientAudioInsideTag' has a wrong offset!");
static_assert(offsetof(UBP_AmbientAudioController_C, CurieAudioBank) == 0x000110, "Member 'UBP_AmbientAudioController_C::CurieAudioBank' has a wrong offset!");
static_assert(offsetof(UBP_AmbientAudioController_C, SnowOriginWorldLoc) == 0x000118, "Member 'UBP_AmbientAudioController_C::SnowOriginWorldLoc' has a wrong offset!");
static_assert(offsetof(UBP_AmbientAudioController_C, SnowRadius) == 0x000124, "Member 'UBP_AmbientAudioController_C::SnowRadius' has a wrong offset!");
static_assert(offsetof(UBP_AmbientAudioController_C, SnowTagsToApply) == 0x000128, "Member 'UBP_AmbientAudioController_C::SnowTagsToApply' has a wrong offset!");
static_assert(offsetof(UBP_AmbientAudioController_C, SnowEntryName) == 0x000138, "Member 'UBP_AmbientAudioController_C::SnowEntryName' has a wrong offset!");
static_assert(offsetof(UBP_AmbientAudioController_C, IndoorInterpTime) == 0x000140, "Member 'UBP_AmbientAudioController_C::IndoorInterpTime' has a wrong offset!");
static_assert(offsetof(UBP_AmbientAudioController_C, IndoorStateChangedTime) == 0x000144, "Member 'UBP_AmbientAudioController_C::IndoorStateChangedTime' has a wrong offset!");
static_assert(offsetof(UBP_AmbientAudioController_C, bIsIndoors) == 0x000148, "Member 'UBP_AmbientAudioController_C::bIsIndoors' has a wrong offset!");
static_assert(offsetof(UBP_AmbientAudioController_C, IsPlayerIndoorsInterp) == 0x00014C, "Member 'UBP_AmbientAudioController_C::IsPlayerIndoorsInterp' has a wrong offset!");
static_assert(offsetof(UBP_AmbientAudioController_C, CurrViewTarget) == 0x000150, "Member 'UBP_AmbientAudioController_C::CurrViewTarget' has a wrong offset!");
static_assert(offsetof(UBP_AmbientAudioController_C, GenericTagsToApply) == 0x000158, "Member 'UBP_AmbientAudioController_C::GenericTagsToApply' has a wrong offset!");
static_assert(offsetof(UBP_AmbientAudioController_C, bTagApplicationEnabled) == 0x000168, "Member 'UBP_AmbientAudioController_C::bTagApplicationEnabled' has a wrong offset!");

}

