#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AthenaMapScreenContainer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_AthenaMapScreenContainer.BP_AthenaMapScreenContainer_C
// 0x0038 (0x0488 - 0x0450)
class UBP_AthenaMapScreenContainer_C final  : public UAthenaMapScreenContainer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0450(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       DamageTaken;                                       // 0x0458(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         HBox_Tabs;                                         // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    NextTabAction;                                     // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    PreviousTabAction;                                 // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_TabButtons;                               // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_SwitcherContainer;                         // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void PreConstruct(bool IsDesignTime);
	void BP_OnShowTabsSet(bool bShowTabs);
	void OnDamageReceived();
	void OnShowOrHideCreativeScoreboard(bool bShowCreativeScoreboard);
	void OnCreativeScoreboardWidgetCreated(class UCommonUserWidget* CreativeScoreboardWidget);
	void ExecuteUbergraph_BP_AthenaMapScreenContainer(int32 EntryPoint, class UCommonUserWidget* K2Node_Event_CreativeScoreboardWidget, bool Temp_bool_Variable, TScriptInterface<class IFortHideShowInterface> K2Node_DynamicCast_AsFort_Hide_Show_Interface, bool K2Node_DynamicCast_bSuccess, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, bool Temp_bool_Variable_1, ESlateVisibility Temp_byte_Variable_2, ESlateVisibility Temp_byte_Variable_3, bool K2Node_Event_IsDesignTime, bool K2Node_Event_bShowTabs, ESlateVisibility K2Node_Select_Default, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue, bool K2Node_Event_bShowCreativeScoreboard, ESlateVisibility K2Node_Select_Default_1);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AthenaMapScreenContainer_C">();
	}
	static class UBP_AthenaMapScreenContainer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AthenaMapScreenContainer_C>();
	}
};
static_assert(alignof(UBP_AthenaMapScreenContainer_C) == 0x000008, "Wrong alinment on UBP_AthenaMapScreenContainer_C");
static_assert(sizeof(UBP_AthenaMapScreenContainer_C) == 0x000488, "Wrong size on UBP_AthenaMapScreenContainer_C");
static_assert(offsetof(UBP_AthenaMapScreenContainer_C, UberGraphFrame) == 0x000450, "Member 'UBP_AthenaMapScreenContainer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_AthenaMapScreenContainer_C, DamageTaken) == 0x000458, "Member 'UBP_AthenaMapScreenContainer_C::DamageTaken' has a wrong offset!");
static_assert(offsetof(UBP_AthenaMapScreenContainer_C, HBox_Tabs) == 0x000460, "Member 'UBP_AthenaMapScreenContainer_C::HBox_Tabs' has a wrong offset!");
static_assert(offsetof(UBP_AthenaMapScreenContainer_C, NextTabAction) == 0x000468, "Member 'UBP_AthenaMapScreenContainer_C::NextTabAction' has a wrong offset!");
static_assert(offsetof(UBP_AthenaMapScreenContainer_C, PreviousTabAction) == 0x000470, "Member 'UBP_AthenaMapScreenContainer_C::PreviousTabAction' has a wrong offset!");
static_assert(offsetof(UBP_AthenaMapScreenContainer_C, SafeZone_TabButtons) == 0x000478, "Member 'UBP_AthenaMapScreenContainer_C::SafeZone_TabButtons' has a wrong offset!");
static_assert(offsetof(UBP_AthenaMapScreenContainer_C, SizeBox_SwitcherContainer) == 0x000480, "Member 'UBP_AthenaMapScreenContainer_C::SizeBox_SwitcherContainer' has a wrong offset!");

}

