#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Athena_Environmental_ZipLine_Spline

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Athena_Environmental_ZipLine_Spline.BP_Athena_Environmental_ZipLine_Spline_C.ExecuteUbergraph_BP_Athena_Environmental_ZipLine_Spline
// 0x0028 (0x0028 - 0x0000)
struct BP_Athena_Environmental_ZipLine_Spline_C_ExecuteUbergraph_BP_Athena_Environmental_ZipLine_Spline final 
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue;     // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_60B1[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue_1;   // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Athena_Environmental_ZipLine_Spline_C_ExecuteUbergraph_BP_Athena_Environmental_ZipLine_Spline) == 0x000004, "Wrong alinment on BP_Athena_Environmental_ZipLine_Spline_C_ExecuteUbergraph_BP_Athena_Environmental_ZipLine_Spline");
static_assert(sizeof(BP_Athena_Environmental_ZipLine_Spline_C_ExecuteUbergraph_BP_Athena_Environmental_ZipLine_Spline) == 0x000028, "Wrong size on BP_Athena_Environmental_ZipLine_Spline_C_ExecuteUbergraph_BP_Athena_Environmental_ZipLine_Spline");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_ExecuteUbergraph_BP_Athena_Environmental_ZipLine_Spline, EntryPoint) == 0x000000, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_ExecuteUbergraph_BP_Athena_Environmental_ZipLine_Spline::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_ExecuteUbergraph_BP_Athena_Environmental_ZipLine_Spline, CallFunc_GetLocationAtSplinePoint_ReturnValue) == 0x000004, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_ExecuteUbergraph_BP_Athena_Environmental_ZipLine_Spline::CallFunc_GetLocationAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_ExecuteUbergraph_BP_Athena_Environmental_ZipLine_Spline, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x000010, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_ExecuteUbergraph_BP_Athena_Environmental_ZipLine_Spline::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_ExecuteUbergraph_BP_Athena_Environmental_ZipLine_Spline, CallFunc_Subtract_IntInt_ReturnValue) == 0x000014, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_ExecuteUbergraph_BP_Athena_Environmental_ZipLine_Spline::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_ExecuteUbergraph_BP_Athena_Environmental_ZipLine_Spline, CallFunc_Greater_IntInt_ReturnValue) == 0x000018, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_ExecuteUbergraph_BP_Athena_Environmental_ZipLine_Spline::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_ExecuteUbergraph_BP_Athena_Environmental_ZipLine_Spline, CallFunc_GetLocationAtSplinePoint_ReturnValue_1) == 0x00001C, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_ExecuteUbergraph_BP_Athena_Environmental_ZipLine_Spline::CallFunc_GetLocationAtSplinePoint_ReturnValue_1' has a wrong offset!");

// Function BP_Athena_Environmental_ZipLine_Spline.BP_Athena_Environmental_ZipLine_Spline_C.UserConstructionScript
// 0x00E0 (0x00E0 - 0x0000)
struct BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript final 
{
public:
	bool                                          NewLocalVar_0;                                     // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_60B2[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue_1;    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue_2;    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_60B3[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_60B4[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_1;        // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_60B5[0x3];                                     // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Location; // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Tangent; // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Location_1; // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Tangent_1; // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USplineMeshComponent*                   CallFunc_AddSplineMeshSegment_SplineMeshSegment;   // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_AutoSmoothTanget_SmoothedTangent;         // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_AutoSmoothTanget_SmoothedTangent_1;       // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue_3;    // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_3;            // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript) == 0x000008, "Wrong alinment on BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript");
static_assert(sizeof(BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript) == 0x0000E0, "Wrong size on BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript, NewLocalVar_0) == 0x000000, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript, Temp_int_Variable) == 0x000004, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_1) == 0x00000C, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x000010, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript, CallFunc_Subtract_IntInt_ReturnValue) == 0x000014, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript, CallFunc_GetNumberOfSplinePoints_ReturnValue_1) == 0x000018, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript::CallFunc_GetNumberOfSplinePoints_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x00001C, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript, CallFunc_GetNumberOfSplinePoints_ReturnValue_2) == 0x000020, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript::CallFunc_GetNumberOfSplinePoints_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x000024, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript, CallFunc_BreakVector_X) == 0x000028, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript, CallFunc_BreakVector_Y) == 0x00002C, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript, CallFunc_BreakVector_Z) == 0x000030, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript, CallFunc_BreakVector_X_1) == 0x000034, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript, CallFunc_BreakVector_Y_1) == 0x000038, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript, CallFunc_BreakVector_Z_1) == 0x00003C, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript, CallFunc_Less_FloatFloat_ReturnValue) == 0x000040, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript, Temp_int_Variable_1) == 0x000044, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000048, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript, CallFunc_GetSocketLocation_ReturnValue) == 0x000054, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000060, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000061, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript, CallFunc_BooleanOR_ReturnValue) == 0x000062, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000063, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_2) == 0x000064, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript, CallFunc_K2_GetRootComponent_ReturnValue_1) == 0x000068, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript::CallFunc_K2_GetRootComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript, CallFunc_IsValid_ReturnValue_1) == 0x000070, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript, CallFunc_GetSocketLocation_ReturnValue_1) == 0x000074, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript::CallFunc_GetSocketLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript, CallFunc_GetLocationAndTangentAtSplinePoint_Location) == 0x000080, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript::CallFunc_GetLocationAndTangentAtSplinePoint_Location' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript, CallFunc_GetLocationAndTangentAtSplinePoint_Tangent) == 0x00008C, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript::CallFunc_GetLocationAndTangentAtSplinePoint_Tangent' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript, CallFunc_GetLocationAndTangentAtSplinePoint_Location_1) == 0x000098, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript::CallFunc_GetLocationAndTangentAtSplinePoint_Location_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript, CallFunc_GetLocationAndTangentAtSplinePoint_Tangent_1) == 0x0000A4, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript::CallFunc_GetLocationAndTangentAtSplinePoint_Tangent_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript, CallFunc_AddSplineMeshSegment_SplineMeshSegment) == 0x0000B0, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript::CallFunc_AddSplineMeshSegment_SplineMeshSegment' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript, CallFunc_AutoSmoothTanget_SmoothedTangent) == 0x0000B8, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript::CallFunc_AutoSmoothTanget_SmoothedTangent' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript, CallFunc_AutoSmoothTanget_SmoothedTangent_1) == 0x0000C4, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript::CallFunc_AutoSmoothTanget_SmoothedTangent_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript, CallFunc_GetNumberOfSplinePoints_ReturnValue_3) == 0x0000D0, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript::CallFunc_GetNumberOfSplinePoints_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript, CallFunc_Subtract_IntInt_ReturnValue_3) == 0x0000D4, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript::CallFunc_Subtract_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x0000D8, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_UserConstructionScript::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_Athena_Environmental_ZipLine_Spline.BP_Athena_Environmental_ZipLine_Spline_C.AddSplineMeshSegment
// 0x0050 (0x0050 - 0x0000)
struct BP_Athena_Environmental_ZipLine_Spline_C_AddSplineMeshSegment final 
{
public:
	class USplineMeshComponent*                   SplineMeshSegment;                                 // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60B6[0x8];                                     // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0010(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class USplineMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Athena_Environmental_ZipLine_Spline_C_AddSplineMeshSegment) == 0x000010, "Wrong alinment on BP_Athena_Environmental_ZipLine_Spline_C_AddSplineMeshSegment");
static_assert(sizeof(BP_Athena_Environmental_ZipLine_Spline_C_AddSplineMeshSegment) == 0x000050, "Wrong size on BP_Athena_Environmental_ZipLine_Spline_C_AddSplineMeshSegment");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_AddSplineMeshSegment, SplineMeshSegment) == 0x000000, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_AddSplineMeshSegment::SplineMeshSegment' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_AddSplineMeshSegment, Temp_struct_Variable) == 0x000010, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_AddSplineMeshSegment::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_AddSplineMeshSegment, CallFunc_AddComponent_ReturnValue) == 0x000040, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_AddSplineMeshSegment::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_AddSplineMeshSegment, CallFunc_SetStaticMesh_ReturnValue) == 0x000048, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_AddSplineMeshSegment::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

// Function BP_Athena_Environmental_ZipLine_Spline.BP_Athena_Environmental_ZipLine_Spline_C.AutoSmoothTanget
// 0x0074 (0x0074 - 0x0000)
struct BP_Athena_Environmental_ZipLine_Spline_C_AutoSmoothTanget final 
{
public:
	struct FVector                                Tangent;                                           // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PointA;                                            // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PointB;                                            // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SmoothedTangent;                                   // 0x0024(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_60B7[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default;                             // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Athena_Environmental_ZipLine_Spline_C_AutoSmoothTanget) == 0x000004, "Wrong alinment on BP_Athena_Environmental_ZipLine_Spline_C_AutoSmoothTanget");
static_assert(sizeof(BP_Athena_Environmental_ZipLine_Spline_C_AutoSmoothTanget) == 0x000074, "Wrong size on BP_Athena_Environmental_ZipLine_Spline_C_AutoSmoothTanget");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_AutoSmoothTanget, Tangent) == 0x000000, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_AutoSmoothTanget::Tangent' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_AutoSmoothTanget, PointA) == 0x00000C, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_AutoSmoothTanget::PointA' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_AutoSmoothTanget, PointB) == 0x000018, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_AutoSmoothTanget::PointB' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_AutoSmoothTanget, SmoothedTangent) == 0x000024, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_AutoSmoothTanget::SmoothedTangent' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_AutoSmoothTanget, Temp_bool_Variable) == 0x000030, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_AutoSmoothTanget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_AutoSmoothTanget, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000034, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_AutoSmoothTanget::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_AutoSmoothTanget, CallFunc_Normal_ReturnValue) == 0x000040, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_AutoSmoothTanget::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_AutoSmoothTanget, CallFunc_VSize_ReturnValue) == 0x00004C, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_AutoSmoothTanget::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_AutoSmoothTanget, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000050, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_AutoSmoothTanget::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_AutoSmoothTanget, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x00005C, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_AutoSmoothTanget::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_AutoSmoothTanget, K2Node_Select_Default) == 0x000068, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_AutoSmoothTanget::K2Node_Select_Default' has a wrong offset!");

// Function BP_Athena_Environmental_ZipLine_Spline.BP_Athena_Environmental_ZipLine_Spline_C.CalculatePositionOfPoles
// 0x0068 (0x0068 - 0x0000)
struct BP_Athena_Environmental_ZipLine_Spline_C_CalculatePositionOfPoles final 
{
public:
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Location; // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Tangent; // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Location_1; // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Tangent_1; // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_1;        // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Athena_Environmental_ZipLine_Spline_C_CalculatePositionOfPoles) == 0x000008, "Wrong alinment on BP_Athena_Environmental_ZipLine_Spline_C_CalculatePositionOfPoles");
static_assert(sizeof(BP_Athena_Environmental_ZipLine_Spline_C_CalculatePositionOfPoles) == 0x000068, "Wrong size on BP_Athena_Environmental_ZipLine_Spline_C_CalculatePositionOfPoles");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_CalculatePositionOfPoles, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x000000, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_CalculatePositionOfPoles::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_CalculatePositionOfPoles, CallFunc_Subtract_IntInt_ReturnValue) == 0x000004, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_CalculatePositionOfPoles::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_CalculatePositionOfPoles, CallFunc_GetLocationAndTangentAtSplinePoint_Location) == 0x000008, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_CalculatePositionOfPoles::CallFunc_GetLocationAndTangentAtSplinePoint_Location' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_CalculatePositionOfPoles, CallFunc_GetLocationAndTangentAtSplinePoint_Tangent) == 0x000014, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_CalculatePositionOfPoles::CallFunc_GetLocationAndTangentAtSplinePoint_Tangent' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_CalculatePositionOfPoles, CallFunc_GetLocationAndTangentAtSplinePoint_Location_1) == 0x000020, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_CalculatePositionOfPoles::CallFunc_GetLocationAndTangentAtSplinePoint_Location_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_CalculatePositionOfPoles, CallFunc_GetLocationAndTangentAtSplinePoint_Tangent_1) == 0x00002C, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_CalculatePositionOfPoles::CallFunc_GetLocationAndTangentAtSplinePoint_Tangent_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_CalculatePositionOfPoles, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000038, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_CalculatePositionOfPoles::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_CalculatePositionOfPoles, CallFunc_K2_GetRootComponent_ReturnValue_1) == 0x000040, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_CalculatePositionOfPoles::CallFunc_K2_GetRootComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_CalculatePositionOfPoles, CallFunc_GetSocketLocation_ReturnValue) == 0x000048, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_CalculatePositionOfPoles::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_CalculatePositionOfPoles, CallFunc_GetSocketLocation_ReturnValue_1) == 0x000054, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_CalculatePositionOfPoles::CallFunc_GetSocketLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_CalculatePositionOfPoles, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_CalculatePositionOfPoles::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_CalculatePositionOfPoles, CallFunc_IsValid_ReturnValue_1) == 0x000061, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_CalculatePositionOfPoles::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_Athena_Environmental_ZipLine_Spline.BP_Athena_Environmental_ZipLine_Spline_C.SetSplinePositionAndTangent
// 0x00D0 (0x00D0 - 0x0000)
struct BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent final 
{
public:
	bool                                          SetPosition;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          SetTangent;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_60B8[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ID;                                                // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OneDivNumPoints;                                   // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SplinePointIDToSet;                                // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AlphaForLocation;                                  // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFirstPoint;                                      // 0x0014(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_60B9[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SplinePointID;                                     // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PrevAlpha;                                         // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Alpha;                                             // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Calc_Auto_Location_At_Alpha_PointLocation; // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_60BA[0x3];                                     // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_60BB[0x3];                                     // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_60BC[0x3];                                     // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_60BD[0x3];                                     // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_2;            // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent) == 0x000004, "Wrong alinment on BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent");
static_assert(sizeof(BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent) == 0x0000D0, "Wrong size on BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent, SetPosition) == 0x000000, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent::SetPosition' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent, SetTangent) == 0x000001, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent::SetTangent' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent, ID) == 0x000004, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent::ID' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent, OneDivNumPoints) == 0x000008, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent::OneDivNumPoints' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent, SplinePointIDToSet) == 0x00000C, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent::SplinePointIDToSet' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent, AlphaForLocation) == 0x000010, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent::AlphaForLocation' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent, IsFirstPoint) == 0x000014, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent::IsFirstPoint' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent, SplinePointID) == 0x000018, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent::SplinePointID' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent, PrevAlpha) == 0x00001C, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent::PrevAlpha' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent, Alpha) == 0x000020, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent::Alpha' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent, CallFunc_Calc_Auto_Location_At_Alpha_PointLocation) == 0x000024, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent::CallFunc_Calc_Auto_Location_At_Alpha_PointLocation' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000030, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent, CallFunc_BreakVector_X) == 0x00003C, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent, CallFunc_BreakVector_Y) == 0x000040, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent, CallFunc_BreakVector_Z) == 0x000044, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000048, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent, CallFunc_MakeVector_ReturnValue) == 0x00004C, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000058, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00005C, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000068, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent, CallFunc_MakeVector_ReturnValue_1) == 0x00006C, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000078, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent, CallFunc_VLerp_ReturnValue) == 0x000084, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent, CallFunc_Multiply_VectorFloat_ReturnValue_2) == 0x000090, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent::CallFunc_Multiply_VectorFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00009C, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000A0, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0000A4, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x0000A8, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent, CallFunc_Greater_IntInt_ReturnValue) == 0x0000AC, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x0000B0, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent, CallFunc_Greater_IntInt_ReturnValue_1) == 0x0000B4, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x0000B8, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent, CallFunc_BooleanAND_ReturnValue) == 0x0000BC, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent, CallFunc_Conv_IntToFloat_ReturnValue_2) == 0x0000C0, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent::CallFunc_Conv_IntToFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000C4, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x0000C8, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent, CallFunc_Divide_FloatFloat_ReturnValue_2) == 0x0000CC, "Member 'BP_Athena_Environmental_ZipLine_Spline_C_SetSplinePositionAndTangent::CallFunc_Divide_FloatFloat_ReturnValue_2' has a wrong offset!");

// Function BP_Athena_Environmental_ZipLine_Spline.BP_Athena_Environmental_ZipLine_Spline_C.Calc Auto Location At Alpha
// 0x00D0 (0x00D0 - 0x0000)
struct BP_Athena_Environmental_ZipLine_Spline_C_Calc_Auto_Location_At_Alpha final 
{
public:
	float                                         InAlpha;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DrawDebug;                                         // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_60BE[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                PointLocation;                                     // 0x0008(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SplinePointID;                                     // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_2;      // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_3;      // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
