#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DamageBalloon_Athena

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DamageBalloon_Athena.BP_DamageBalloon_Athena_C
// 0x0030 (0x0AF0 - 0x0AC0)
class ABP_DamageBalloon_Athena_C final  : public ABuildingSMActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AC0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               ExplosionParticle;                                 // 0x0AC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortHealthBarComponent*                FortHealthBar;                                     // 0x0AD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          DestroyBalloon;                                    // 0x0AD8(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	bool                                          DontPlayDestroyAudio;                              // 0x0AD9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_66AB[0x6];                                     // 0x0ADA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnBalloonDestroyed;                                // 0x0AE0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnBalloonDestroyed__DelegateSignature();
	void ExecuteUbergraph_BP_DamageBalloon_Athena(int32 EntryPoint, bool CallFunc_HasAuthority_ReturnValue, float K2Node_Event_Damage, struct FGameplayTagContainer& K2Node_Event_DamageTags, const struct FVector& K2Node_Event_Momentum, struct FHitResult& K2Node_Event_HitInfo, class AController* K2Node_Event_InstigatedBy, class AActor* K2Node_Event_DamageCauser, const struct FGameplayEffectContextHandle& K2Node_Event_EffectContext, float CallFunc_GetHealth_ReturnValue, bool CallFunc_LessEqual_FloatFloat_ReturnValue, bool Temp_bool_IsClosed_Variable, bool Temp_bool_Has_Been_Initd_Variable, const struct FFortAnalyticsEventAttribute& K2Node_MakeStruct_FortAnalyticsEventAttribute);
	void ReceiveBeginPlay();
	void CrateIsGone();
	void OnDamageServer(float Damage, struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	bool ShouldDie(float Damage, class AController* EventInstigator, class AActor* DamageCauser);
	void OnRep_DestroyBalloon(const struct FVector& CallFunc_GetSocketLocation_ReturnValue, class UParticleSystemComponent* CallFunc_SpawnEmitterAtLocation_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DamageBalloon_Athena_C">();
	}
	static class ABP_DamageBalloon_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DamageBalloon_Athena_C>();
	}
};
static_assert(alignof(ABP_DamageBalloon_Athena_C) == 0x000008, "Wrong alinment on ABP_DamageBalloon_Athena_C");
static_assert(sizeof(ABP_DamageBalloon_Athena_C) == 0x000AF0, "Wrong size on ABP_DamageBalloon_Athena_C");
static_assert(offsetof(ABP_DamageBalloon_Athena_C, UberGraphFrame) == 0x000AC0, "Member 'ABP_DamageBalloon_Athena_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_DamageBalloon_Athena_C, ExplosionParticle) == 0x000AC8, "Member 'ABP_DamageBalloon_Athena_C::ExplosionParticle' has a wrong offset!");
static_assert(offsetof(ABP_DamageBalloon_Athena_C, FortHealthBar) == 0x000AD0, "Member 'ABP_DamageBalloon_Athena_C::FortHealthBar' has a wrong offset!");
static_assert(offsetof(ABP_DamageBalloon_Athena_C, DestroyBalloon) == 0x000AD8, "Member 'ABP_DamageBalloon_Athena_C::DestroyBalloon' has a wrong offset!");
static_assert(offsetof(ABP_DamageBalloon_Athena_C, DontPlayDestroyAudio) == 0x000AD9, "Member 'ABP_DamageBalloon_Athena_C::DontPlayDestroyAudio' has a wrong offset!");
static_assert(offsetof(ABP_DamageBalloon_Athena_C, OnBalloonDestroyed) == 0x000AE0, "Member 'ABP_DamageBalloon_Athena_C::OnBalloonDestroyed' has a wrong offset!");

}

