#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Frontend_EventLevel_NavObject_MapTable

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Frontend_EventLevel_NavObject_MapTable.BP_Frontend_EventLevel_NavObject_MapTable_C
// 0x0060 (0x0568 - 0x0508)
class ABP_Frontend_EventLevel_NavObject_MapTable_C final  : public AFortNavigationActor_MapTable
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0508(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Sm_spybase_table_holo_ring_fx;                     // 0x0510(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sm_spybase_table_holo_ring_lights_meshsprites_fx;  // 0x0518(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara;                                           // 0x0520(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Cylinder_Floor_Pad_Glow;                        // 0x0528(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortBangCheckComponent_Map*            FortBangCheckComponent_Map;                        // 0x0530(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MiniMapMID;                                        // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterial*                              MinimapMaterial;                                   // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<TSoftObjectPtr<class UTexture2D>>      MinimapTextures;                                   // 0x0548(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<TSoftObjectPtr<class UTexture2D>>      MinimapDiscoveryMasks;                             // 0x0558(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_MapTable(int32 EntryPoint, bool CallFunc_HasDynamicMinimapTextures_bResult, class UObject* Temp_object_Variable, class UTexture2D* K2Node_DynamicCast_AsTexture_2D, bool K2Node_DynamicCast_bSuccess, class UObject* K2Node_CustomEvent_Loaded, class UObject* Temp_object_Variable_1, class UTexture2D* K2Node_DynamicCast_AsTexture_2D_1, bool K2Node_DynamicCast_bSuccess_1, bool Temp_bool_A_Execution_Happened_Variable, TDelegate<void(class UObject* Loaded)> K2Node_CreateDelegate_OutputDelegate, bool Temp_bool_B_Execution_Happened_Variable, bool CallFunc_BooleanAND_ReturnValue, class UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue, TSoftObjectPtr<class UTexture2D> CallFunc_GetMinimapTextures_MinimapTexture, TSoftObjectPtr<class UTexture2D> CallFunc_GetMinimapTextures_MinimapDiscoveryMask, int32 CallFunc_GetMinimapTextures_MinimapIndex, bool CallFunc_IsValid_ReturnValue, TDelegate<void(class UObject* Loaded)> K2Node_CreateDelegate_OutputDelegate_1, class UObject* K2Node_CustomEvent_Loaded_1, bool CallFunc_HasDynamicMinimapTextures_bResult_1);
	void OnActiveEventsChanged();
	void ApplyMinimapTextures();
	void ReceiveBeginPlay();
	void OnLoaded_A68B6D734D1ACDA59664A699214A131F(class UObject* Loaded);
	void OnLoaded_F6AE426C44DA5A3F148FEB87D7046DD0(class UObject* Loaded);
	void GetMinimapTextures(TSoftObjectPtr<class UTexture2D>* MinimapTexture, TSoftObjectPtr<class UTexture2D>* MinimapDiscoveryMask, int32* MinimapIndex, bool CallFunc_HasDynamicMinimapTextures_bResult, int32 CallFunc_GetMinimapIndex_Index, int32 CallFunc_Array_Length_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_1, int32 CallFunc_Subtract_IntInt_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue_1, int32 CallFunc_Clamp_ReturnValue, int32 CallFunc_Clamp_ReturnValue_1, TSoftObjectPtr<class UTexture2D> CallFunc_Array_Get_Item, TSoftObjectPtr<class UTexture2D> CallFunc_Array_Get_Item_1);
	void GetMinimapIndex(int32* Param_Index);
	void HasDynamicMinimapTextures(bool* bResult, int32 CallFunc_Array_Length_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_Greater_IntInt_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Frontend_EventLevel_NavObject_MapTable_C">();
	}
	static class ABP_Frontend_EventLevel_NavObject_MapTable_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Frontend_EventLevel_NavObject_MapTable_C>();
	}
};
static_assert(alignof(ABP_Frontend_EventLevel_NavObject_MapTable_C) == 0x000008, "Wrong alinment on ABP_Frontend_EventLevel_NavObject_MapTable_C");
static_assert(sizeof(ABP_Frontend_EventLevel_NavObject_MapTable_C) == 0x000568, "Wrong size on ABP_Frontend_EventLevel_NavObject_MapTable_C");
static_assert(offsetof(ABP_Frontend_EventLevel_NavObject_MapTable_C, UberGraphFrame) == 0x000508, "Member 'ABP_Frontend_EventLevel_NavObject_MapTable_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_EventLevel_NavObject_MapTable_C, Sm_spybase_table_holo_ring_fx) == 0x000510, "Member 'ABP_Frontend_EventLevel_NavObject_MapTable_C::Sm_spybase_table_holo_ring_fx' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_EventLevel_NavObject_MapTable_C, Sm_spybase_table_holo_ring_lights_meshsprites_fx) == 0x000518, "Member 'ABP_Frontend_EventLevel_NavObject_MapTable_C::Sm_spybase_table_holo_ring_lights_meshsprites_fx' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_EventLevel_NavObject_MapTable_C, Niagara) == 0x000520, "Member 'ABP_Frontend_EventLevel_NavObject_MapTable_C::Niagara' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_EventLevel_NavObject_MapTable_C, SM_Cylinder_Floor_Pad_Glow) == 0x000528, "Member 'ABP_Frontend_EventLevel_NavObject_MapTable_C::SM_Cylinder_Floor_Pad_Glow' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_EventLevel_NavObject_MapTable_C, FortBangCheckComponent_Map) == 0x000530, "Member 'ABP_Frontend_EventLevel_NavObject_MapTable_C::FortBangCheckComponent_Map' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_EventLevel_NavObject_MapTable_C, MiniMapMID) == 0x000538, "Member 'ABP_Frontend_EventLevel_NavObject_MapTable_C::MiniMapMID' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_EventLevel_NavObject_MapTable_C, MinimapMaterial) == 0x000540, "Member 'ABP_Frontend_EventLevel_NavObject_MapTable_C::MinimapMaterial' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_EventLevel_NavObject_MapTable_C, MinimapTextures) == 0x000548, "Member 'ABP_Frontend_EventLevel_NavObject_MapTable_C::MinimapTextures' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_EventLevel_NavObject_MapTable_C, MinimapDiscoveryMasks) == 0x000558, "Member 'ABP_Frontend_EventLevel_NavObject_MapTable_C::MinimapDiscoveryMasks' has a wrong offset!");

}

