#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ProjectileTrajectory_Athena_SnapToGridArrow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_ProjectileTrajectory_Athena_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "ECardinalDirection_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ProjectileTrajectory_Athena_SnapToGridArrow.BP_ProjectileTrajectory_Athena_SnapToGridArrow_C
// 0x00F0 (0x0360 - 0x0270)
class ABP_ProjectileTrajectory_Athena_SnapToGridArrow_C : public ABP_ProjectileTrajectory_Athena_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_ProjectileTrajectory_Athena_SnapToGridArrow_C; // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_BuildingPreview;                                // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Building;                                          // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         GridSizeXY;                                        // 0x0288(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GridSizeZ;                                         // 0x028C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GridYOffset;                                       // 0x0290(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LastPointDist;                                     // 0x0294(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GridZOffset;                                       // 0x0298(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               YawOffset;                                         // 0x029C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               LastYawOffset;                                     // 0x02A8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                GridSnapPosition;                                  // 0x02B4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LastGridSnapPosition;                              // 0x02C0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E83[0x4];                                     // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             GridSnapSound;                                     // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECardinalDirection                            CardinalDirection;                                 // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E84[0x7];                                     // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<ECardinalDirection, struct FVector>      OrientationDoortraceOffsets;                       // 0x02E0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector                                DoorTraceOffsetHigh;                               // 0x0330(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DoorTraceOffsetLow;                                // 0x033C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          b_HitTerrain;                                      // 0x0348(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E85[0x7];                                     // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            BuildingPreviewMesh;                               // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            BuildingPreviewMeshUnderground;                    // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapToGridArrow(int32 EntryPoint, int32 Temp_int_Array_Index_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 CallFunc_Multiply_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_1, TArray<struct FVector>& K2Node_Event_SplinePoints, TArray<struct FVector>& K2Node_Event_SplineTangents, const struct FVector& CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, const struct FVector& CallFunc_Normal_ReturnValue, const struct FVector& CallFunc_Array_Get_Item_1, const struct FVector& CallFunc_Array_Get_Item_2, const struct FVector& CallFunc_Normal_ReturnValue_1, const struct FVector& CallFunc_Array_Get_Item_3, int32 CallFunc_Array_LastIndex_ReturnValue, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_1, float CallFunc_VSize_ReturnValue, bool CallFunc_Array_IsValidIndex_ReturnValue, int32 CallFunc_Array_LastIndex_ReturnValue_1, const struct FLinearColor& CallFunc_Conv_VectorToLinearColor_ReturnValue, const struct FLinearColor& CallFunc_Conv_VectorToLinearColor_ReturnValue_1, int32 Temp_int_Loop_Counter_Variable, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_2, int32 Temp_int_Loop_Counter_Variable_1, bool CallFunc_Less_IntInt_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue_3, int32 Temp_int_Array_Index_Variable_1, class USplineMeshComponent* CallFunc_Array_Get_Item_4, const struct FVector& CallFunc_GetLocationAtSplinePoint_ReturnValue, const struct FVector& CallFunc_GetLeaveTangentAtSplinePoint_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_4, bool CallFunc_Less_IntInt_ReturnValue_2, const struct FVector& CallFunc_GetArriveTangentAtSplinePoint_ReturnValue, const struct FVector& CallFunc_GetLocationAtSplinePoint_ReturnValue_1, const struct FHitResult& CallFunc_K2_SetWorldLocation_SweepHitResult);
	void SetTrajectorySpline(TArray<struct FVector>& SplinePoints, TArray<struct FVector>& SplineTangents);
	void ReceiveBeginPlay();
	void HandleGridSnapUpdates(const struct FVector& NewLocation, float CallFunc_BreakVector_X, float CallFunc_BreakVector_Y, float CallFunc_BreakVector_Z, TArray<class AActor*>& Temp_object_Variable, class APawn* CallFunc_GetInstigator_ReturnValue, bool CallFunc_IsValid_ReturnValue, const struct FVector& CallFunc_GetActorForwardVector_ReturnValue, float CallFunc_BreakVector_X_1, float CallFunc_BreakVector_Y_1, float CallFunc_BreakVector_Z_1, bool CallFunc_GreaterEqual_FloatFloat_ReturnValue, float CallFunc_GridSnap_Float_ReturnValue, float CallFunc_GridSnap_Float_ReturnValue_1, float CallFunc_Abs_ReturnValue, bool CallFunc_GreaterEqual_FloatFloat_ReturnValue_1, float CallFunc_Abs_ReturnValue_1, bool CallFunc_GreaterEqual_FloatFloat_ReturnValue_2, float CallFunc_Subtract_FloatFloat_ReturnValue, float CallFunc_Subtract_FloatFloat_ReturnValue_1, float CallFunc_GridSnap_Float_ReturnValue_2, bool Temp_bool_Variable, float CallFunc_Add_FloatFloat_ReturnValue, int32 Temp_int_Loop_Counter_Variable, const struct FVector& CallFunc_MakeVector_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, bool Temp_bool_True_if_break_was_hit_Variable, int32 Temp_int_Array_Index_Variable, bool CallFunc_Not_PreBool_ReturnValue, class UStaticMesh* K2Node_Select_Default, bool CallFunc_SetStaticMesh_ReturnValue, const struct FVector& CallFunc_Add_VectorVector_ReturnValue, const struct FVector& CallFunc_Add_VectorVector_ReturnValue_1, const struct FVector& CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, const struct FVector& CallFunc_Add_VectorVector_ReturnValue_2, const struct FHitResult& CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult, const struct FVector& CallFunc_Add_VectorVector_ReturnValue_3, TArray<struct FHitResult>& CallFunc_BoxTraceMulti_OutHits, bool CallFunc_BoxTraceMulti_ReturnValue, const struct FHitResult& CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_BreakHitResult_bBlockingHit, bool CallFunc_BreakHitResult_bInitialOverlap, float CallFunc_BreakHitResult_Time, float CallFunc_BreakHitResult_Distance, const struct FVector& CallFunc_BreakHitResult_Location, const struct FVector& CallFunc_BreakHitResult_ImpactPoint, const struct FVector& CallFunc_BreakHitResult_Normal, const struct FVector& CallFunc_BreakHitResult_ImpactNormal, class UPhysicalMaterial* CallFunc_BreakHitResult_PhysMat, class AActor* CallFunc_BreakHitResult_HitActor, class UPrimitiveComponent* CallFunc_BreakHitResult_HitComponent, class FName CallFunc_BreakHitResult_HitBoneName, int32 CallFunc_BreakHitResult_HitItem, int32 CallFunc_BreakHitResult_ElementIndex, int32 CallFunc_BreakHitResult_FaceIndex, const struct FVector& CallFunc_BreakHitResult_TraceStart, const struct FVector& CallFunc_BreakHitResult_TraceEnd, bool CallFunc_Less_IntInt_ReturnValue, class ABuildingActor* K2Node_DynamicCast_AsBuilding_Actor, bool K2Node_DynamicCast_bSuccess, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_NotEqual_RotatorRotator_ReturnValue, bool CallFunc_NotEqual_VectorVector_ReturnValue, bool CallFunc_BooleanOR_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ProjectileTrajectory_Athena_SnapToGridArrow_C">();
	}
	static class ABP_ProjectileTrajectory_Athena_SnapToGridArrow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ProjectileTrajectory_Athena_SnapToGridArrow_C>();
	}
};
static_assert(alignof(ABP_ProjectileTrajectory_Athena_SnapToGridArrow_C) == 0x000008, "Wrong alinment on ABP_ProjectileTrajectory_Athena_SnapToGridArrow_C");
static_assert(sizeof(ABP_ProjectileTrajectory_Athena_SnapToGridArrow_C) == 0x000360, "Wrong size on ABP_ProjectileTrajectory_Athena_SnapToGridArrow_C");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapToGridArrow_C, UberGraphFrame_BP_ProjectileTrajectory_Athena_SnapToGridArrow_C) == 0x000270, "Member 'ABP_ProjectileTrajectory_Athena_SnapToGridArrow_C::UberGraphFrame_BP_ProjectileTrajectory_Athena_SnapToGridArrow_C' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapToGridArrow_C, SM_BuildingPreview) == 0x000278, "Member 'ABP_ProjectileTrajectory_Athena_SnapToGridArrow_C::SM_BuildingPreview' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapToGridArrow_C, Building) == 0x000280, "Member 'ABP_ProjectileTrajectory_Athena_SnapToGridArrow_C::Building' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapToGridArrow_C, GridSizeXY) == 0x000288, "Member 'ABP_ProjectileTrajectory_Athena_SnapToGridArrow_C::GridSizeXY' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapToGridArrow_C, GridSizeZ) == 0x00028C, "Member 'ABP_ProjectileTrajectory_Athena_SnapToGridArrow_C::GridSizeZ' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapToGridArrow_C, GridYOffset) == 0x000290, "Member 'ABP_ProjectileTrajectory_Athena_SnapToGridArrow_C::GridYOffset' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapToGridArrow_C, LastPointDist) == 0x000294, "Member 'ABP_ProjectileTrajectory_Athena_SnapToGridArrow_C::LastPointDist' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapToGridArrow_C, GridZOffset) == 0x000298, "Member 'ABP_ProjectileTrajectory_Athena_SnapToGridArrow_C::GridZOffset' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapToGridArrow_C, YawOffset) == 0x00029C, "Member 'ABP_ProjectileTrajectory_Athena_SnapToGridArrow_C::YawOffset' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapToGridArrow_C, LastYawOffset) == 0x0002A8, "Member 'ABP_ProjectileTrajectory_Athena_SnapToGridArrow_C::LastYawOffset' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapToGridArrow_C, GridSnapPosition) == 0x0002B4, "Member 'ABP_ProjectileTrajectory_Athena_SnapToGridArrow_C::GridSnapPosition' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapToGridArrow_C, LastGridSnapPosition) == 0x0002C0, "Member 'ABP_ProjectileTrajectory_Athena_SnapToGridArrow_C::LastGridSnapPosition' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapToGridArrow_C, GridSnapSound) == 0x0002D0, "Member 'ABP_ProjectileTrajectory_Athena_SnapToGridArrow_C::GridSnapSound' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapToGridArrow_C, CardinalDirection) == 0x0002D8, "Member 'ABP_ProjectileTrajectory_Athena_SnapToGridArrow_C::CardinalDirection' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapToGridArrow_C, OrientationDoortraceOffsets) == 0x0002E0, "Member 'ABP_ProjectileTrajectory_Athena_SnapToGridArrow_C::OrientationDoortraceOffsets' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapToGridArrow_C, DoorTraceOffsetHigh) == 0x000330, "Member 'ABP_ProjectileTrajectory_Athena_SnapToGridArrow_C::DoorTraceOffsetHigh' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapToGridArrow_C, DoorTraceOffsetLow) == 0x00033C, "Member 'ABP_ProjectileTrajectory_Athena_SnapToGridArrow_C::DoorTraceOffsetLow' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapToGridArrow_C, b_HitTerrain) == 0x000348, "Member 'ABP_ProjectileTrajectory_Athena_SnapToGridArrow_C::b_HitTerrain' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapToGridArrow_C, BuildingPreviewMesh) == 0x000350, "Member 'ABP_ProjectileTrajectory_Athena_SnapToGridArrow_C::BuildingPreviewMesh' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapToGridArrow_C, BuildingPreviewMeshUnderground) == 0x000358, "Member 'ABP_ProjectileTrajectory_Athena_SnapToGridArrow_C::BuildingPreviewMeshUnderground' has a wrong offset!");

}

