#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ProjectileTrajectory_Athena_SnapBoxToGrid

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_ProjectileTrajectory_Athena_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "ECardinalDirection_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ProjectileTrajectory_Athena_SnapBoxToGrid.BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C
// 0x0080 (0x02F0 - 0x0270)
class ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C : public ABP_ProjectileTrajectory_Athena_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C; // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_BuildingPreview;                                // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Building;                                          // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         GridSizeXY;                                        // 0x0288(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GridSizeZ;                                         // 0x028C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GridYOffset;                                       // 0x0290(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LastPointDist;                                     // 0x0294(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GridZOffset;                                       // 0x0298(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               YawOffset;                                         // 0x029C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               LastYawOffset;                                     // 0x02A8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                GridSnapPosition;                                  // 0x02B4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LastGridSnapPosition;                              // 0x02C0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43FD[0x4];                                     // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             GridSnapSound;                                     // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECardinalDirection                            CardinalDirection;                                 // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43FE[0x7];                                     // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            BuildingPreviewMesh;                               // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortPlaysetItemDefinition*             CachedPlayset;                                     // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid(int32 EntryPoint, int32 Temp_int_Array_Index_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 CallFunc_Multiply_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_1, class AActor* K2Node_Event_OtherActor, TArray<struct FVector>& K2Node_Event_SplinePoints, TArray<struct FVector>& K2Node_Event_SplineTangents, const struct FVector& CallFunc_Array_Get_Item, const struct FVector& CallFunc_Array_Get_Item_1, const struct FVector& CallFunc_Normal_ReturnValue, const struct FVector& CallFunc_Normal_ReturnValue_1, const struct FVector& CallFunc_Array_Get_Item_2, const struct FVector& CallFunc_Array_Get_Item_3, int32 CallFunc_Array_LastIndex_ReturnValue, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, float CallFunc_VSize_ReturnValue, bool CallFunc_Array_IsValidIndex_ReturnValue, int32 CallFunc_Array_LastIndex_ReturnValue_1, const struct FLinearColor& CallFunc_Conv_VectorToLinearColor_ReturnValue, const struct FLinearColor& CallFunc_Conv_VectorToLinearColor_ReturnValue_1, int32 CallFunc_Array_Length_ReturnValue_1, int32 Temp_int_Loop_Counter_Variable, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_2, int32 Temp_int_Loop_Counter_Variable_1, bool CallFunc_Less_IntInt_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue_3, int32 Temp_int_Array_Index_Variable_1, class USplineMeshComponent* CallFunc_Array_Get_Item_4, const struct FVector& CallFunc_GetLocationAtSplinePoint_ReturnValue, const struct FVector& CallFunc_GetLeaveTangentAtSplinePoint_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_4, bool CallFunc_Less_IntInt_ReturnValue_2, const struct FVector& CallFunc_GetArriveTangentAtSplinePoint_ReturnValue, const struct FVector& CallFunc_GetLocationAtSplinePoint_ReturnValue_1, const struct FHitResult& CallFunc_K2_SetWorldLocation_SweepHitResult);
	void SetTrajectorySpline(TArray<struct FVector>& SplinePoints, TArray<struct FVector>& SplineTangents);
	void ReceiveActorBeginOverlap(class AActor* OtherActor);
	void ReceiveBeginPlay();
	void UserConstructionScript(bool CallFunc_SetStaticMesh_ReturnValue);
	void HandleGridSnapUpdates(const struct FVector& NewLocation, const struct FVector& AdjustedPosition, const struct FRotator& PlaysetRotation, class APawn* CallFunc_GetInstigator_ReturnValue, float CallFunc_BreakVector_X, float CallFunc_BreakVector_Y, float CallFunc_BreakVector_Z, const struct FVector& CallFunc_GetActorForwardVector_ReturnValue, float CallFunc_Divide_FloatFloat_ReturnValue, float CallFunc_BreakVector_X_1, float CallFunc_BreakVector_Y_1, float CallFunc_BreakVector_Z_1, int32 CallFunc_Round_ReturnValue, bool CallFunc_GreaterEqual_FloatFloat_ReturnValue, float CallFunc_Multiply_IntFloat_ReturnValue, float CallFunc_Abs_ReturnValue, bool CallFunc_GreaterEqual_FloatFloat_ReturnValue_1, float CallFunc_Abs_ReturnValue_1, bool CallFunc_GreaterEqual_FloatFloat_ReturnValue_2, float CallFunc_Divide_FloatFloat_ReturnValue_1, int32 CallFunc_Round_ReturnValue_1, float CallFunc_Divide_FloatFloat_ReturnValue_2, float CallFunc_Multiply_IntFloat_ReturnValue_1, int32 CallFunc_Round_ReturnValue_2, float CallFunc_Multiply_IntFloat_ReturnValue_2, const struct FVector& CallFunc_MakeVector_ReturnValue, const struct FRotator& CallFunc_ComposeRotators_ReturnValue, bool CallFunc_GetPlaysetFromController_bSuccess, const struct FVector& CallFunc_AdjustToFinalLocation_ReturnValue, bool CallFunc_IsValid_ReturnValue, const struct FRotator& CallFunc_ComposeRotators_ReturnValue_1, const struct FHitResult& CallFunc_K2_SetWorldRotation_SweepHitResult, const struct FHitResult& CallFunc_K2_SetWorldRotation_SweepHitResult_1, const struct FHitResult& CallFunc_K2_SetWorldLocation_SweepHitResult, bool CallFunc_NotEqual_RotatorRotator_ReturnValue, bool CallFunc_NotEqual_VectorVector_ReturnValue, bool CallFunc_BooleanOR_ReturnValue);
	void UpdateScaleForPlayset(class APlayerController* CallFunc_GetPlayerController_ReturnValue, class AFortPlayerControllerAthena* K2Node_DynamicCast_AsFort_Player_Controller_Athena, bool K2Node_DynamicCast_bSuccess, int32 CallFunc_GetPlaysetSize_SizeX, int32 CallFunc_GetPlaysetSize_SizeY, int32 CallFunc_GetPlaysetSize_SizeZ, class UFortPlaysetItemDefinition* CallFunc_GetPlayset_ReturnValue, float CallFunc_Conv_IntToFloat_ReturnValue, float CallFunc_Divide_FloatFloat_ReturnValue, float CallFunc_Conv_IntToFloat_ReturnValue_1, float CallFunc_Multiply_FloatFloat_ReturnValue, float CallFunc_Divide_FloatFloat_ReturnValue_1, float CallFunc_Conv_IntToFloat_ReturnValue_2, float CallFunc_Multiply_FloatFloat_ReturnValue_1, float CallFunc_Divide_FloatFloat_ReturnValue_2, float CallFunc_Multiply_FloatFloat_ReturnValue_2, const struct FVector& CallFunc_K2_GetComponentScale_ReturnValue, const struct FVector& CallFunc_MakeVector_ReturnValue, const struct FVector& CallFunc_GetComponentBounds_Origin, const struct FVector& CallFunc_GetComponentBounds_BoxExtent, float CallFunc_GetComponentBounds_SphereRadius, const struct FVector& CallFunc_Multiply_VectorVector_ReturnValue, const struct FVector& CallFunc_Divide_VectorVector_ReturnValue, float CallFunc_BreakVector_X, float CallFunc_BreakVector_Y, float CallFunc_BreakVector_Z, const struct FVector& CallFunc_MakeVector_ReturnValue_1);
	void GetPlaysetFromController(bool* bSuccess, bool CallFunc_IsValid_ReturnValue, class APlayerController* CallFunc_GetPlayerController_ReturnValue, class AFortPlayerControllerAthena* K2Node_DynamicCast_AsFort_Player_Controller_Athena, bool K2Node_DynamicCast_bSuccess, class UFortPlaysetItemDefinition* CallFunc_GetPlayset_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C">();
	}
	static class ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C>();
	}
};
static_assert(alignof(ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C) == 0x000008, "Wrong alinment on ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C");
static_assert(sizeof(ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C) == 0x0002F0, "Wrong size on ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C, UberGraphFrame_BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C) == 0x000270, "Member 'ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C::UberGraphFrame_BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C, SM_BuildingPreview) == 0x000278, "Member 'ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C::SM_BuildingPreview' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C, Building) == 0x000280, "Member 'ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C::Building' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C, GridSizeXY) == 0x000288, "Member 'ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C::GridSizeXY' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C, GridSizeZ) == 0x00028C, "Member 'ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C::GridSizeZ' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C, GridYOffset) == 0x000290, "Member 'ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C::GridYOffset' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C, LastPointDist) == 0x000294, "Member 'ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C::LastPointDist' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C, GridZOffset) == 0x000298, "Member 'ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C::GridZOffset' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C, YawOffset) == 0x00029C, "Member 'ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C::YawOffset' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C, LastYawOffset) == 0x0002A8, "Member 'ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C::LastYawOffset' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C, GridSnapPosition) == 0x0002B4, "Member 'ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C::GridSnapPosition' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C, LastGridSnapPosition) == 0x0002C0, "Member 'ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C::LastGridSnapPosition' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C, GridSnapSound) == 0x0002D0, "Member 'ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C::GridSnapSound' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C, CardinalDirection) == 0x0002D8, "Member 'ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C::CardinalDirection' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C, BuildingPreviewMesh) == 0x0002E0, "Member 'ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C::BuildingPreviewMesh' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C, CachedPlayset) == 0x0002E8, "Member 'ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C::CachedPlayset' has a wrong offset!");

}

