#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SurfaceTypeSoundComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SurfaceTypeSoundComponent.BP_SurfaceTypeSoundComponent_C
// 0x0070 (0x0120 - 0x00B0)
class UBP_SurfaceTypeSoundComponent_C final  : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	EPhysicalSurface                              SurfaceType;                                       // 0x00B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FBB[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EPhysicalSurface, class USoundBase*>     SoundMap;                                          // 0x00C0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector                                Location;                                          // 0x0110(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSurfaceTypeSet;                                  // 0x011C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_SurfaceTypeSoundComponent(int32 EntryPoint);
	void Test_Delay();
	void PlaySound(const struct FVector& Param_Location, class USoundBase* CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, bool CallFunc_BooleanAND_ReturnValue);
	void SetSurfaceType(EPhysicalSurface Param_SurfaceType, class AActor* Actor, EPhysicalSurface Temp_byte_Variable, bool CallFunc_IsValid_ReturnValue, class ABuildingSMActor* K2Node_DynamicCast_AsBuilding_SMActor, bool K2Node_DynamicCast_bSuccess, EPhysicalSurface Temp_byte_Variable_1, EPhysicalSurface Temp_byte_Variable_2, EPhysicalSurface Temp_byte_Variable_3, EPhysicalSurface Temp_byte_Variable_4, EFortResourceType Temp_byte_Variable_5, EPhysicalSurface Temp_byte_Variable_6, EPhysicalSurface K2Node_Select_Default);
	void ActuallyPlaySound(class USoundBase* CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SurfaceTypeSoundComponent_C">();
	}
	static class UBP_SurfaceTypeSoundComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_SurfaceTypeSoundComponent_C>();
	}
};
static_assert(alignof(UBP_SurfaceTypeSoundComponent_C) == 0x000008, "Wrong alinment on UBP_SurfaceTypeSoundComponent_C");
static_assert(sizeof(UBP_SurfaceTypeSoundComponent_C) == 0x000120, "Wrong size on UBP_SurfaceTypeSoundComponent_C");
static_assert(offsetof(UBP_SurfaceTypeSoundComponent_C, UberGraphFrame) == 0x0000B0, "Member 'UBP_SurfaceTypeSoundComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_SurfaceTypeSoundComponent_C, SurfaceType) == 0x0000B8, "Member 'UBP_SurfaceTypeSoundComponent_C::SurfaceType' has a wrong offset!");
static_assert(offsetof(UBP_SurfaceTypeSoundComponent_C, SoundMap) == 0x0000C0, "Member 'UBP_SurfaceTypeSoundComponent_C::SoundMap' has a wrong offset!");
static_assert(offsetof(UBP_SurfaceTypeSoundComponent_C, Location) == 0x000110, "Member 'UBP_SurfaceTypeSoundComponent_C::Location' has a wrong offset!");
static_assert(offsetof(UBP_SurfaceTypeSoundComponent_C, IsSurfaceTypeSet) == 0x00011C, "Member 'UBP_SurfaceTypeSoundComponent_C::IsSurfaceTypeSet' has a wrong offset!");

}

