#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UI_ScannerScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_UI_ScannerScreen.BP_UI_ScannerScreen_C
// 0x0038 (0x0808 - 0x07D0)
class ABP_UI_ScannerScreen_C final  : public ABuildingGameplayActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetComponent*                       ScreenWidget;                                      // 0x07D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x07E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         ErrorTimeline_Switch_EBBEA5504EC9CD2C274D38AA3BFC1EEF; // 0x07E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ErrorTimeline__Direction_EBBEA5504EC9CD2C274D38AA3BFC1EEF; // 0x07EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F05[0x3];                                     // 0x07ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     ErrorTimeline;                                     // 0x07F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUI_ScannerScreen_C*                    Widget_Screen;                                     // 0x07F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           TimeoutHandle;                                     // 0x0800(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_UI_ScannerScreen(int32 EntryPoint, const struct FLinearColor& CallFunc_MakeColor_ReturnValue, const struct FLinearColor& CallFunc_MakeColor_ReturnValue_1, class FText K2Node_CustomEvent_SuccessText, class UMaterialInstanceDynamic* CallFunc_GetMaterialInstance_ReturnValue, class FText K2Node_CustomEvent_FailureText, class UUserWidget* CallFunc_GetUserWidgetObject_ReturnValue, class UUI_ScannerScreen_C* K2Node_DynamicCast_AsUI_Scanner_Screen, bool K2Node_DynamicCast_bSuccess, bool K2Node_CustomEvent_Reverse, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, class FText K2Node_CustomEvent_LostText, const struct FLinearColor& CallFunc_LinearColorLerp_ReturnValue, const struct FLinearColor& CallFunc_Multiply_LinearColorFloat_ReturnValue);
	void ScreenEventTargetLost(class FText LostText);
	void ScreenEventDismiss();
	void ScreenEventScan();
	void ScreenEventFailure(class FText FailureText);
	void ScreenEventSuccess(class FText SuccessText);
	void ScreenEventError(bool Reverse);
	void ReceiveBeginPlay();
	void ErrorTimeline__UpdateFunc();
	void ErrorTimeline__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_UI_ScannerScreen_C">();
	}
	static class ABP_UI_ScannerScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_UI_ScannerScreen_C>();
	}
};
static_assert(alignof(ABP_UI_ScannerScreen_C) == 0x000008, "Wrong alinment on ABP_UI_ScannerScreen_C");
static_assert(sizeof(ABP_UI_ScannerScreen_C) == 0x000808, "Wrong size on ABP_UI_ScannerScreen_C");
static_assert(offsetof(ABP_UI_ScannerScreen_C, UberGraphFrame) == 0x0007D0, "Member 'ABP_UI_ScannerScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_UI_ScannerScreen_C, ScreenWidget) == 0x0007D8, "Member 'ABP_UI_ScannerScreen_C::ScreenWidget' has a wrong offset!");
static_assert(offsetof(ABP_UI_ScannerScreen_C, DefaultSceneRoot) == 0x0007E0, "Member 'ABP_UI_ScannerScreen_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_UI_ScannerScreen_C, ErrorTimeline_Switch_EBBEA5504EC9CD2C274D38AA3BFC1EEF) == 0x0007E8, "Member 'ABP_UI_ScannerScreen_C::ErrorTimeline_Switch_EBBEA5504EC9CD2C274D38AA3BFC1EEF' has a wrong offset!");
static_assert(offsetof(ABP_UI_ScannerScreen_C, ErrorTimeline__Direction_EBBEA5504EC9CD2C274D38AA3BFC1EEF) == 0x0007EC, "Member 'ABP_UI_ScannerScreen_C::ErrorTimeline__Direction_EBBEA5504EC9CD2C274D38AA3BFC1EEF' has a wrong offset!");
static_assert(offsetof(ABP_UI_ScannerScreen_C, ErrorTimeline) == 0x0007F0, "Member 'ABP_UI_ScannerScreen_C::ErrorTimeline' has a wrong offset!");
static_assert(offsetof(ABP_UI_ScannerScreen_C, Widget_Screen) == 0x0007F8, "Member 'ABP_UI_ScannerScreen_C::Widget_Screen' has a wrong offset!");
static_assert(offsetof(ABP_UI_ScannerScreen_C, TimeoutHandle) == 0x000800, "Member 'ABP_UI_ScannerScreen_C::TimeoutHandle' has a wrong offset!");

}

