#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VictoryDrone

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_VictoryDrone.BP_VictoryDrone_C
// 0x0070 (0x02F0 - 0x0280)
class ABP_VictoryDrone_C final  : public APawn
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponentBudgeted*         SkeletalMeshComponentBudgeted;                     // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             SpawnOutAnimEndedDispatcher;                       // 0x0298(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                         AnimPlayRate;                                      // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6280[0x4];                                     // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               StaticMeshMID;                                     // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TeleportIn;                                        // 0x02B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          IsAthena;                                          // 0x02B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_6281[0x6];                                     // 0x02BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              TargetPlayer;                                      // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UParticleSystemComponent*               CharacterAttached;                                 // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InLobby;                                           // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          IsNPC;                                             // 0x02D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_6282[0x2];                                     // 0x02D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   AttachPoint;                                       // 0x02D4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDecoy;                                           // 0x02DC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_6283[0x3];                                     // 0x02DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 Mesh_for_Attachment;                               // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SoundOnNPCDeath;                                   // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SpawnOutAnimEndedDispatcher__DelegateSignature(class ABP_VictoryDrone_C* Drone);
	void ExecuteUbergraph_BP_VictoryDrone(int32 EntryPoint, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue, float Temp_float_Variable, bool Temp_bool_Variable, class USoundBase* Temp_object_Variable, class UAnimMontage* K2Node_CustomEvent_Montage, bool K2Node_CustomEvent_bInterrupted, float K2Node_Event_DeltaSeconds, float Temp_float_Variable_1, const struct FRotator& CallFunc_K2_GetActorRotation_ReturnValue, float CallFunc_BreakRotator_Roll, float CallFunc_BreakRotator_Pitch, float CallFunc_BreakRotator_Yaw, const struct FRotator& CallFunc_MakeRotator_ReturnValue, bool CallFunc_K2_SetActorRotation_ReturnValue, class UMaterialInterface* CallFunc_GetMaterial_ReturnValue, class UMaterialInstanceDynamic* K2Node_DynamicCast_AsMaterial_Instance_Dynamic, bool K2Node_DynamicCast_bSuccess, float CallFunc_K2_GetScalarParameterValue_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool Temp_bool_Variable_1, float K2Node_Select_Default, class USoundBase* K2Node_Select_Default_1);
	void ReceiveTick(float DeltaSeconds);
	void OnSpawnOutAnimEnded(class UAnimMontage* Montage, bool bInterrupted);
	void ReceiveBeginPlay();
	void InitDrone();
	void PlaySpawnAnim(class UAnimMontage* Montage, float NewLocalVar_0, bool Temp_bool_Variable, bool CallFunc_IsValid_ReturnValue, class UAnimationAsset* Temp_object_Variable, class UAnimationAsset* Temp_object_Variable_1, bool Temp_bool_Variable_1, class UAnimationAsset* Temp_object_Variable_2, const struct FVector& CallFunc_GetSocketLocation_ReturnValue, class UParticleSystemComponent* CallFunc_SpawnEmitterAtLocation_ReturnValue, bool Temp_bool_Variable_2, class UParticleSystemComponent* CallFunc_SpawnEmitterAttached_ReturnValue, const struct FVector& CallFunc_GetSocketLocation_ReturnValue_1, class UParticleSystemComponent* CallFunc_SpawnEmitterAtLocation_ReturnValue_1, class UParticleSystemComponent* CallFunc_SpawnEmitterAttached_ReturnValue_1, class UParticleSystemComponent* CallFunc_SpawnEmitterAttached_ReturnValue_2, class UAnimationAsset* Temp_object_Variable_3, class UAnimationAsset* Temp_object_Variable_4, class UAnimInstance* CallFunc_GetAnimInstance_ReturnValue, class UAnimationAsset* K2Node_Select_Default, bool Temp_bool_Variable_3, TDelegate<void(class UAnimMontage* Montage, bool bInterrupted)> K2Node_CreateDelegate_OutputDelegate, class UAnimationAsset* K2Node_Select_Default_1, class UAnimationAsset* K2Node_Select_Default_2, class UAnimationAsset* K2Node_Select_Default_3);
	void NotifyTeleportFinishedTriggered(bool CallFunc_HasAuthority_ReturnValue);
	void NPC_FX_Parameters(TArray<struct FParticleSysParam>* Instance_Parameters, const struct FParticleSysParam& K2Node_MakeStruct_ParticleSysParam, const struct FParticleSysParam& K2Node_MakeStruct_ParticleSysParam_1, const struct FParticleSysParam& K2Node_MakeStruct_ParticleSysParam_2, const struct FParticleSysParam& K2Node_MakeStruct_ParticleSysParam_3, const struct FParticleSysParam& K2Node_MakeStruct_ParticleSysParam_4, const struct FParticleSysParam& K2Node_MakeStruct_ParticleSysParam_5, const struct FParticleSysParam& K2Node_MakeStruct_ParticleSysParam_6, const struct FParticleSysParam& K2Node_MakeStruct_ParticleSysParam_7, const struct FParticleSysParam& K2Node_MakeStruct_ParticleSysParam_8, TArray<struct FParticleSysParam>& K2Node_MakeArray_Array);
	void Decoy_FX_Parameters(TArray<struct FParticleSysParam>* Instance_Parameters, const struct FParticleSysParam& K2Node_MakeStruct_ParticleSysParam, const struct FParticleSysParam& K2Node_MakeStruct_ParticleSysParam_1, const struct FParticleSysParam& K2Node_MakeStruct_ParticleSysParam_2, const struct FParticleSysParam& K2Node_MakeStruct_ParticleSysParam_3, const struct FParticleSysParam& K2Node_MakeStruct_ParticleSysParam_4, const struct FParticleSysParam& K2Node_MakeStruct_ParticleSysParam_5, const struct FParticleSysParam& K2Node_MakeStruct_ParticleSysParam_6, const struct FParticleSysParam& K2Node_MakeStruct_ParticleSysParam_7, const struct FParticleSysParam& K2Node_MakeStruct_ParticleSysParam_8, TArray<struct FParticleSysParam>& K2Node_MakeArray_Array);
	void Added_Death_Audio(class USoundBase* Sound_to_Spawn, bool CallFunc_IsValid_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, class UAudioComponent* CallFunc_SpawnSoundAtLocation_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_VictoryDrone_C">();
	}
	static class ABP_VictoryDrone_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_VictoryDrone_C>();
	}
};
static_assert(alignof(ABP_VictoryDrone_C) == 0x000008, "Wrong alinment on ABP_VictoryDrone_C");
static_assert(sizeof(ABP_VictoryDrone_C) == 0x0002F0, "Wrong size on ABP_VictoryDrone_C");
static_assert(offsetof(ABP_VictoryDrone_C, UberGraphFrame) == 0x000280, "Member 'ABP_VictoryDrone_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_VictoryDrone_C, SkeletalMeshComponentBudgeted) == 0x000288, "Member 'ABP_VictoryDrone_C::SkeletalMeshComponentBudgeted' has a wrong offset!");
static_assert(offsetof(ABP_VictoryDrone_C, Scene) == 0x000290, "Member 'ABP_VictoryDrone_C::Scene' has a wrong offset!");
static_assert(offsetof(ABP_VictoryDrone_C, SpawnOutAnimEndedDispatcher) == 0x000298, "Member 'ABP_VictoryDrone_C::SpawnOutAnimEndedDispatcher' has a wrong offset!");
static_assert(offsetof(ABP_VictoryDrone_C, AnimPlayRate) == 0x0002A8, "Member 'ABP_VictoryDrone_C::AnimPlayRate' has a wrong offset!");
static_assert(offsetof(ABP_VictoryDrone_C, StaticMeshMID) == 0x0002B0, "Member 'ABP_VictoryDrone_C::StaticMeshMID' has a wrong offset!");
static_assert(offsetof(ABP_VictoryDrone_C, TeleportIn) == 0x0002B8, "Member 'ABP_VictoryDrone_C::TeleportIn' has a wrong offset!");
static_assert(offsetof(ABP_VictoryDrone_C, IsAthena) == 0x0002B9, "Member 'ABP_VictoryDrone_C::IsAthena' has a wrong offset!");
static_assert(offsetof(ABP_VictoryDrone_C, TargetPlayer) == 0x0002C0, "Member 'ABP_VictoryDrone_C::TargetPlayer' has a wrong offset!");
static_assert(offsetof(ABP_VictoryDrone_C, CharacterAttached) == 0x0002C8, "Member 'ABP_VictoryDrone_C::CharacterAttached' has a wrong offset!");
static_assert(offsetof(ABP_VictoryDrone_C, InLobby) == 0x0002D0, "Member 'ABP_VictoryDrone_C::InLobby' has a wrong offset!");
static_assert(offsetof(ABP_VictoryDrone_C, IsNPC) == 0x0002D1, "Member 'ABP_VictoryDrone_C::IsNPC' has a wrong offset!");
static_assert(offsetof(ABP_VictoryDrone_C, AttachPoint) == 0x0002D4, "Member 'ABP_VictoryDrone_C::AttachPoint' has a wrong offset!");
static_assert(offsetof(ABP_VictoryDrone_C, IsDecoy) == 0x0002DC, "Member 'ABP_VictoryDrone_C::IsDecoy' has a wrong offset!");
static_assert(offsetof(ABP_VictoryDrone_C, Mesh_for_Attachment) == 0x0002E0, "Member 'ABP_VictoryDrone_C::Mesh_for_Attachment' has a wrong offset!");
static_assert(offsetof(ABP_VictoryDrone_C, SoundOnNPCDeath) == 0x0002E8, "Member 'ABP_VictoryDrone_C::SoundOnNPCDeath' has a wrong offset!");

}

