#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Water_HISMC_Grid

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Water_HISMC_Grid.BP_Water_HISMC_Grid_C
// 0x0028 (0x0248 - 0x0220)
class ABP_Water_HISMC_Grid_C final  : public AActor
{
public:
	class UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh;                   // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         Cell_Size;                                         // 0x0230(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Cells_X;                                           // 0x0234(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Cells_Y;                                           // 0x0238(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57AE[0x4];                                     // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Material;                                          // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript(int32 Temp_int_Variable, int32 Temp_int_Variable_1, float CallFunc_Conv_IntToFloat_ReturnValue, float CallFunc_Conv_IntToFloat_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_1, float CallFunc_Conv_IntToFloat_ReturnValue_2, float CallFunc_Divide_FloatFloat_ReturnValue, const struct FVector& CallFunc_Conv_FloatToVector_ReturnValue, float CallFunc_Conv_IntToFloat_ReturnValue_3, const struct FVector& CallFunc_Conv_FloatToVector_ReturnValue_1, float CallFunc_Conv_IntToFloat_ReturnValue_4, const struct FVector& CallFunc_Multiply_VectorVector_ReturnValue, float CallFunc_Divide_FloatFloat_ReturnValue_1, int32 CallFunc_Subtract_IntInt_ReturnValue, float CallFunc_Subtract_FloatFloat_ReturnValue, bool CallFunc_LessEqual_IntInt_ReturnValue, float CallFunc_Conv_IntToFloat_ReturnValue_5, int32 CallFunc_Subtract_IntInt_ReturnValue_1, float CallFunc_Divide_FloatFloat_ReturnValue_2, bool CallFunc_LessEqual_IntInt_ReturnValue_1, float CallFunc_Subtract_FloatFloat_ReturnValue_1, const struct FVector& CallFunc_MakeVector_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue, const struct FVector& CallFunc_Add_VectorVector_ReturnValue, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue_1, const struct FVector& CallFunc_Add_VectorVector_ReturnValue_1, const struct FTransform& CallFunc_MakeTransform_ReturnValue, int32 CallFunc_AddInstanceWorldSpace_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Water_HISMC_Grid_C">();
	}
	static class ABP_Water_HISMC_Grid_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Water_HISMC_Grid_C>();
	}
};
static_assert(alignof(ABP_Water_HISMC_Grid_C) == 0x000008, "Wrong alinment on ABP_Water_HISMC_Grid_C");
static_assert(sizeof(ABP_Water_HISMC_Grid_C) == 0x000248, "Wrong size on ABP_Water_HISMC_Grid_C");
static_assert(offsetof(ABP_Water_HISMC_Grid_C, HierarchicalInstancedStaticMesh) == 0x000220, "Member 'ABP_Water_HISMC_Grid_C::HierarchicalInstancedStaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_Water_HISMC_Grid_C, DefaultSceneRoot) == 0x000228, "Member 'ABP_Water_HISMC_Grid_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Water_HISMC_Grid_C, Cell_Size) == 0x000230, "Member 'ABP_Water_HISMC_Grid_C::Cell_Size' has a wrong offset!");
static_assert(offsetof(ABP_Water_HISMC_Grid_C, Cells_X) == 0x000234, "Member 'ABP_Water_HISMC_Grid_C::Cells_X' has a wrong offset!");
static_assert(offsetof(ABP_Water_HISMC_Grid_C, Cells_Y) == 0x000238, "Member 'ABP_Water_HISMC_Grid_C::Cells_Y' has a wrong offset!");
static_assert(offsetof(ABP_Water_HISMC_Grid_C, Material) == 0x000240, "Member 'ABP_Water_HISMC_Grid_C::Material' has a wrong offset!");

}

