#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ZipLine_Athena_Harness

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ZipLine_Athena_Harness.BP_ZipLine_Athena_Harness_C
// 0x00B8 (0x02D8 - 0x0220)
class ABP_ZipLine_Athena_Harness_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        TravelAudio;                                       // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_Zipline_AttachedToPlayer;                        // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Zipline_Magnet;                                 // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_Zipline_Pulley_SpeedLines;                       // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Zipline_Motor;                                  // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        SpawnFX;                                           // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        DestroyFX;                                         // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        CollideDestroyVFX;                                 // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SpawnSound;                                        // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             UnSpawnSound;                                      // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CurrentAttachDetachSound;                          // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        AttachedPlayer;                                    // 0x0290(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          HasHitAnotherPlayer;                               // 0x0298(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6337[0x3];                                     // 0x0299(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ZiplineChimeVisualUpdate;                          // 0x029C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           ChimeTimer;                                        // 0x02A0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ZiplineDirection;                                  // 0x02A8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6338[0x4];                                     // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USplineComponent*                       NewVar_0;                                          // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Athena_Environmental_ZipLine_Spline_C* EnvZiplineSpline;                                  // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SplineRotationUpdateSeconds;                       // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6339[0x4];                                     // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           MotorUpdateTimer;                                  // 0x02D0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ZipLine_Athena_Harness(int32 EntryPoint, int32 Temp_int_Variable, bool Temp_bool_Variable, TDelegate<void(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum)> K2Node_CreateDelegate_OutputDelegate, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_1, bool CallFunc_IsDedicatedServer_ReturnValue, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_2, bool CallFunc_IsDedicatedServer_ReturnValue_1, bool Temp_bool_Variable_1, bool CallFunc_HasAuthority_ReturnValue, class UParticleSystemComponent* CallFunc_SpawnEmitterAttached_ReturnValue, const struct FTransform& CallFunc_K2_GetComponentToWorld_ReturnValue, const struct FVector& CallFunc_BreakTransform_Location, const struct FRotator& CallFunc_BreakTransform_Rotation, const struct FVector& CallFunc_BreakTransform_Scale, class UAudioComponent* CallFunc_SpawnSoundAttached_ReturnValue, class UAudioComponent* CallFunc_SpawnSoundAttached_ReturnValue_1, bool CallFunc_IsValid_ReturnValue, const struct FRotator& CallFunc_K2_GetComponentRotation_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, float CallFunc_BreakRotator_Roll, float CallFunc_BreakRotator_Pitch, float CallFunc_BreakRotator_Yaw, const struct FRotator& CallFunc_MakeRotator_ReturnValue, bool CallFunc_IsLocallyControlled_ReturnValue, const struct FHitResult& CallFunc_K2_SetWorldRotation_SweepHitResult, bool Temp_bool_Option_B___If_false__use_Option_A_Variable, class UParticleSystem* K2Node_Select_Default, class UParticleSystemComponent* CallFunc_SpawnEmitterAtLocation_ReturnValue, class AActor* K2Node_CustomEvent_DamagedActor, float K2Node_CustomEvent_Damage, class AController* K2Node_CustomEvent_InstigatedBy, class AActor* K2Node_CustomEvent_DamageCauser, const struct FVector& K2Node_CustomEvent_HitLocation, class UPrimitiveComponent* K2Node_CustomEvent_FHitComponent, class FName K2Node_CustomEvent_BoneName, const struct FVector& K2Node_CustomEvent_Momentum, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, TArray<EFortTeamAffiliation>& K2Node_MakeArray_Array, uint8 CallFunc_GetActorTeam_ReturnValue, class AFortAthenaZiplineBase* K2Node_CustomEvent_Zipline, const struct FVector& K2Node_CustomEvent_DesiredZiplineOffset, const struct FVector& CallFunc_Add_VectorVector_ReturnValue, class ABP_Athena_Environmental_ZipLine_C* K2Node_DynamicCast_AsBP_Athena_Environmental_Zip_Line, bool K2Node_DynamicCast_bSuccess, class ABP_Athena_Environmental_ZipLine_Spline_C* K2Node_DynamicCast_AsBP_Athena_Environmental_Zip_Line_Spline, bool K2Node_DynamicCast_bSuccess_1, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue, const struct FHitResult& CallFunc_K2_AddRelativeLocation_SweepHitResult, const struct FVector& CallFunc_Normal_ReturnValue, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue, int32 Temp_int_Variable_1, int32 K2Node_Select_Default_1, const struct FRotator& CallFunc_MakeRotFromZ_ReturnValue, float CallFunc_BreakRotator_Roll_1, float CallFunc_BreakRotator_Pitch_1, float CallFunc_BreakRotator_Yaw_1, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue_1, float CallFunc_Subtract_FloatFloat_ReturnValue, const struct FRotator& CallFunc_MakeRotator_ReturnValue_1, const struct FHitResult& CallFunc_K2_SetRelativeRotation_SweepHitResult, const struct FVector& CallFunc_FindDirectionClosestToWorldLocation_ReturnValue);
	void UpdateMotorToSpline();
	void RotateToZiplineDirection();
	void OrientMotorForZipline(class AFortAthenaZiplineBase* Zipline, const struct FVector& DesiredZiplineOffset);
	void Chime_Visual();
	void HandleOnDied(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void ReceiveDestroyed();
	void Stop_Travel_Audio();
	void Start_Travel_Audio();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ZipLine_Athena_Harness_C">();
	}
	static class ABP_ZipLine_Athena_Harness_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ZipLine_Athena_Harness_C>();
	}
};
static_assert(alignof(ABP_ZipLine_Athena_Harness_C) == 0x000008, "Wrong alinment on ABP_ZipLine_Athena_Harness_C");
static_assert(sizeof(ABP_ZipLine_Athena_Harness_C) == 0x0002D8, "Wrong size on ABP_ZipLine_Athena_Harness_C");
static_assert(offsetof(ABP_ZipLine_Athena_Harness_C, UberGraphFrame) == 0x000220, "Member 'ABP_ZipLine_Athena_Harness_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ZipLine_Athena_Harness_C, TravelAudio) == 0x000228, "Member 'ABP_ZipLine_Athena_Harness_C::TravelAudio' has a wrong offset!");
static_assert(offsetof(ABP_ZipLine_Athena_Harness_C, P_Zipline_AttachedToPlayer) == 0x000230, "Member 'ABP_ZipLine_Athena_Harness_C::P_Zipline_AttachedToPlayer' has a wrong offset!");
static_assert(offsetof(ABP_ZipLine_Athena_Harness_C, SM_Zipline_Magnet) == 0x000238, "Member 'ABP_ZipLine_Athena_Harness_C::SM_Zipline_Magnet' has a wrong offset!");
static_assert(offsetof(ABP_ZipLine_Athena_Harness_C, Arrow) == 0x000240, "Member 'ABP_ZipLine_Athena_Harness_C::Arrow' has a wrong offset!");
static_assert(offsetof(ABP_ZipLine_Athena_Harness_C, P_Zipline_Pulley_SpeedLines) == 0x000248, "Member 'ABP_ZipLine_Athena_Harness_C::P_Zipline_Pulley_SpeedLines' has a wrong offset!");
static_assert(offsetof(ABP_ZipLine_Athena_Harness_C, SM_Zipline_Motor) == 0x000250, "Member 'ABP_ZipLine_Athena_Harness_C::SM_Zipline_Motor' has a wrong offset!");
static_assert(offsetof(ABP_ZipLine_Athena_Harness_C, Scene) == 0x000258, "Member 'ABP_ZipLine_Athena_Harness_C::Scene' has a wrong offset!");
static_assert(offsetof(ABP_ZipLine_Athena_Harness_C, SpawnFX) == 0x000260, "Member 'ABP_ZipLine_Athena_Harness_C::SpawnFX' has a wrong offset!");
static_assert(offsetof(ABP_ZipLine_Athena_Harness_C, DestroyFX) == 0x000268, "Member 'ABP_ZipLine_Athena_Harness_C::DestroyFX' has a wrong offset!");
static_assert(offsetof(ABP_ZipLine_Athena_Harness_C, CollideDestroyVFX) == 0x000270, "Member 'ABP_ZipLine_Athena_Harness_C::CollideDestroyVFX' has a wrong offset!");
static_assert(offsetof(ABP_ZipLine_Athena_Harness_C, SpawnSound) == 0x000278, "Member 'ABP_ZipLine_Athena_Harness_C::SpawnSound' has a wrong offset!");
static_assert(offsetof(ABP_ZipLine_Athena_Harness_C, UnSpawnSound) == 0x000280, "Member 'ABP_ZipLine_Athena_Harness_C::UnSpawnSound' has a wrong offset!");
static_assert(offsetof(ABP_ZipLine_Athena_Harness_C, CurrentAttachDetachSound) == 0x000288, "Member 'ABP_ZipLine_Athena_Harness_C::CurrentAttachDetachSound' has a wrong offset!");
static_assert(offsetof(ABP_ZipLine_Athena_Harness_C, AttachedPlayer) == 0x000290, "Member 'ABP_ZipLine_Athena_Harness_C::AttachedPlayer' has a wrong offset!");
static_assert(offsetof(ABP_ZipLine_Athena_Harness_C, HasHitAnotherPlayer) == 0x000298, "Member 'ABP_ZipLine_Athena_Harness_C::HasHitAnotherPlayer' has a wrong offset!");
static_assert(offsetof(ABP_ZipLine_Athena_Harness_C, ZiplineChimeVisualUpdate) == 0x00029C, "Member 'ABP_ZipLine_Athena_Harness_C::ZiplineChimeVisualUpdate' has a wrong offset!");
static_assert(offsetof(ABP_ZipLine_Athena_Harness_C, ChimeTimer) == 0x0002A0, "Member 'ABP_ZipLine_Athena_Harness_C::ChimeTimer' has a wrong offset!");
static_assert(offsetof(ABP_ZipLine_Athena_Harness_C, ZiplineDirection) == 0x0002A8, "Member 'ABP_ZipLine_Athena_Harness_C::ZiplineDirection' has a wrong offset!");
static_assert(offsetof(ABP_ZipLine_Athena_Harness_C, NewVar_0) == 0x0002B8, "Member 'ABP_ZipLine_Athena_Harness_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(ABP_ZipLine_Athena_Harness_C, EnvZiplineSpline) == 0x0002C0, "Member 'ABP_ZipLine_Athena_Harness_C::EnvZiplineSpline' has a wrong offset!");
static_assert(offsetof(ABP_ZipLine_Athena_Harness_C, SplineRotationUpdateSeconds) == 0x0002C8, "Member 'ABP_ZipLine_Athena_Harness_C::SplineRotationUpdateSeconds' has a wrong offset!");
static_assert(offsetof(ABP_ZipLine_Athena_Harness_C, MotorUpdateTimer) == 0x0002D0, "Member 'ABP_ZipLine_Athena_Harness_C::MotorUpdateTimer' has a wrong offset!");

}

