#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bucket_Old_Gadget_Skeleton_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Bucket_Old_Gadget_Skeleton_AnimBP.Bucket_Old_Gadget_Skeleton_AnimBP_C
// 0x0870 (0x0D70 - 0x0500)
class UBucket_Old_Gadget_Skeleton_AnimBP_C final  : public UCustomCharacterPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0500(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimInstanceSubsystemData             AnimBlueprintClassSubsystem_PropertyAccess;        // 0x0508(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_593B[0x7];                                     // 0x0509(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x0510(0x0660)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0B70(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0B90(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_SubInput;                            // 0x0BB0(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0C38(0x0030)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0C68(0x0108)()

public:
	void ExecuteUbergraph_Bucket_Old_Gadget_Skeleton_AnimBP(int32 EntryPoint);
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Bucket_Old_Gadget_Skeleton_AnimBP_C">();
	}
	static class UBucket_Old_Gadget_Skeleton_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBucket_Old_Gadget_Skeleton_AnimBP_C>();
	}
};
static_assert(alignof(UBucket_Old_Gadget_Skeleton_AnimBP_C) == 0x000010, "Wrong alinment on UBucket_Old_Gadget_Skeleton_AnimBP_C");
static_assert(sizeof(UBucket_Old_Gadget_Skeleton_AnimBP_C) == 0x000D70, "Wrong size on UBucket_Old_Gadget_Skeleton_AnimBP_C");
static_assert(offsetof(UBucket_Old_Gadget_Skeleton_AnimBP_C, UberGraphFrame) == 0x000500, "Member 'UBucket_Old_Gadget_Skeleton_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBucket_Old_Gadget_Skeleton_AnimBP_C, AnimBlueprintClassSubsystem_PropertyAccess) == 0x000508, "Member 'UBucket_Old_Gadget_Skeleton_AnimBP_C::AnimBlueprintClassSubsystem_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UBucket_Old_Gadget_Skeleton_AnimBP_C, AnimGraphNode_RigidBody) == 0x000510, "Member 'UBucket_Old_Gadget_Skeleton_AnimBP_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UBucket_Old_Gadget_Skeleton_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x000B70, "Member 'UBucket_Old_Gadget_Skeleton_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UBucket_Old_Gadget_Skeleton_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x000B90, "Member 'UBucket_Old_Gadget_Skeleton_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UBucket_Old_Gadget_Skeleton_AnimBP_C, AnimGraphNode_SubInput) == 0x000BB0, "Member 'UBucket_Old_Gadget_Skeleton_AnimBP_C::AnimGraphNode_SubInput' has a wrong offset!");
static_assert(offsetof(UBucket_Old_Gadget_Skeleton_AnimBP_C, AnimGraphNode_Root) == 0x000C38, "Member 'UBucket_Old_Gadget_Skeleton_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UBucket_Old_Gadget_Skeleton_AnimBP_C, AnimGraphNode_ModifyBone) == 0x000C68, "Member 'UBucket_Old_Gadget_Skeleton_AnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");

}

