#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChatContainer

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ChatContainer.ChatContainer_C
// 0x0080 (0x0380 - 0x0300)
class UChatContainer_C final  : public UFortChatContainer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SizeAnimation;                                     // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeAnimation;                                     // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonBorder*                          ChatBorder;                                        // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorderBackground;                            // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      ConsoleChatShortcut;                               // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        CursorModeSwitcher;                                // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HBox_Messages;                                     // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               HBox_Tabs;                                         // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HudContentHBox;                                    // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidget_C*                       KeybindWidget;                                     // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_ChatSize;                                  // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_ConsoleButtonSpaceProvider;                // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_SendButton;                               // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Disabled;                                     // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EUMGSequencePlayMode                          NewVar_0;                                          // 0x0378(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CurrentlyUsingGamepad;                             // 0x0379(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          AnimationClosing;                                  // 0x037A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void FocusChat();
	void SetChatBoxStyle(ESubGame Temp_byte_Variable, class UMaterialInterface* Temp_object_Variable, class UMaterialInterface* Temp_object_Variable_1, class UMaterialInterface* Temp_object_Variable_2, class UMaterialInterface* Temp_object_Variable_3, class UMaterialInterface* Temp_object_Variable_4, ESubGame CallFunc_GetCurrentSubGame_ReturnValue, class UMaterialInterface* K2Node_Select_Default);
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent, const struct FEventReply& CallFunc_Handled_ReturnValue, const struct FKey& CallFunc_GetKey_ReturnValue, bool CallFunc_EqualEqual_KeyKey_ReturnValue, const struct FEventReply& CallFunc_Unhandled_ReturnValue);
	void HandleChatOpenChanged(bool bChatShouldBeOpen, bool NewLocalVar_0, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, bool Temp_bool_Variable, ESlateVisibility Temp_byte_Variable_2, ESlateVisibility Temp_byte_Variable_3, bool Temp_bool_Variable_1, EUMGSequencePlayMode Temp_byte_Variable_4, ESlateVisibility K2Node_Select_Default, EUMGSequencePlayMode Temp_byte_Variable_5, bool Temp_bool_Variable_2, EUMGSequencePlayMode Temp_byte_Variable_6, EUMGSequencePlayMode Temp_byte_Variable_7, bool CallFunc_IsTextChatRestricted_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, EUMGSequencePlayMode K2Node_Select_Default_1, EUMGSequencePlayMode K2Node_Select_Default_2, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue, bool Temp_bool_Variable_3, bool CallFunc_IsAnimationPlaying_ReturnValue, ESlateVisibility K2Node_Select_Default_3, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue_1, bool CallFunc_IsAnimationPlaying_ReturnValue_1);
	void OnSizeAnimationComplete();
	void HandleCursorModeChanged(bool bEnabled, class FName ActionName, class UUserWidget* Widget, bool Temp_bool_Variable, class UWidget* K2Node_Select_Default);
	void OnChatOpenChanged(bool bShouldBeOpen);
	void OnSendButtonDisplayChanged(bool bShowSendButton);
	void Construct();
	void BndEvt__ConsoleChatShortcut_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void Destruct();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void ExecuteUbergraph_ChatContainer(int32 EntryPoint, class UFortHUDContext* CallFunc_GetContext_ReturnValue, bool Temp_bool_Variable, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, class UFortGlobalUIContext* CallFunc_GetContext_ReturnValue_1, bool K2Node_Event_bShouldBeOpen, bool CallFunc_IsUsingGamepad_ReturnValue, bool K2Node_Event_bShowSendButton, ESlateVisibility K2Node_Select_Default, bool Temp_bool_Variable_1, class UFortHUDContext* CallFunc_GetContext_ReturnValue_2, TDelegate<void(bool bCursorModeEnabled, class FName ActionName, class UUserWidget* CursorModeContentWidget)> K2Node_CreateDelegate_OutputDelegate, class UCommonButton* K2Node_ComponentBoundEvent_Button, class UWidget* K2Node_Select_Default_1, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_1, class UFortGlobalUIContext* CallFunc_GetContext_ReturnValue_3, bool CallFunc_IsInZone_ReturnValue, bool Temp_bool_Variable_2, class UFortHUDContext* CallFunc_GetContext_ReturnValue_4, bool CallFunc_IsInCursorMode_ReturnValue, const struct FGeometry& K2Node_Event_MyGeometry, float K2Node_Event_InDeltaTime, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, class UWidget* K2Node_Select_Default_2);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ChatContainer_C">();
	}
	static class UChatContainer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChatContainer_C>();
	}
};
static_assert(alignof(UChatContainer_C) == 0x000008, "Wrong alinment on UChatContainer_C");
static_assert(sizeof(UChatContainer_C) == 0x000380, "Wrong size on UChatContainer_C");
static_assert(offsetof(UChatContainer_C, UberGraphFrame) == 0x000300, "Member 'UChatContainer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, SizeAnimation) == 0x000308, "Member 'UChatContainer_C::SizeAnimation' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, FadeAnimation) == 0x000310, "Member 'UChatContainer_C::FadeAnimation' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, ChatBorder) == 0x000318, "Member 'UChatContainer_C::ChatBorder' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, CommonBorderBackground) == 0x000320, "Member 'UChatContainer_C::CommonBorderBackground' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, ConsoleChatShortcut) == 0x000328, "Member 'UChatContainer_C::ConsoleChatShortcut' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, CursorModeSwitcher) == 0x000330, "Member 'UChatContainer_C::CursorModeSwitcher' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, HBox_Messages) == 0x000338, "Member 'UChatContainer_C::HBox_Messages' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, HBox_Tabs) == 0x000340, "Member 'UChatContainer_C::HBox_Tabs' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, HudContentHBox) == 0x000348, "Member 'UChatContainer_C::HudContentHBox' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, KeybindWidget) == 0x000350, "Member 'UChatContainer_C::KeybindWidget' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, SizeBox_ChatSize) == 0x000358, "Member 'UChatContainer_C::SizeBox_ChatSize' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, SizeBox_ConsoleButtonSpaceProvider) == 0x000360, "Member 'UChatContainer_C::SizeBox_ConsoleButtonSpaceProvider' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, Switcher_SendButton) == 0x000368, "Member 'UChatContainer_C::Switcher_SendButton' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, Text_Disabled) == 0x000370, "Member 'UChatContainer_C::Text_Disabled' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, NewVar_0) == 0x000378, "Member 'UChatContainer_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, CurrentlyUsingGamepad) == 0x000379, "Member 'UChatContainer_C::CurrentlyUsingGamepad' has a wrong offset!");
static_assert(offsetof(UChatContainer_C, AnimationClosing) == 0x00037A, "Member 'UChatContainer_C::AnimationClosing' has a wrong offset!");

}

