#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CinematicMinusTeamMics

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Cinematic-TeamMics.Cinematic-TeamMics_C
// 0x0228 (0x04B0 - 0x0288)
class UCinematicMinusTeamMics_C final  : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0288(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UMicIndicator_C*                        MicIndicator;                                      // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  SwitcherConnectingStranger;                        // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextBlock_6;                                       // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextPlayerName;                                    // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FFortTeamMemberInfo                    MemberInfo;                                        // 0x02B0(0x0200)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CinematicMinusTeamMics(int32 EntryPoint);
	void Construct();
	void Update(const struct FFortTeamMemberInfo& UpdatedMemberInfo, const struct FUniqueNetIdRepl& PlayerNetId, bool Temp_bool_Variable, bool Temp_bool_Variable_1, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, bool Temp_bool_Variable_2, int32 Temp_int_Variable, int32 Temp_int_Variable_1, class UFortPartyContext* CallFunc_GetContext_ReturnValue, bool CallFunc_IsValid_ReturnValue, ESlateVisibility K2Node_Select_Default, int32 K2Node_Select_Default_1, bool CallFunc_IsNetIdFromLocalPlayersPlatform_ReturnValue, struct FUniqueNetIdRepl& K2Node_Select_Default_2);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Cinematic-TeamMics_C">();
	}
	static class UCinematicMinusTeamMics_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCinematicMinusTeamMics_C>();
	}
};
static_assert(alignof(UCinematicMinusTeamMics_C) == 0x000008, "Wrong alinment on UCinematicMinusTeamMics_C");
static_assert(sizeof(UCinematicMinusTeamMics_C) == 0x0004B0, "Wrong size on UCinematicMinusTeamMics_C");
static_assert(offsetof(UCinematicMinusTeamMics_C, UberGraphFrame) == 0x000288, "Member 'UCinematicMinusTeamMics_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCinematicMinusTeamMics_C, MicIndicator) == 0x000290, "Member 'UCinematicMinusTeamMics_C::MicIndicator' has a wrong offset!");
static_assert(offsetof(UCinematicMinusTeamMics_C, SwitcherConnectingStranger) == 0x000298, "Member 'UCinematicMinusTeamMics_C::SwitcherConnectingStranger' has a wrong offset!");
static_assert(offsetof(UCinematicMinusTeamMics_C, TextBlock_6) == 0x0002A0, "Member 'UCinematicMinusTeamMics_C::TextBlock_6' has a wrong offset!");
static_assert(offsetof(UCinematicMinusTeamMics_C, TextPlayerName) == 0x0002A8, "Member 'UCinematicMinusTeamMics_C::TextPlayerName' has a wrong offset!");
static_assert(offsetof(UCinematicMinusTeamMics_C, MemberInfo) == 0x0002B0, "Member 'UCinematicMinusTeamMics_C::MemberInfo' has a wrong offset!");

}

