#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Com_ThanksForVotingMessage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Com_ThanksForVotingMessage.Com_ThanksForVotingMessage_C
// 0x0040 (0x0318 - 0x02D8)
class UCom_ThanksForVotingMessage_C final  : public UFortCommunityVotingThanksPopup
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ThanksMessage;                                     // 0x02E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonBorder*                          Border_TapToCloseZone;                             // 0x02E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 box_middle;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   RichTextBlock_CountDowntxt;                        // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ThanksMessageBlocker;                              // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Triangle1;                                         // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Triangle2;                                         // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	struct FEventReply TapToClose(const struct FGeometry& MyGeometry, struct FPointerEvent& MouseEvent, const struct FKey& CallFunc_PointerEvent_GetEffectingButton_ReturnValue, bool CallFunc_PointerEvent_IsTouchEvent_ReturnValue, bool CallFunc_EqualEqual_KeyKey_ReturnValue, bool Temp_bool_Variable, bool CallFunc_BooleanOR_ReturnValue, const struct FEventReply& CallFunc_Handled_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, const struct FEventReply& CallFunc_Unhandled_ReturnValue, const struct FEventReply& K2Node_Select_Default);
	void FadeOutPopup();
	void FadeInPopup();
	void ExecuteUbergraph_Com_ThanksForVotingMessage(int32 EntryPoint, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, class UUMGSequencePlayer* CallFunc_PlayAnimationReverse_ReturnValue, class UUMGSequencePlayer* CallFunc_PlayAnimationForward_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Com_ThanksForVotingMessage_C">();
	}
	static class UCom_ThanksForVotingMessage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCom_ThanksForVotingMessage_C>();
	}
};
static_assert(alignof(UCom_ThanksForVotingMessage_C) == 0x000008, "Wrong alinment on UCom_ThanksForVotingMessage_C");
static_assert(sizeof(UCom_ThanksForVotingMessage_C) == 0x000318, "Wrong size on UCom_ThanksForVotingMessage_C");
static_assert(offsetof(UCom_ThanksForVotingMessage_C, UberGraphFrame) == 0x0002D8, "Member 'UCom_ThanksForVotingMessage_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCom_ThanksForVotingMessage_C, ThanksMessage) == 0x0002E0, "Member 'UCom_ThanksForVotingMessage_C::ThanksMessage' has a wrong offset!");
static_assert(offsetof(UCom_ThanksForVotingMessage_C, Border_TapToCloseZone) == 0x0002E8, "Member 'UCom_ThanksForVotingMessage_C::Border_TapToCloseZone' has a wrong offset!");
static_assert(offsetof(UCom_ThanksForVotingMessage_C, box_middle) == 0x0002F0, "Member 'UCom_ThanksForVotingMessage_C::box_middle' has a wrong offset!");
static_assert(offsetof(UCom_ThanksForVotingMessage_C, RichTextBlock_CountDowntxt) == 0x0002F8, "Member 'UCom_ThanksForVotingMessage_C::RichTextBlock_CountDowntxt' has a wrong offset!");
static_assert(offsetof(UCom_ThanksForVotingMessage_C, ThanksMessageBlocker) == 0x000300, "Member 'UCom_ThanksForVotingMessage_C::ThanksMessageBlocker' has a wrong offset!");
static_assert(offsetof(UCom_ThanksForVotingMessage_C, Triangle1) == 0x000308, "Member 'UCom_ThanksForVotingMessage_C::Triangle1' has a wrong offset!");
static_assert(offsetof(UCom_ThanksForVotingMessage_C, Triangle2) == 0x000310, "Member 'UCom_ThanksForVotingMessage_C::Triangle2' has a wrong offset!");

}

