#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Core_ObjectArrayHelper

#include "Basic.hpp"


namespace SDK::Params
{

// Function Core_ObjectArrayHelper.ObjectArrayHelper.append
// 0x0028 (0x0028 - 0x0000)
struct ObjectArrayHelper_Append final 
{
public:
	TArray<class UObject*>                        __verse_0xCB49F730_source;                         // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	class UObject*                                __verse_0x6D138456_objectToAdd;                    // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UObject*>                        RetVal;                                            // 0x0018(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(ObjectArrayHelper_Append) == 0x000008, "Wrong alinment on ObjectArrayHelper_Append");
static_assert(sizeof(ObjectArrayHelper_Append) == 0x000028, "Wrong size on ObjectArrayHelper_Append");
static_assert(offsetof(ObjectArrayHelper_Append, __verse_0xCB49F730_source) == 0x000000, "Member 'ObjectArrayHelper_Append::__verse_0xCB49F730_source' has a wrong offset!");
static_assert(offsetof(ObjectArrayHelper_Append, __verse_0x6D138456_objectToAdd) == 0x000010, "Member 'ObjectArrayHelper_Append::__verse_0x6D138456_objectToAdd' has a wrong offset!");
static_assert(offsetof(ObjectArrayHelper_Append, RetVal) == 0x000018, "Member 'ObjectArrayHelper_Append::RetVal' has a wrong offset!");

// Function Core_ObjectArrayHelper.ObjectArrayHelper.Insert
// 0x0030 (0x0030 - 0x0000)
struct ObjectArrayHelper_Insert final 
{
public:
	TArray<class UObject*>                        __verse_0xCB49F730_source;                         // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	class UObject*                                __verse_0x91788530_objectToInsert;                 // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __verse_0x22C695FC_insertionIndex;                 // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_656E[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        RetVal;                                            // 0x0020(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(ObjectArrayHelper_Insert) == 0x000008, "Wrong alinment on ObjectArrayHelper_Insert");
static_assert(sizeof(ObjectArrayHelper_Insert) == 0x000030, "Wrong size on ObjectArrayHelper_Insert");
static_assert(offsetof(ObjectArrayHelper_Insert, __verse_0xCB49F730_source) == 0x000000, "Member 'ObjectArrayHelper_Insert::__verse_0xCB49F730_source' has a wrong offset!");
static_assert(offsetof(ObjectArrayHelper_Insert, __verse_0x91788530_objectToInsert) == 0x000010, "Member 'ObjectArrayHelper_Insert::__verse_0x91788530_objectToInsert' has a wrong offset!");
static_assert(offsetof(ObjectArrayHelper_Insert, __verse_0x22C695FC_insertionIndex) == 0x000018, "Member 'ObjectArrayHelper_Insert::__verse_0x22C695FC_insertionIndex' has a wrong offset!");
static_assert(offsetof(ObjectArrayHelper_Insert, RetVal) == 0x000020, "Member 'ObjectArrayHelper_Insert::RetVal' has a wrong offset!");

// Function Core_ObjectArrayHelper.ObjectArrayHelper.popBack
// 0x0020 (0x0020 - 0x0000)
struct ObjectArrayHelper_PopBack final 
{
public:
	TArray<class UObject*>                        __verse_0xCB49F730_source;                         // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	TArray<class UObject*>                        RetVal;                                            // 0x0010(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(ObjectArrayHelper_PopBack) == 0x000008, "Wrong alinment on ObjectArrayHelper_PopBack");
static_assert(sizeof(ObjectArrayHelper_PopBack) == 0x000020, "Wrong size on ObjectArrayHelper_PopBack");
static_assert(offsetof(ObjectArrayHelper_PopBack, __verse_0xCB49F730_source) == 0x000000, "Member 'ObjectArrayHelper_PopBack::__verse_0xCB49F730_source' has a wrong offset!");
static_assert(offsetof(ObjectArrayHelper_PopBack, RetVal) == 0x000010, "Member 'ObjectArrayHelper_PopBack::RetVal' has a wrong offset!");

// Function Core_ObjectArrayHelper.ObjectArrayHelper.popFront
// 0x0020 (0x0020 - 0x0000)
struct ObjectArrayHelper_PopFront final 
{
public:
	TArray<class UObject*>                        __verse_0xCB49F730_source;                         // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	TArray<class UObject*>                        RetVal;                                            // 0x0010(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(ObjectArrayHelper_PopFront) == 0x000008, "Wrong alinment on ObjectArrayHelper_PopFront");
static_assert(sizeof(ObjectArrayHelper_PopFront) == 0x000020, "Wrong size on ObjectArrayHelper_PopFront");
static_assert(offsetof(ObjectArrayHelper_PopFront, __verse_0xCB49F730_source) == 0x000000, "Member 'ObjectArrayHelper_PopFront::__verse_0xCB49F730_source' has a wrong offset!");
static_assert(offsetof(ObjectArrayHelper_PopFront, RetVal) == 0x000010, "Member 'ObjectArrayHelper_PopFront::RetVal' has a wrong offset!");

// Function Core_ObjectArrayHelper.ObjectArrayHelper.Pushback
// 0x0028 (0x0028 - 0x0000)
struct ObjectArrayHelper_Pushback final 
{
public:
	TArray<class UObject*>                        __verse_0xCB49F730_source;                         // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	class UObject*                                __verse_0x27AD917C_objectToPush;                   // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UObject*>                        RetVal;                                            // 0x0018(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(ObjectArrayHelper_Pushback) == 0x000008, "Wrong alinment on ObjectArrayHelper_Pushback");
static_assert(sizeof(ObjectArrayHelper_Pushback) == 0x000028, "Wrong size on ObjectArrayHelper_Pushback");
static_assert(offsetof(ObjectArrayHelper_Pushback, __verse_0xCB49F730_source) == 0x000000, "Member 'ObjectArrayHelper_Pushback::__verse_0xCB49F730_source' has a wrong offset!");
static_assert(offsetof(ObjectArrayHelper_Pushback, __verse_0x27AD917C_objectToPush) == 0x000010, "Member 'ObjectArrayHelper_Pushback::__verse_0x27AD917C_objectToPush' has a wrong offset!");
static_assert(offsetof(ObjectArrayHelper_Pushback, RetVal) == 0x000018, "Member 'ObjectArrayHelper_Pushback::RetVal' has a wrong offset!");

// Function Core_ObjectArrayHelper.ObjectArrayHelper.pushFront
// 0x0028 (0x0028 - 0x0000)
struct ObjectArrayHelper_PushFront final 
{
public:
	TArray<class UObject*>                        __verse_0xCB49F730_source;                         // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	class UObject*                                __verse_0x27AD917C_objectToPush;                   // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UObject*>                        RetVal;                                            // 0x0018(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(ObjectArrayHelper_PushFront) == 0x000008, "Wrong alinment on ObjectArrayHelper_PushFront");
static_assert(sizeof(ObjectArrayHelper_PushFront) == 0x000028, "Wrong size on ObjectArrayHelper_PushFront");
static_assert(offsetof(ObjectArrayHelper_PushFront, __verse_0xCB49F730_source) == 0x000000, "Member 'ObjectArrayHelper_PushFront::__verse_0xCB49F730_source' has a wrong offset!");
static_assert(offsetof(ObjectArrayHelper_PushFront, __verse_0x27AD917C_objectToPush) == 0x000010, "Member 'ObjectArrayHelper_PushFront::__verse_0x27AD917C_objectToPush' has a wrong offset!");
static_assert(offsetof(ObjectArrayHelper_PushFront, RetVal) == 0x000018, "Member 'ObjectArrayHelper_PushFront::RetVal' has a wrong offset!");

// Function Core_ObjectArrayHelper.ObjectArrayHelper.randomize
// 0x0020 (0x0020 - 0x0000)
struct ObjectArrayHelper_Randomize final 
{
public:
	TArray<class UObject*>                        __verse_0xCB49F730_source;                         // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	TArray<class UObject*>                        RetVal;                                            // 0x0010(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(ObjectArrayHelper_Randomize) == 0x000008, "Wrong alinment on ObjectArrayHelper_Randomize");
static_assert(sizeof(ObjectArrayHelper_Randomize) == 0x000020, "Wrong size on ObjectArrayHelper_Randomize");
static_assert(offsetof(ObjectArrayHelper_Randomize, __verse_0xCB49F730_source) == 0x000000, "Member 'ObjectArrayHelper_Randomize::__verse_0xCB49F730_source' has a wrong offset!");
static_assert(offsetof(ObjectArrayHelper_Randomize, RetVal) == 0x000010, "Member 'ObjectArrayHelper_Randomize::RetVal' has a wrong offset!");

// Function Core_ObjectArrayHelper.ObjectArrayHelper.Remove
// 0x0028 (0x0028 - 0x0000)
struct ObjectArrayHelper_Remove final 
{
public:
	TArray<class UObject*>                        __verse_0xCB49F730_source;                         // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	class UObject*                                __verse_0x1617F2B7_objectToRemove;                 // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UObject*>                        RetVal;                                            // 0x0018(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(ObjectArrayHelper_Remove) == 0x000008, "Wrong alinment on ObjectArrayHelper_Remove");
static_assert(sizeof(ObjectArrayHelper_Remove) == 0x000028, "Wrong size on ObjectArrayHelper_Remove");
static_assert(offsetof(ObjectArrayHelper_Remove, __verse_0xCB49F730_source) == 0x000000, "Member 'ObjectArrayHelper_Remove::__verse_0xCB49F730_source' has a wrong offset!");
static_assert(offsetof(ObjectArrayHelper_Remove, __verse_0x1617F2B7_objectToRemove) == 0x000010, "Member 'ObjectArrayHelper_Remove::__verse_0x1617F2B7_objectToRemove' has a wrong offset!");
static_assert(offsetof(ObjectArrayHelper_Remove, RetVal) == 0x000018, "Member 'ObjectArrayHelper_Remove::RetVal' has a wrong offset!");

// Function Core_ObjectArrayHelper.ObjectArrayHelper.RemoveAt
// 0x0028 (0x0028 - 0x0000)
struct ObjectArrayHelper_RemoveAt final 
{
public:
	TArray<class UObject*>                        __verse_0xCB49F730_source;                         // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	int32                                         __verse_0x9229249B_indexToRemove;                  // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_656F[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        RetVal;                                            // 0x0018(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(ObjectArrayHelper_RemoveAt) == 0x000008, "Wrong alinment on ObjectArrayHelper_RemoveAt");
static_assert(sizeof(ObjectArrayHelper_RemoveAt) == 0x000028, "Wrong size on ObjectArrayHelper_RemoveAt");
static_assert(offsetof(ObjectArrayHelper_RemoveAt, __verse_0xCB49F730_source) == 0x000000, "Member 'ObjectArrayHelper_RemoveAt::__verse_0xCB49F730_source' has a wrong offset!");
static_assert(offsetof(ObjectArrayHelper_RemoveAt, __verse_0x9229249B_indexToRemove) == 0x000010, "Member 'ObjectArrayHelper_RemoveAt::__verse_0x9229249B_indexToRemove' has a wrong offset!");
static_assert(offsetof(ObjectArrayHelper_RemoveAt, RetVal) == 0x000018, "Member 'ObjectArrayHelper_RemoveAt::RetVal' has a wrong offset!");

}

