#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Core_ComponentArrayHelper

#include "Basic.hpp"


namespace SDK::Params
{

// Function Core_ComponentArrayHelper.ComponentArrayHelper.append
// 0x0028 (0x0028 - 0x0000)
struct ComponentArrayHelper_Append final 
{
public:
	TArray<class UEntityComponent*>               __verse_0xCB49F730_source;                         // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	class UEntityComponent*                       __verse_0x5E60FB05_ComponentToAdd;                 // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UEntityComponent*>               RetVal;                                            // 0x0018(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(ComponentArrayHelper_Append) == 0x000008, "Wrong alinment on ComponentArrayHelper_Append");
static_assert(sizeof(ComponentArrayHelper_Append) == 0x000028, "Wrong size on ComponentArrayHelper_Append");
static_assert(offsetof(ComponentArrayHelper_Append, __verse_0xCB49F730_source) == 0x000000, "Member 'ComponentArrayHelper_Append::__verse_0xCB49F730_source' has a wrong offset!");
static_assert(offsetof(ComponentArrayHelper_Append, __verse_0x5E60FB05_ComponentToAdd) == 0x000010, "Member 'ComponentArrayHelper_Append::__verse_0x5E60FB05_ComponentToAdd' has a wrong offset!");
static_assert(offsetof(ComponentArrayHelper_Append, RetVal) == 0x000018, "Member 'ComponentArrayHelper_Append::RetVal' has a wrong offset!");

// Function Core_ComponentArrayHelper.ComponentArrayHelper.Insert
// 0x0030 (0x0030 - 0x0000)
struct ComponentArrayHelper_Insert final 
{
public:
	TArray<class UEntityComponent*>               __verse_0xCB49F730_source;                         // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	class UEntityComponent*                       __verse_0x310B6F78_ComponentToInsert;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __verse_0x22C695FC_insertionIndex;                 // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A64[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UEntityComponent*>               RetVal;                                            // 0x0020(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(ComponentArrayHelper_Insert) == 0x000008, "Wrong alinment on ComponentArrayHelper_Insert");
static_assert(sizeof(ComponentArrayHelper_Insert) == 0x000030, "Wrong size on ComponentArrayHelper_Insert");
static_assert(offsetof(ComponentArrayHelper_Insert, __verse_0xCB49F730_source) == 0x000000, "Member 'ComponentArrayHelper_Insert::__verse_0xCB49F730_source' has a wrong offset!");
static_assert(offsetof(ComponentArrayHelper_Insert, __verse_0x310B6F78_ComponentToInsert) == 0x000010, "Member 'ComponentArrayHelper_Insert::__verse_0x310B6F78_ComponentToInsert' has a wrong offset!");
static_assert(offsetof(ComponentArrayHelper_Insert, __verse_0x22C695FC_insertionIndex) == 0x000018, "Member 'ComponentArrayHelper_Insert::__verse_0x22C695FC_insertionIndex' has a wrong offset!");
static_assert(offsetof(ComponentArrayHelper_Insert, RetVal) == 0x000020, "Member 'ComponentArrayHelper_Insert::RetVal' has a wrong offset!");

// Function Core_ComponentArrayHelper.ComponentArrayHelper.popBack
// 0x0020 (0x0020 - 0x0000)
struct ComponentArrayHelper_PopBack final 
{
public:
	TArray<class UEntityComponent*>               __verse_0xCB49F730_source;                         // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	TArray<class UEntityComponent*>               RetVal;                                            // 0x0010(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(ComponentArrayHelper_PopBack) == 0x000008, "Wrong alinment on ComponentArrayHelper_PopBack");
static_assert(sizeof(ComponentArrayHelper_PopBack) == 0x000020, "Wrong size on ComponentArrayHelper_PopBack");
static_assert(offsetof(ComponentArrayHelper_PopBack, __verse_0xCB49F730_source) == 0x000000, "Member 'ComponentArrayHelper_PopBack::__verse_0xCB49F730_source' has a wrong offset!");
static_assert(offsetof(ComponentArrayHelper_PopBack, RetVal) == 0x000010, "Member 'ComponentArrayHelper_PopBack::RetVal' has a wrong offset!");

// Function Core_ComponentArrayHelper.ComponentArrayHelper.popFront
// 0x0020 (0x0020 - 0x0000)
struct ComponentArrayHelper_PopFront final 
{
public:
	TArray<class UEntityComponent*>               __verse_0xCB49F730_source;                         // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	TArray<class UEntityComponent*>               RetVal;                                            // 0x0010(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(ComponentArrayHelper_PopFront) == 0x000008, "Wrong alinment on ComponentArrayHelper_PopFront");
static_assert(sizeof(ComponentArrayHelper_PopFront) == 0x000020, "Wrong size on ComponentArrayHelper_PopFront");
static_assert(offsetof(ComponentArrayHelper_PopFront, __verse_0xCB49F730_source) == 0x000000, "Member 'ComponentArrayHelper_PopFront::__verse_0xCB49F730_source' has a wrong offset!");
static_assert(offsetof(ComponentArrayHelper_PopFront, RetVal) == 0x000010, "Member 'ComponentArrayHelper_PopFront::RetVal' has a wrong offset!");

// Function Core_ComponentArrayHelper.ComponentArrayHelper.Pushback
// 0x0028 (0x0028 - 0x0000)
struct ComponentArrayHelper_Pushback final 
{
public:
	TArray<class UEntityComponent*>               __verse_0xCB49F730_source;                         // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	class UEntityComponent*                       __verse_0x16497D92_ComponentToPush;                // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UEntityComponent*>               RetVal;                                            // 0x0018(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(ComponentArrayHelper_Pushback) == 0x000008, "Wrong alinment on ComponentArrayHelper_Pushback");
static_assert(sizeof(ComponentArrayHelper_Pushback) == 0x000028, "Wrong size on ComponentArrayHelper_Pushback");
static_assert(offsetof(ComponentArrayHelper_Pushback, __verse_0xCB49F730_source) == 0x000000, "Member 'ComponentArrayHelper_Pushback::__verse_0xCB49F730_source' has a wrong offset!");
static_assert(offsetof(ComponentArrayHelper_Pushback, __verse_0x16497D92_ComponentToPush) == 0x000010, "Member 'ComponentArrayHelper_Pushback::__verse_0x16497D92_ComponentToPush' has a wrong offset!");
static_assert(offsetof(ComponentArrayHelper_Pushback, RetVal) == 0x000018, "Member 'ComponentArrayHelper_Pushback::RetVal' has a wrong offset!");

// Function Core_ComponentArrayHelper.ComponentArrayHelper.pushFront
// 0x0028 (0x0028 - 0x0000)
struct ComponentArrayHelper_PushFront final 
{
public:
	TArray<class UEntityComponent*>               __verse_0xCB49F730_source;                         // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	class UEntityComponent*                       __verse_0x16497D92_ComponentToPush;                // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UEntityComponent*>               RetVal;                                            // 0x0018(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(ComponentArrayHelper_PushFront) == 0x000008, "Wrong alinment on ComponentArrayHelper_PushFront");
static_assert(sizeof(ComponentArrayHelper_PushFront) == 0x000028, "Wrong size on ComponentArrayHelper_PushFront");
static_assert(offsetof(ComponentArrayHelper_PushFront, __verse_0xCB49F730_source) == 0x000000, "Member 'ComponentArrayHelper_PushFront::__verse_0xCB49F730_source' has a wrong offset!");
static_assert(offsetof(ComponentArrayHelper_PushFront, __verse_0x16497D92_ComponentToPush) == 0x000010, "Member 'ComponentArrayHelper_PushFront::__verse_0x16497D92_ComponentToPush' has a wrong offset!");
static_assert(offsetof(ComponentArrayHelper_PushFront, RetVal) == 0x000018, "Member 'ComponentArrayHelper_PushFront::RetVal' has a wrong offset!");

// Function Core_ComponentArrayHelper.ComponentArrayHelper.randomize
// 0x0020 (0x0020 - 0x0000)
struct ComponentArrayHelper_Randomize final 
{
public:
	TArray<class UEntityComponent*>               __verse_0xCB49F730_source;                         // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	TArray<class UEntityComponent*>               RetVal;                                            // 0x0010(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(ComponentArrayHelper_Randomize) == 0x000008, "Wrong alinment on ComponentArrayHelper_Randomize");
static_assert(sizeof(ComponentArrayHelper_Randomize) == 0x000020, "Wrong size on ComponentArrayHelper_Randomize");
static_assert(offsetof(ComponentArrayHelper_Randomize, __verse_0xCB49F730_source) == 0x000000, "Member 'ComponentArrayHelper_Randomize::__verse_0xCB49F730_source' has a wrong offset!");
static_assert(offsetof(ComponentArrayHelper_Randomize, RetVal) == 0x000010, "Member 'ComponentArrayHelper_Randomize::RetVal' has a wrong offset!");

// Function Core_ComponentArrayHelper.ComponentArrayHelper.Remove
// 0x0028 (0x0028 - 0x0000)
struct ComponentArrayHelper_Remove final 
{
public:
	TArray<class UEntityComponent*>               __verse_0xCB49F730_source;                         // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	class UEntityComponent*                       __verse_0xB66418FF_ComponentToRemove;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UEntityComponent*>               RetVal;                                            // 0x0018(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(ComponentArrayHelper_Remove) == 0x000008, "Wrong alinment on ComponentArrayHelper_Remove");
static_assert(sizeof(ComponentArrayHelper_Remove) == 0x000028, "Wrong size on ComponentArrayHelper_Remove");
static_assert(offsetof(ComponentArrayHelper_Remove, __verse_0xCB49F730_source) == 0x000000, "Member 'ComponentArrayHelper_Remove::__verse_0xCB49F730_source' has a wrong offset!");
static_assert(offsetof(ComponentArrayHelper_Remove, __verse_0xB66418FF_ComponentToRemove) == 0x000010, "Member 'ComponentArrayHelper_Remove::__verse_0xB66418FF_ComponentToRemove' has a wrong offset!");
static_assert(offsetof(ComponentArrayHelper_Remove, RetVal) == 0x000018, "Member 'ComponentArrayHelper_Remove::RetVal' has a wrong offset!");

// Function Core_ComponentArrayHelper.ComponentArrayHelper.RemoveAt
// 0x0028 (0x0028 - 0x0000)
struct ComponentArrayHelper_RemoveAt final 
{
public:
	TArray<class UEntityComponent*>               __verse_0xCB49F730_source;                         // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	int32                                         __verse_0x9229249B_indexToRemove;                  // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A65[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UEntityComponent*>               RetVal;                                            // 0x0018(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(ComponentArrayHelper_RemoveAt) == 0x000008, "Wrong alinment on ComponentArrayHelper_RemoveAt");
static_assert(sizeof(ComponentArrayHelper_RemoveAt) == 0x000028, "Wrong size on ComponentArrayHelper_RemoveAt");
static_assert(offsetof(ComponentArrayHelper_RemoveAt, __verse_0xCB49F730_source) == 0x000000, "Member 'ComponentArrayHelper_RemoveAt::__verse_0xCB49F730_source' has a wrong offset!");
static_assert(offsetof(ComponentArrayHelper_RemoveAt, __verse_0x9229249B_indexToRemove) == 0x000010, "Member 'ComponentArrayHelper_RemoveAt::__verse_0x9229249B_indexToRemove' has a wrong offset!");
static_assert(offsetof(ComponentArrayHelper_RemoveAt, RetVal) == 0x000018, "Member 'ComponentArrayHelper_RemoveAt::RetVal' has a wrong offset!");

}

