#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CreativeLobbyAd

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CreativeLobbyAd.CreativeLobbyAd_C
// 0x0028 (0x0320 - 0x02F8)
class UCreativeLobbyAd_C final  : public UFortCreativeAdTile
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       Text_Description;                                  // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Header;                                       // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_SubHeader;                                    // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          Violator;                                          // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CreativeLobbyAd(int32 EntryPoint, bool Temp_bool_Variable, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, class FText CallFunc_Conv_StringToText_ReturnValue, class FText CallFunc_Conv_StringToText_ReturnValue_1, class FText CallFunc_TextToUpper_ReturnValue, class FText CallFunc_TextToUpper_ReturnValue_1, class FText CallFunc_Conv_StringToText_ReturnValue_2, bool CallFunc_TextIsEmpty_ReturnValue, class FText CallFunc_TextToUpper_ReturnValue_2, ESlateVisibility K2Node_Select_Default, bool K2Node_Event_IsDesignTime);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void OnCMSDataUpdated();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CreativeLobbyAd_C">();
	}
	static class UCreativeLobbyAd_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCreativeLobbyAd_C>();
	}
};
static_assert(alignof(UCreativeLobbyAd_C) == 0x000008, "Wrong alinment on UCreativeLobbyAd_C");
static_assert(sizeof(UCreativeLobbyAd_C) == 0x000320, "Wrong size on UCreativeLobbyAd_C");
static_assert(offsetof(UCreativeLobbyAd_C, UberGraphFrame) == 0x0002F8, "Member 'UCreativeLobbyAd_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCreativeLobbyAd_C, Text_Description) == 0x000300, "Member 'UCreativeLobbyAd_C::Text_Description' has a wrong offset!");
static_assert(offsetof(UCreativeLobbyAd_C, Text_Header) == 0x000308, "Member 'UCreativeLobbyAd_C::Text_Header' has a wrong offset!");
static_assert(offsetof(UCreativeLobbyAd_C, Text_SubHeader) == 0x000310, "Member 'UCreativeLobbyAd_C::Text_SubHeader' has a wrong offset!");
static_assert(offsetof(UCreativeLobbyAd_C, Violator) == 0x000318, "Member 'UCreativeLobbyAd_C::Violator' has a wrong offset!");

}

