#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CreativeServerOptionsTile

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CreativeServerOptionsTile.CreativeServerOptionsTile_C
// 0x0130 (0x0CE8 - 0x0BB8)
class UCreativeServerOptionsTile_C final  : public UFortCreativeServerOptionTile
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BB8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x0BC0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Selected_1;                                        // 0x0BC8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PrivacyToggle;                                     // 0x0BD0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoverToggle;                                       // 0x0BD8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ViewPlayers;                                       // 0x0BE0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Selected;                                          // 0x0BE8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USimpleCommonButtonWithInput_C*         Button_CloseFriends;                               // 0x0BF0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USimpleCommonButtonWithInput_C*         Button_ShowFriends;                                // 0x0BF8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_NewServerContent;                     // 0x0C00(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_ServerDetails;                        // 0x0C08(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           CreateServerContent;                               // 0x0C10(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      CreateServerPrivacy;                               // 0x0C18(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDynamicEntryBox*                       EntryBox_ServerFriendList;                         // 0x0C20(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_28;                                          // 0x0C28(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_112;                                         // 0x0C30(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_113;                                         // 0x0C38(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_114;                                         // 0x0C40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_115;                                         // 0x0C48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_116;                                         // 0x0C50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ColorFill;                                   // 0x0C58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Fill;                                        // 0x0C60(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Gradient;                                    // 0x0C68(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_NewServer;                                   // 0x0C70(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ServerImage;                                 // 0x0C78(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  ImageTypeSwitcher;                                 // 0x0C80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               JoinServerContent;                                 // 0x0C88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       LimitedAccessDateCalloutText;                      // 0x0C90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               LimitedAccessServerContent;                        // 0x0C98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RichText_JoinServerFriendCount;                    // 0x0CA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  ServerTypeSwitcher;                                // 0x0CA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_JoinServerName;                               // 0x0CB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextPrivacyToggle;                                 // 0x0CB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class FString>                         FriendListOutput;                                  // 0x0CC0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          PlayersShown;                                      // 0x0CD0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          NewServerIsPrivate;                                // 0x0CD1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5CA2[0x2];                                     // 0x0CD2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           DisabledColor;                                     // 0x0CD4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CreativeServerOptionsTile(int32 EntryPoint, bool Temp_bool_Variable, bool Temp_bool_Variable_1, class UClass* Temp_class_Variable, class UClass* Temp_class_Variable_1, class UCommonInputSubsystem* CallFunc_GetLocalPlayerSubsystem_ReturnValue, class UObject* K2Node_CustomEvent_Loaded, TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate, class UObject* Temp_object_Variable, class UTexture2D* K2Node_DynamicCast_AsTexture_2D, bool K2Node_DynamicCast_bSuccess, class UCommonButton* K2Node_ComponentBoundEvent_Button_4, class UUMGSequencePlayer* CallFunc_PlayAnimationReverse_ReturnValue, class UCommonButton* K2Node_ComponentBoundEvent_Button_3, class UCommonButton* K2Node_ComponentBoundEvent_Button_2, class UUMGSequencePlayer* CallFunc_PlayAnimationReverse_ReturnValue_1, class UUMGSequencePlayer* CallFunc_PlayAnimationForward_ReturnValue, bool K2Node_Event_IsDesignTime, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue, class UFortCreativeServerInfo* K2Node_Event_ServerInfo, class UCommonButton* K2Node_ComponentBoundEvent_Button_1, class UCommonButton* K2Node_ComponentBoundEvent_Button, class UUMGSequencePlayer* CallFunc_PlayAnimationForward_ReturnValue_1, class UUMGSequencePlayer* CallFunc_PlayAnimationReverse_ReturnValue_2, bool Temp_bool_Variable_2, ECommonInputType K2Node_CustomEvent_bNewInputType, bool CallFunc_EqualEqual_ByteByte_ReturnValue, class UClass* K2Node_Select_Default, class UUMGSequencePlayer* CallFunc_PlayAnimationForward_ReturnValue_2, class UUMGSequencePlayer* CallFunc_PlayAnimationReverse_ReturnValue_3, float CallFunc_GetEndTime_ReturnValue, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue_1, bool CallFunc_GetSelected_ReturnValue, class UUMGSequencePlayer* CallFunc_PlayAnimationReverse_ReturnValue_4, class UUMGSequencePlayer* CallFunc_PlayAnimationForward_ReturnValue_3, bool CallFunc_IsAnimationPlaying_ReturnValue, TDelegate<void(class UObject* Loaded)> K2Node_CreateDelegate_OutputDelegate_1, const class FString& CallFunc_MakeLiteralString_ReturnValue, bool Temp_bool_Variable_3, class FText Temp_text_Variable, bool K2Node_Select_Default_1, class FText Temp_text_Variable_1, bool Temp_bool_Variable_4, int32 K2Node_CustomEvent_ArrayIndex, int32 CallFunc_Percent_IntInt_ReturnValue, class FText K2Node_Select_Default_2, int32 CallFunc_Add_IntInt_ReturnValue, const class FString& CallFunc_Conv_IntToString_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue, class FName CallFunc_Conv_StringToName_ReturnValue, const struct FFortCreativeServerDisplayOption& CallFunc_GetDataTableRowFromName_OutRow, bool CallFunc_GetDataTableRowFromName_ReturnValue, float CallFunc_RGBToHSV_H, float CallFunc_RGBToHSV_S, float CallFunc_RGBToHSV_V, float CallFunc_RGBToHSV_A, float CallFunc_RGBToHSV_H_1, float CallFunc_RGBToHSV_S_1, float CallFunc_RGBToHSV_V_1, float CallFunc_RGBToHSV_A_1, const struct FLinearColor& CallFunc_HSVToRGB_ReturnValue, float CallFunc_Multiply_FloatFloat_ReturnValue, float CallFunc_Multiply_FloatFloat_ReturnValue_1, const struct FLinearColor& CallFunc_HSVToRGB_ReturnValue_1);
	void Construct();
	void SetBackgroundImage(int32 ArrayIndex);
	void BP_OnUnhovered();
	void BP_OnHovered();
	void InputMethodChanged(ECommonInputType bNewInputType);
	void InitializeSelectedButton();
	void BP_OnDeselected();
	void BP_OnSelected();
	void BndEvt__Button_ShowFriends_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__Button_CloseFriends_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void SetBPData(class UFortCreativeServerInfo* ServerInfo);
	void PreConstruct(bool IsDesignTime);
	void BndEvt__CreateServerPrivacy_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__CreateServerPrivacy_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__IconTextButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnLoaded_3534B041413498BC4DD6D2B727558DF9(class UObject* Loaded);
	void InitServerInfo(class UFortCreativeServerInfo* ServerInfo, bool Temp_bool_Variable, ESlateVisibility Temp_byte_Variable, int32 Temp_int_Array_Index_Variable, ESlateVisibility Temp_byte_Variable_1, const class FString& CallFunc_Array_Get_Item, int32 CallFunc_GetCharacterAsNumber_ReturnValue, const class FString& CallFunc_Array_Get_Item_1, int32 CallFunc_Array_Length_ReturnValue, int32 CallFunc_GetCharacterAsNumber_ReturnValue_1, int32 CallFunc_GetCharacterAsNumber_ReturnValue_2, int32 CallFunc_Add_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_1, int32 CallFunc_Array_Length_ReturnValue_1, int32 CallFunc_Subtract_IntInt_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array, class FText CallFunc_Format_ReturnValue, bool Temp_bool_Variable_1, class FText CallFunc_TextToUpper_ReturnValue, ESlateVisibility K2Node_Select_Default, class UFortGlobalUIContext* CallFunc_GetLocalPlayerSubsystem_ReturnValue, class UFortGlobalUIContext* CallFunc_GetLocalPlayerSubsystem_ReturnValue_1, const struct FDateTime& CallFunc_GetCreativeModeLimitedAccessEndTime_ReturnValue, bool CallFunc_IsCreativeModeAccessLimited_ReturnValue, class FText CallFunc_AsDate_DateTime_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_1, bool Temp_bool_Variable_2, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array_1, class FText CallFunc_Format_ReturnValue_1, class UWidget* K2Node_Select_Default_1, const class FString& CallFunc_JoinStringArray_ReturnValue, class FText CallFunc_Conv_StringToText_ReturnValue, class FText CallFunc_TextToUpper_ReturnValue_1, int32 CallFunc_Array_Length_ReturnValue_2, bool CallFunc_Greater_IntInt_ReturnValue_1, bool Temp_bool_Variable_3, class UUserWidget* CallFunc_BP_CreateEntry_ReturnValue, class UCreativeServerFriend_C* K2Node_DynamicCast_AsCreative_Server_Friend, bool K2Node_DynamicCast_bSuccess, class UWidget* K2Node_Select_Default_2, class UWidget* K2Node_Select_Default_3, int32 Temp_int_Loop_Counter_Variable, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_2);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CreativeServerOptionsTile_C">();
	}
	static class UCreativeServerOptionsTile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCreativeServerOptionsTile_C>();
	}
};
static_assert(alignof(UCreativeServerOptionsTile_C) == 0x000008, "Wrong alinment on UCreativeServerOptionsTile_C");
static_assert(sizeof(UCreativeServerOptionsTile_C) == 0x000CE8, "Wrong size on UCreativeServerOptionsTile_C");
static_assert(offsetof(UCreativeServerOptionsTile_C, UberGraphFrame) == 0x000BB8, "Member 'UCreativeServerOptionsTile_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, Hover) == 0x000BC0, "Member 'UCreativeServerOptionsTile_C::Hover' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, Selected_1) == 0x000BC8, "Member 'UCreativeServerOptionsTile_C::Selected_1' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, PrivacyToggle) == 0x000BD0, "Member 'UCreativeServerOptionsTile_C::PrivacyToggle' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, HoverToggle) == 0x000BD8, "Member 'UCreativeServerOptionsTile_C::HoverToggle' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, ViewPlayers) == 0x000BE0, "Member 'UCreativeServerOptionsTile_C::ViewPlayers' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, Selected) == 0x000BE8, "Member 'UCreativeServerOptionsTile_C::Selected' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, Button_CloseFriends) == 0x000BF0, "Member 'UCreativeServerOptionsTile_C::Button_CloseFriends' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, Button_ShowFriends) == 0x000BF8, "Member 'UCreativeServerOptionsTile_C::Button_ShowFriends' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, CommonBorder_NewServerContent) == 0x000C00, "Member 'UCreativeServerOptionsTile_C::CommonBorder_NewServerContent' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, CommonBorder_ServerDetails) == 0x000C08, "Member 'UCreativeServerOptionsTile_C::CommonBorder_ServerDetails' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, CreateServerContent) == 0x000C10, "Member 'UCreativeServerOptionsTile_C::CreateServerContent' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, CreateServerPrivacy) == 0x000C18, "Member 'UCreativeServerOptionsTile_C::CreateServerPrivacy' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, EntryBox_ServerFriendList) == 0x000C20, "Member 'UCreativeServerOptionsTile_C::EntryBox_ServerFriendList' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, Image_28) == 0x000C28, "Member 'UCreativeServerOptionsTile_C::Image_28' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, Image_112) == 0x000C30, "Member 'UCreativeServerOptionsTile_C::Image_112' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, Image_113) == 0x000C38, "Member 'UCreativeServerOptionsTile_C::Image_113' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, Image_114) == 0x000C40, "Member 'UCreativeServerOptionsTile_C::Image_114' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, Image_115) == 0x000C48, "Member 'UCreativeServerOptionsTile_C::Image_115' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, Image_116) == 0x000C50, "Member 'UCreativeServerOptionsTile_C::Image_116' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, Image_ColorFill) == 0x000C58, "Member 'UCreativeServerOptionsTile_C::Image_ColorFill' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, Image_Fill) == 0x000C60, "Member 'UCreativeServerOptionsTile_C::Image_Fill' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, Image_Gradient) == 0x000C68, "Member 'UCreativeServerOptionsTile_C::Image_Gradient' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, Image_NewServer) == 0x000C70, "Member 'UCreativeServerOptionsTile_C::Image_NewServer' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, Image_ServerImage) == 0x000C78, "Member 'UCreativeServerOptionsTile_C::Image_ServerImage' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, ImageTypeSwitcher) == 0x000C80, "Member 'UCreativeServerOptionsTile_C::ImageTypeSwitcher' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, JoinServerContent) == 0x000C88, "Member 'UCreativeServerOptionsTile_C::JoinServerContent' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, LimitedAccessDateCalloutText) == 0x000C90, "Member 'UCreativeServerOptionsTile_C::LimitedAccessDateCalloutText' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, LimitedAccessServerContent) == 0x000C98, "Member 'UCreativeServerOptionsTile_C::LimitedAccessServerContent' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, RichText_JoinServerFriendCount) == 0x000CA0, "Member 'UCreativeServerOptionsTile_C::RichText_JoinServerFriendCount' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, ServerTypeSwitcher) == 0x000CA8, "Member 'UCreativeServerOptionsTile_C::ServerTypeSwitcher' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, Text_JoinServerName) == 0x000CB0, "Member 'UCreativeServerOptionsTile_C::Text_JoinServerName' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, TextPrivacyToggle) == 0x000CB8, "Member 'UCreativeServerOptionsTile_C::TextPrivacyToggle' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, FriendListOutput) == 0x000CC0, "Member 'UCreativeServerOptionsTile_C::FriendListOutput' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, PlayersShown) == 0x000CD0, "Member 'UCreativeServerOptionsTile_C::PlayersShown' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, NewServerIsPrivate) == 0x000CD1, "Member 'UCreativeServerOptionsTile_C::NewServerIsPrivate' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptionsTile_C, DisabledColor) == 0x000CD4, "Member 'UCreativeServerOptionsTile_C::DisabledColor' has a wrong offset!");

}

