#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Creative_Device_Prop_Parent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "EVisibleInGameState_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Creative_Device_Prop_Parent.Creative_Device_Prop_Parent_C
// 0x0078 (0x0C20 - 0x0BA8)
class ACreative_Device_Prop_Parent_C final  : public ABuildingProp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BA8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCreative_VisibleInGame_Component_C*    VisibleInGameComponent;                            // 0x0BB0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCreative_Enabled_Component_C*          EnabledComponent;                                  // 0x0BB8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortMinigameProgressComponent*         FortMinigameProgress;                              // 0x0BC0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UToyOptionsComponent_C*                 ToyOptionsComponent;                               // 0x0BC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         ActivateOnGamePhase;                               // 0x0BD0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EnabledIndex;                                      // 0x0BD4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             On_Device_Activated;                               // 0x0BD8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class AController*                            Instigating_Controller;                            // 0x0BE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsVisible;                                        // 0x0BF0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5BAE[0x7];                                     // 0x0BF1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             On_Device_Initialized;                             // 0x0BF8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             On_Play_Mode_Changed;                              // 0x0C08(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          Update_on_Minigame_State_Change;                   // 0x0C18(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Update_on_Play_Mode_Changed;                       // 0x0C19(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void On_Device_Activated__DelegateSignature();
	void On_Device_Initialized__DelegateSignature();
	void On_Play_Mode_Changed__DelegateSignature(bool New_Play_Mode);
	void ExecuteUbergraph_Creative_Device_Prop_Parent(int32 EntryPoint, class AFortMinigame* K2Node_ComponentBoundEvent_Minigame, bool CallFunc_IsValid_ReturnValue, class AFortMinigame* K2Node_ComponentBoundEvent_Minigame_1, bool CallFunc_IsValid_ReturnValue_1, TDelegate<void(class AFortMinigame* Minigame, bool bIsInPlayMode)> K2Node_CreateDelegate_OutputDelegate, class AFortMinigame* K2Node_CustomEvent_Minigame, EFortMinigameState K2Node_CustomEvent_MinigameState, TDelegate<void(class AFortMinigame* Minigame, EFortMinigameState MinigameState)> K2Node_CreateDelegate_OutputDelegate_1, TArray<class USceneComponent*>& CallFunc_GetVisibilityComponents_VisibilityComponents, const TMap<class USceneComponent*, ECollisionEnabled>& CallFunc_GetVisibilityComponentsWithCollisionOverrides_VisibilityComponents);
	void OnMinigameEnded();
	void OnMinigameStarted();
	void BndEvt__FortMinigameProgress_K2Node_ComponentBoundEvent_5_SimpleDynamicMulticastDelegate__DelegateSignature();
	void BndEvt__FortMinigameProgress_K2Node_ComponentBoundEvent_0_SimpleDynamicMulticastDelegate__DelegateSignature();
	void OnWorldReady();
	void ReceiveBeginPlay();
	void On_Mingame_State_Changed(class AFortMinigame* Minigame, EFortMinigameState MinigameState);
	void BndEvt__FortMinigameProgress_K2Node_ComponentBoundEvent_4_OnMinigameAssignmentChanged__DelegateSignature(class AFortMinigame* Minigame);
	void BndEvt__FortMinigameProgress_K2Node_ComponentBoundEvent_1_OnMinigameAssignmentChanged__DelegateSignature(class AFortMinigame* Minigame);
	void BndEvt__ToyOptionsComponent_K2Node_ComponentBoundEvent_3_AnyPropertyChangedDelegate__DelegateSignature();
	void BndEvt__ToyOptionsComponent_K2Node_ComponentBoundEvent_2_AnyPropertyChangedDelegate__DelegateSignature();
	void PlayModeChanged(class AFortMinigame* Minigame, bool bIsInPlayMode, bool CallFunc_HasAuthority_ReturnValue);
	void Activate_on_Phase(EFortMinigameState State, bool CallFunc_IsInPlayMode_bIsInPlayMode, bool CallFunc_HasAuthority_ReturnValue, bool CallFunc_IsActivatedOnPhase_Enabled);
	void Activate_Device();
	bool BlueprintOnLocalInteract(class AFortPlayerPawn* InteractingPawn);
	void Initialize_Device(bool CallFunc_IsInPlayMode_bIsInPlayMode);
	void Attempt_Activate_Device(class AController* Param_Instigating_Controller, bool Additional_Requirements, bool CallFunc_IsEnabled_Enabled, bool CallFunc_BooleanAND_ReturnValue);
	void Activate_Device_Failed();
	float BlueprintModifyIncomingDamage(float Damage, struct FGameplayTagContainer& InTags, struct FGameplayEffectContextHandle& EffectContext, class AController* EventInstigator, class AActor* DamageCauser, bool CallFunc_IsInPlayMode_bIsInPlayMode, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_BooleanAND_ReturnValue);
	void Is_Visible_In_Game(bool* Visible);
	void Update_Visibility_In_Game(bool Temp_bool_Variable, EVisibleInGameState Temp_byte_Variable, EVisibleInGameState Temp_byte_Variable_1, bool CallFunc_Is_Visible_In_Game_Visible, EVisibleInGameState K2Node_Select_Default);
	void GetVisibilityComponents(TArray<class USceneComponent*>* VisibilityComponents, TArray<class USceneComponent*>& K2Node_MakeArray_Array);
	void GetVisibilityComponentsWithCollisionOverrides(TMap<class USceneComponent*, ECollisionEnabled>* VisibilityComponents, const TMap<class USceneComponent*, ECollisionEnabled>& K2Node_MakeMap_Map);

	bool BlueprintCanInteract(class AFortPawn* InteractingPawn, EInteractionBeingAttempted InteractionBeingAttempted, ETInteractionType InteractionType, bool bInteractSuccess, bool CallFunc_IsInPlayMode_bIsInPlayMode, bool CallFunc_IsValid_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, class AController* CallFunc_GetController_ReturnValue, class AFortPlayerControllerAthena* K2Node_DynamicCast_AsFort_Player_Controller_Athena, bool K2Node_DynamicCast_bSuccess, class AFortVolume* CallFunc_CanPlayerCreateInCurrentVolume_OutCurrentVolume, bool CallFunc_CanPlayerCreateInCurrentVolume_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_2, bool CallFunc_IsValid_ReturnValue_3) const;
	void IsInPlayMode(bool* bIsInPlayMode, bool CallFunc_IsInPlayMode_ReturnValue, bool CallFunc_IsValid_ReturnValue) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Creative_Device_Prop_Parent_C">();
	}
	static class ACreative_Device_Prop_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACreative_Device_Prop_Parent_C>();
	}
};
static_assert(alignof(ACreative_Device_Prop_Parent_C) == 0x000008, "Wrong alinment on ACreative_Device_Prop_Parent_C");
static_assert(sizeof(ACreative_Device_Prop_Parent_C) == 0x000C20, "Wrong size on ACreative_Device_Prop_Parent_C");
static_assert(offsetof(ACreative_Device_Prop_Parent_C, UberGraphFrame) == 0x000BA8, "Member 'ACreative_Device_Prop_Parent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ACreative_Device_Prop_Parent_C, VisibleInGameComponent) == 0x000BB0, "Member 'ACreative_Device_Prop_Parent_C::VisibleInGameComponent' has a wrong offset!");
static_assert(offsetof(ACreative_Device_Prop_Parent_C, EnabledComponent) == 0x000BB8, "Member 'ACreative_Device_Prop_Parent_C::EnabledComponent' has a wrong offset!");
static_assert(offsetof(ACreative_Device_Prop_Parent_C, FortMinigameProgress) == 0x000BC0, "Member 'ACreative_Device_Prop_Parent_C::FortMinigameProgress' has a wrong offset!");
static_assert(offsetof(ACreative_Device_Prop_Parent_C, ToyOptionsComponent) == 0x000BC8, "Member 'ACreative_Device_Prop_Parent_C::ToyOptionsComponent' has a wrong offset!");
static_assert(offsetof(ACreative_Device_Prop_Parent_C, ActivateOnGamePhase) == 0x000BD0, "Member 'ACreative_Device_Prop_Parent_C::ActivateOnGamePhase' has a wrong offset!");
static_assert(offsetof(ACreative_Device_Prop_Parent_C, EnabledIndex) == 0x000BD4, "Member 'ACreative_Device_Prop_Parent_C::EnabledIndex' has a wrong offset!");
static_assert(offsetof(ACreative_Device_Prop_Parent_C, On_Device_Activated) == 0x000BD8, "Member 'ACreative_Device_Prop_Parent_C::On_Device_Activated' has a wrong offset!");
static_assert(offsetof(ACreative_Device_Prop_Parent_C, Instigating_Controller) == 0x000BE8, "Member 'ACreative_Device_Prop_Parent_C::Instigating_Controller' has a wrong offset!");
static_assert(offsetof(ACreative_Device_Prop_Parent_C, bIsVisible) == 0x000BF0, "Member 'ACreative_Device_Prop_Parent_C::bIsVisible' has a wrong offset!");
static_assert(offsetof(ACreative_Device_Prop_Parent_C, On_Device_Initialized) == 0x000BF8, "Member 'ACreative_Device_Prop_Parent_C::On_Device_Initialized' has a wrong offset!");
static_assert(offsetof(ACreative_Device_Prop_Parent_C, On_Play_Mode_Changed) == 0x000C08, "Member 'ACreative_Device_Prop_Parent_C::On_Play_Mode_Changed' has a wrong offset!");
static_assert(offsetof(ACreative_Device_Prop_Parent_C, Update_on_Minigame_State_Change) == 0x000C18, "Member 'ACreative_Device_Prop_Parent_C::Update_on_Minigame_State_Change' has a wrong offset!");
static_assert(offsetof(ACreative_Device_Prop_Parent_C, Update_on_Play_Mode_Changed) == 0x000C19, "Member 'ACreative_Device_Prop_Parent_C::Update_on_Play_Mode_Changed' has a wrong offset!");

}

