#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CreativeIslandLinkEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CreativeIslandLinkEntry.CreativeIslandLinkEntry_C
// 0x0058 (0x0C00 - 0x0BA8)
class UCreativeIslandLinkEntry_C final  : public UFortCreativeIslandLinkEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BA8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_Text;                                       // 0x0BB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0BB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_SelectedBG;                                  // 0x0BC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USimplePipButton_C*                     SimplePipButton;                                   // 0x0BC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_CreatorName;                                  // 0x0BD0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_IslandDescription;                            // 0x0BD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_IslandName;                                   // 0x0BE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Version;                                      // 0x0BE8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 Mnemonic;                                          // 0x0BF0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CreativeIslandLinkEntry(int32 EntryPoint, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, bool Temp_bool_Variable, class UObject* K2Node_Event_ListItemObject, class UFortCreativeIslandLink* K2Node_DynamicCast_AsFort_Creative_Island_Link, bool K2Node_DynamicCast_bSuccess, class FText CallFunc_Conv_StringToText_ReturnValue, class FText CallFunc_Conv_StringToText_ReturnValue_1, class FText CallFunc_TextToUpper_ReturnValue, class FText CallFunc_Conv_StringToText_ReturnValue_2, bool CallFunc_TextIsEmpty_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array, ESlateVisibility K2Node_Select_Default, class FText CallFunc_Format_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, class FText CallFunc_TextToUpper_ReturnValue_1, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_1, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array_1, class FText CallFunc_Format_ReturnValue_1, class UCommonButton* K2Node_ComponentBoundEvent_Button, class UWidget* CallFunc_FindParentWidgetOfType_ReturnValue, class UCreativeIslandLinkScreen_C* K2Node_DynamicCast_AsCreative_Island_Link_Screen, bool K2Node_DynamicCast_bSuccess_1);
	void BndEvt__SimplePipButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void BP_OnDeselected();
	void BP_OnSelected();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CreativeIslandLinkEntry_C">();
	}
	static class UCreativeIslandLinkEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCreativeIslandLinkEntry_C>();
	}
};
static_assert(alignof(UCreativeIslandLinkEntry_C) == 0x000008, "Wrong alinment on UCreativeIslandLinkEntry_C");
static_assert(sizeof(UCreativeIslandLinkEntry_C) == 0x000C00, "Wrong size on UCreativeIslandLinkEntry_C");
static_assert(offsetof(UCreativeIslandLinkEntry_C, UberGraphFrame) == 0x000BA8, "Member 'UCreativeIslandLinkEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCreativeIslandLinkEntry_C, Border_Text) == 0x000BB0, "Member 'UCreativeIslandLinkEntry_C::Border_Text' has a wrong offset!");
static_assert(offsetof(UCreativeIslandLinkEntry_C, Image_0) == 0x000BB8, "Member 'UCreativeIslandLinkEntry_C::Image_0' has a wrong offset!");
static_assert(offsetof(UCreativeIslandLinkEntry_C, Image_SelectedBG) == 0x000BC0, "Member 'UCreativeIslandLinkEntry_C::Image_SelectedBG' has a wrong offset!");
static_assert(offsetof(UCreativeIslandLinkEntry_C, SimplePipButton) == 0x000BC8, "Member 'UCreativeIslandLinkEntry_C::SimplePipButton' has a wrong offset!");
static_assert(offsetof(UCreativeIslandLinkEntry_C, Text_CreatorName) == 0x000BD0, "Member 'UCreativeIslandLinkEntry_C::Text_CreatorName' has a wrong offset!");
static_assert(offsetof(UCreativeIslandLinkEntry_C, Text_IslandDescription) == 0x000BD8, "Member 'UCreativeIslandLinkEntry_C::Text_IslandDescription' has a wrong offset!");
static_assert(offsetof(UCreativeIslandLinkEntry_C, Text_IslandName) == 0x000BE0, "Member 'UCreativeIslandLinkEntry_C::Text_IslandName' has a wrong offset!");
static_assert(offsetof(UCreativeIslandLinkEntry_C, Text_Version) == 0x000BE8, "Member 'UCreativeIslandLinkEntry_C::Text_Version' has a wrong offset!");
static_assert(offsetof(UCreativeIslandLinkEntry_C, Mnemonic) == 0x000BF0, "Member 'UCreativeIslandLinkEntry_C::Mnemonic' has a wrong offset!");

}

