#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CreativeServerOptions

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CreativeServerOptions.CreativeServerOptions_C
// 0x0058 (0x0320 - 0x02C8)
class UCreativeServerOptions_C final  : public UFortCreativeServersView
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCircleArrowButton_C*                   CircleArrowButton_Left;                            // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCircleArrowButton_C*                   CircleArrowButton_Right;                           // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCreativeServerOptionsTile_C*           CreativeServerOptionsTile;                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCreativeServerOptionsTile_C*           CreativeServerOptionsTile_0;                       // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetCarousel*                  ServerCarousel;                                    // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetCarouselNavBar*            ServerCarouselNavBar;                              // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortSwipePanel*                        SwipePanel;                                        // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnSelectedServerChanged;                           // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnSelectedServerChanged__DelegateSignature(class UFortCreativeServerInfo* ServerInfo);
	void ExecuteUbergraph_CreativeServerOptions(int32 EntryPoint, ESlateVisibility Temp_byte_Variable, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, bool Temp_bool_Variable, float Temp_float_Variable, ESlateVisibility Temp_byte_Variable_1, bool Temp_bool_Variable_1, ESlateVisibility Temp_byte_Variable_2, ESlateVisibility K2Node_Select_Default, ESlateVisibility Temp_byte_Variable_3, class UCommonButton* K2Node_ComponentBoundEvent_Button_1, class UCommonButton* K2Node_ComponentBoundEvent_Button, bool CallFunc_IsMobileGame_ReturnValue, float CallFunc_PauseAnimation_ReturnValue, float CallFunc_GetStartTime_ReturnValue, float CallFunc_PauseAnimation_ReturnValue_1, bool CallFunc_LessEqual_FloatFloat_ReturnValue, float CallFunc_Add_FloatFloat_ReturnValue, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue, float CallFunc_GetEndTime_ReturnValue, float CallFunc_Subtract_FloatFloat_ReturnValue, float K2Node_Select_Default_1, bool K2Node_Event_IsDesignTime, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue_1, bool Temp_bool_Variable_2, ESlateVisibility K2Node_Select_Default_2);
	void PreConstruct(bool IsDesignTime);
	void EventIntro();
	void BndEvt__CircleArrowButton_Right_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__CircleArrowButton_Left_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void Construct();
	void BndEvt__SwipePanel_K2Node_ComponentBoundEvent_3_OnFortSwipeEvent__DelegateSignature();
	void BndEvt__SwipePanel_K2Node_ComponentBoundEvent_2_OnFortSwipeEvent__DelegateSignature();
	void OnCreativeServerListRefreshed();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CreativeServerOptions_C">();
	}
	static class UCreativeServerOptions_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCreativeServerOptions_C>();
	}
};
static_assert(alignof(UCreativeServerOptions_C) == 0x000008, "Wrong alinment on UCreativeServerOptions_C");
static_assert(sizeof(UCreativeServerOptions_C) == 0x000320, "Wrong size on UCreativeServerOptions_C");
static_assert(offsetof(UCreativeServerOptions_C, UberGraphFrame) == 0x0002C8, "Member 'UCreativeServerOptions_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptions_C, Intro) == 0x0002D0, "Member 'UCreativeServerOptions_C::Intro' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptions_C, CircleArrowButton_Left) == 0x0002D8, "Member 'UCreativeServerOptions_C::CircleArrowButton_Left' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptions_C, CircleArrowButton_Right) == 0x0002E0, "Member 'UCreativeServerOptions_C::CircleArrowButton_Right' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptions_C, CreativeServerOptionsTile) == 0x0002E8, "Member 'UCreativeServerOptions_C::CreativeServerOptionsTile' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptions_C, CreativeServerOptionsTile_0) == 0x0002F0, "Member 'UCreativeServerOptions_C::CreativeServerOptionsTile_0' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptions_C, ServerCarousel) == 0x0002F8, "Member 'UCreativeServerOptions_C::ServerCarousel' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptions_C, ServerCarouselNavBar) == 0x000300, "Member 'UCreativeServerOptions_C::ServerCarouselNavBar' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptions_C, SwipePanel) == 0x000308, "Member 'UCreativeServerOptions_C::SwipePanel' has a wrong offset!");
static_assert(offsetof(UCreativeServerOptions_C, OnSelectedServerChanged) == 0x000310, "Member 'UCreativeServerOptions_C::OnSelectedServerChanged' has a wrong offset!");

}

