#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Curie

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Curie_structs.hpp"
#include "Engine_classes.hpp"
#include "ModularGameplay_classes.hpp"


namespace SDK
{

// Class Curie.CurieComponent
// 0x0030 (0x00E0 - 0x00B0)
class UCurieComponent : public UActorComponent
{
public:
	uint8                                         Pad_1D4B[0x8];                                     // 0x00B0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Identifier;                                        // 0x00B8(0x0008)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ECurieEntityType                              EntityType;                                        // 0x00C0(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1D4C[0x1F];                                    // 0x00C1(0x001F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleOwningActorDestroyed(class AActor* Owner);

	bool HasAnyElementAttached(const struct FGameplayTagContainer& ElementIdentifiers) const;
	bool HasElementAttached(const struct FGameplayTag& ElementIdentifier) const;
	bool HasStateAttached(const struct FGameplayTag& StateIdentifier) const;
	bool IsInteractingWithElement(struct FGameplayTag& Element) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CurieComponent">();
	}
	static class UCurieComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCurieComponent>();
	}
};
static_assert(alignof(UCurieComponent) == 0x000008, "Wrong alinment on UCurieComponent");
static_assert(sizeof(UCurieComponent) == 0x0000E0, "Wrong size on UCurieComponent");
static_assert(offsetof(UCurieComponent, Identifier) == 0x0000B8, "Member 'UCurieComponent::Identifier' has a wrong offset!");
static_assert(offsetof(UCurieComponent, EntityType) == 0x0000C0, "Member 'UCurieComponent::EntityType' has a wrong offset!");

// Class Curie.CurieElementBehavior
// 0x0070 (0x0098 - 0x0028)
class UCurieElementBehavior : public UObject
{
public:
	TArray<struct FCurieEffectContainer>          OnBeginAttachmentEffects;                          // 0x0028(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FCurieEffectContainer>          OngoingAttachmentEffects;                          // 0x0038(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FCurieEffectContainer>          OnEndAttachmentEffects;                            // 0x0048(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FCurieEffectContainer>          OnInstantInteractionEffects;                       // 0x0058(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FCurieEffectContainer>          OnBeginInteractionEffects;                         // 0x0068(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FCurieEffectContainer>          OngoingInteractionEffects;                         // 0x0078(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FCurieEffectContainer>          OnEndInteractionEffects;                           // 0x0088(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CurieElementBehavior">();
	}
	static class UCurieElementBehavior* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCurieElementBehavior>();
	}
};
static_assert(alignof(UCurieElementBehavior) == 0x000008, "Wrong alinment on UCurieElementBehavior");
static_assert(sizeof(UCurieElementBehavior) == 0x000098, "Wrong size on UCurieElementBehavior");
static_assert(offsetof(UCurieElementBehavior, OnBeginAttachmentEffects) == 0x000028, "Member 'UCurieElementBehavior::OnBeginAttachmentEffects' has a wrong offset!");
static_assert(offsetof(UCurieElementBehavior, OngoingAttachmentEffects) == 0x000038, "Member 'UCurieElementBehavior::OngoingAttachmentEffects' has a wrong offset!");
static_assert(offsetof(UCurieElementBehavior, OnEndAttachmentEffects) == 0x000048, "Member 'UCurieElementBehavior::OnEndAttachmentEffects' has a wrong offset!");
static_assert(offsetof(UCurieElementBehavior, OnInstantInteractionEffects) == 0x000058, "Member 'UCurieElementBehavior::OnInstantInteractionEffects' has a wrong offset!");
static_assert(offsetof(UCurieElementBehavior, OnBeginInteractionEffects) == 0x000068, "Member 'UCurieElementBehavior::OnBeginInteractionEffects' has a wrong offset!");
static_assert(offsetof(UCurieElementBehavior, OngoingInteractionEffects) == 0x000078, "Member 'UCurieElementBehavior::OngoingInteractionEffects' has a wrong offset!");
static_assert(offsetof(UCurieElementBehavior, OnEndInteractionEffects) == 0x000088, "Member 'UCurieElementBehavior::OnEndInteractionEffects' has a wrong offset!");

// Class Curie.CurieEntityStateBehavior
// 0x0098 (0x00C0 - 0x0028)
class UCurieEntityStateBehavior : public UObject
{
public:
	struct FGameplayTagContainer                  RequiredAttachedElements;                          // 0x0028(0x0020)(Edit, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  RequiredInteractingElements;                       // 0x0048(0x0020)(Edit, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  AllowedAttachmentEntityTypes;                      // 0x0068(0x0020)(Edit, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FCurieEffectContainer>          OnBeginEffects;                                    // 0x0088(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FCurieEffectContainer>          OngoingEffects;                                    // 0x0098(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FCurieEffectContainer>          OnEndEffects;                                      // 0x00A8(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bIsConsumable : 1;                                 // 0x00B8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bShouldDetach : 1;                                 // 0x00B8(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bSkipExecuteAttachDetach : 1;                      // 0x00B8(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_1D51[0x7];                                     // 0x00B9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CurieEntityStateBehavior">();
	}
	static class UCurieEntityStateBehavior* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCurieEntityStateBehavior>();
	}
};
static_assert(alignof(UCurieEntityStateBehavior) == 0x000008, "Wrong alinment on UCurieEntityStateBehavior");
static_assert(sizeof(UCurieEntityStateBehavior) == 0x0000C0, "Wrong size on UCurieEntityStateBehavior");
static_assert(offsetof(UCurieEntityStateBehavior, RequiredAttachedElements) == 0x000028, "Member 'UCurieEntityStateBehavior::RequiredAttachedElements' has a wrong offset!");
static_assert(offsetof(UCurieEntityStateBehavior, RequiredInteractingElements) == 0x000048, "Member 'UCurieEntityStateBehavior::RequiredInteractingElements' has a wrong offset!");
static_assert(offsetof(UCurieEntityStateBehavior, AllowedAttachmentEntityTypes) == 0x000068, "Member 'UCurieEntityStateBehavior::AllowedAttachmentEntityTypes' has a wrong offset!");
static_assert(offsetof(UCurieEntityStateBehavior, OnBeginEffects) == 0x000088, "Member 'UCurieEntityStateBehavior::OnBeginEffects' has a wrong offset!");
static_assert(offsetof(UCurieEntityStateBehavior, OngoingEffects) == 0x000098, "Member 'UCurieEntityStateBehavior::OngoingEffects' has a wrong offset!");
static_assert(offsetof(UCurieEntityStateBehavior, OnEndEffects) == 0x0000A8, "Member 'UCurieEntityStateBehavior::OnEndEffects' has a wrong offset!");

// Class Curie.CurieGlobals
// 0x0028 (0x0050 - 0x0028)
class UCurieGlobals final  : public UObject
{
public:
	bool                                          bEnableCurie;                                      // 0x0028(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1D52[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftClassPath                         CurieGlobalsClassName;                             // 0x0030(0x0018)(ZeroConstructor, Config, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurieManager*                          RegisteredCurieManager;                            // 0x0048(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CurieGlobals">();
	}
	static class UCurieGlobals* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCurieGlobals>();
	}
};
static_assert(alignof(UCurieGlobals) == 0x000008, "Wrong alinment on UCurieGlobals");
static_assert(sizeof(UCurieGlobals) == 0x000050, "Wrong size on UCurieGlobals");
static_assert(offsetof(UCurieGlobals, bEnableCurie) == 0x000028, "Member 'UCurieGlobals::bEnableCurie' has a wrong offset!");
static_assert(offsetof(UCurieGlobals, CurieGlobalsClassName) == 0x000030, "Member 'UCurieGlobals::CurieGlobalsClassName' has a wrong offset!");
static_assert(offsetof(UCurieGlobals, RegisteredCurieManager) == 0x000048, "Member 'UCurieGlobals::RegisteredCurieManager' has a wrong offset!");

// Class Curie.CurieInterface
// 0x0000 (0x0028 - 0x0028)
class ICurieInterface : public IInterface
{
public:
	void OnCurieContainerInitialized_BP(struct FCurieContainerHandle& CurieContainerHandle);
	void OnCurieContainerShutdown_BP(struct FCurieContainerHandle& CurieContainerHandle);
	void OnCurieElementAttached_BP(struct FCurieContainerHandle& CurieContainerHandle, struct FGameplayTag& ElementTag);
	void OnCurieElementDetached_BP(struct FCurieContainerHandle& CurieContainerHandle, struct FGameplayTag& ElementTag);
	void OnCurieElementInteract_BP(struct FCurieContainerHandle& CurieContainerHandle, struct FGameplayTag& ElementTag, struct FCurieInteractParamsHandle& InteractParamsHandle);
	void OnCurieElementInteractBegun_BP(struct FCurieContainerHandle& CurieContainerHandle, struct FGameplayTag& ElementTag, struct FCurieInteractParamsHandle& InteractParamsHandle);
	void OnCurieElementInteractEnded_BP(struct FCurieContainerHandle& CurieContainerHandle, struct FGameplayTag& ElementTag, struct FCurieInteractParamsHandle& InteractParamsHandle);
	void OnCurieStateAttached_BP(struct FCurieContainerHandle& CurieContainerHandle, struct FGameplayTag& StateTag);
	void OnCurieStateConsumed_BP(struct FCurieContainerHandle& CurieContainerHandle, struct FGameplayTag& StateTag);
	void OnCurieStateDetached_BP(struct FCurieContainerHandle& CurieContainerHandle, struct FGameplayTag& StateTag);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CurieInterface">();
	}
	static class ICurieInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<ICurieInterface>();
	}
};
static_assert(alignof(ICurieInterface) == 0x000008, "Wrong alinment on ICurieInterface");
static_assert(sizeof(ICurieInterface) == 0x000028, "Wrong size on ICurieInterface");

// Class Curie.CurieManager
// 0x0118 (0x01C8 - 0x00B0)
class UCurieManager : public UGameStateComponent
{
public:
	TSubclassOf<class UCurieComponent>            CurieComponentClass;                               // 0x00B0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDataTable*                             MaterialDefinitionsTable;                          // 0x00B8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDataTable*                             ElementDefinitionsTable;                           // 0x00C0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDataTable*                             EntityStateDefinitionsTable;                       // 0x00C8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1D56[0xF8];                                    // 0x00D0(0x00F8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BindDelegateForCurieElementAttached(class UObject* CurieOwner, TDelegate<void(class UObject* Owner, const struct FCurieContainerHandle& ContainerHandle, struct FGameplayTag& ElementIdentifier)>& Delegate);
	void BindDelegateForCurieElementBeginInteract(class UObject* CurieOwner, TDelegate<void(class UObject* Owner, const struct FCurieContainerHandle& ContainerHandle, struct FGameplayTag& ElementIdentifier)>& Delegate);
	void BindDelegateForCurieElementDetached(class UObject* CurieOwner, TDelegate<void(class UObject* Owner, const struct FCurieContainerHandle& ContainerHandle, struct FGameplayTag& ElementIdentifier)>& Delegate);
	void BindDelegateForCurieElementEndInteract(class UObject* CurieOwner, TDelegate<void(class UObject* Owner, const struct FCurieContainerHandle& ContainerHandle, struct FGameplayTag& ElementIdentifier)>& Delegate);
	void BindDelegateForCurieElementInteract(class UObject* CurieOwner, TDelegate<void(class UObject* Owner, const struct FCurieContainerHandle& ContainerHandle, struct FGameplayTag& ElementIdentifier)>& Delegate);
	void BindDelegateForCurieStateAttached(class UObject* CurieOwner, TDelegate<void(class UObject* Owner, const struct FCurieContainerHandle& ContainerHandle, struct FGameplayTag& StateIdentifier)>& Delegate);
	void BindDelegateForCurieStateDetached(class UObject* CurieOwner, TDelegate<void(class UObject* Owner, const struct FCurieContainerHandle& ContainerHandle, struct FGameplayTag& StateIdentifier)>& Delegate);
	void UnbindDelegateForCurieElementAttached(class UObject* CurieOwner, TDelegate<void(class UObject* Owner, const struct FCurieContainerHandle& ContainerHandle, struct FGameplayTag& ElementIdentifier)>& Delegate);
	void UnbindDelegateForCurieElementBeginInteract(class UObject* CurieOwner, TDelegate<void(class UObject* Owner, const struct FCurieContainerHandle& ContainerHandle, struct FGameplayTag& ElementIdentifier)>& Delegate);
	void UnbindDelegateForCurieElementDetached(class UObject* CurieOwner, TDelegate<void(class UObject* Owner, const struct FCurieContainerHandle& ContainerHandle, struct FGameplayTag& ElementIdentifier)>& Delegate);
	void UnbindDelegateForCurieElementEndInteract(class UObject* CurieOwner, TDelegate<void(class UObject* Owner, const struct FCurieContainerHandle& ContainerHandle, struct FGameplayTag& ElementIdentifier)>& Delegate);
	void UnbindDelegateForCurieElementInteract(class UObject* CurieOwner, TDelegate<void(class UObject* Owner, const struct FCurieContainerHandle& ContainerHandle, struct FGameplayTag& ElementIdentifier)>& Delegate);
	void UnbindDelegateForCurieStateAttached(class UObject* CurieOwner, TDelegate<void(class UObject* Owner, const struct FCurieContainerHandle& ContainerHandle, struct FGameplayTag& StateIdentifier)>& Delegate);
	void UnbindDelegateForCurieStateDetached(class UObject* CurieOwner, TDelegate<void(class UObject* Owner, const struct FCurieContainerHandle& ContainerHandle, struct FGameplayTag& StateIdentifier)>& Delegate);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CurieManager">();
	}
	static class UCurieManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCurieManager>();
	}
};
static_assert(alignof(UCurieManager) == 0x000008, "Wrong alinment on UCurieManager");
static_assert(sizeof(UCurieManager) == 0x0001C8, "Wrong size on UCurieManager");
static_assert(offsetof(UCurieManager, CurieComponentClass) == 0x0000B0, "Member 'UCurieManager::CurieComponentClass' has a wrong offset!");
static_assert(offsetof(UCurieManager, MaterialDefinitionsTable) == 0x0000B8, "Member 'UCurieManager::MaterialDefinitionsTable' has a wrong offset!");
static_assert(offsetof(UCurieManager, ElementDefinitionsTable) == 0x0000C0, "Member 'UCurieManager::ElementDefinitionsTable' has a wrong offset!");
static_assert(offsetof(UCurieManager, EntityStateDefinitionsTable) == 0x0000C8, "Member 'UCurieManager::EntityStateDefinitionsTable' has a wrong offset!");

}

