#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DA_AshtonPack

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass DA_AshtonPack.DA_AshtonPack_C
// 0x0080 (0x0E30 - 0x0DB0)
class ADA_AshtonPack_C final  : public AFortCustomizableAbilityDecoTool
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0DB0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         PunchPicker;                                       // 0x0DB8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasLanded;                                         // 0x0DBC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7016[0x3];                                     // 0x0DBD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  AshtonAbilityTags;                                 // 0x0DC0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  GC_JumpTrails;                                     // 0x0DE0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  GC_SkydiveTrails;                                  // 0x0E00(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           PrimaryFireEventTag;                               // 0x0E20(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           SecondaryFireEventTag;                             // 0x0E28(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_DA_AshtonPack(int32 EntryPoint, bool Temp_bool_Variable, class AFortDecoHelper* K2Node_Event_FortDecoHelper_1, bool CallFunc_Not_PreBool_ReturnValue, class AFortDecoHelper* K2Node_Event_FortDecoHelper, class APawn* CallFunc_GetInstigator_ReturnValue, class AFortPawn* K2Node_DynamicCast_AsFort_Pawn, bool K2Node_DynamicCast_bSuccess, const struct FGameplayEventData& K2Node_MakeStruct_GameplayEventData, bool CallFunc_IsFalling_ReturnValue, const struct FGameplayEventData& K2Node_MakeStruct_GameplayEventData_1, bool CallFunc_Less_FloatFloat_ReturnValue, float CallFunc_Add_FloatFloat_ReturnValue, bool CallFunc_Greater_FloatFloat_ReturnValue, class APawn* CallFunc_GetInstigator_ReturnValue_1, class APawn* CallFunc_GetInstigator_ReturnValue_2, TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface, bool K2Node_DynamicCast_bSuccess_1, class APawn* CallFunc_GetInstigator_ReturnValue_3, struct FHitResult& K2Node_CustomEvent_Hit, class AFortPawn* K2Node_DynamicCast_AsFort_Pawn_1, bool K2Node_DynamicCast_bSuccess_2, class APawn* CallFunc_GetInstigator_ReturnValue_4, bool CallFunc_BooleanAND_ReturnValue, TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface_1, bool K2Node_DynamicCast_bSuccess_3, class APawn* CallFunc_GetInstigator_ReturnValue_5, class AFortPawn* K2Node_DynamicCast_AsFort_Pawn_2, bool K2Node_DynamicCast_bSuccess_4, TDelegate<void(struct FHitResult& Hit)> K2Node_CreateDelegate_OutputDelegate, class UAbilitySystemComponent* CallFunc_GetAbilitySystemComponent_ReturnValue, bool CallFunc_HasAnyMatchingGameplayTags_ReturnValue, bool CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1, class APawn* CallFunc_GetInstigator_ReturnValue_6, bool Temp_bool_Variable_1, int32 CallFunc_RemoveActiveEffectsWithSourceTags_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue_1, int32 CallFunc_RemoveActiveEffectsWithSourceTags_ReturnValue_1);
	void Landed(struct FHitResult& Hit);
	void ReceiveBeginPlay();
	void BPPressSecondaryFire(class AFortDecoHelper* FortDecoHelper);
	void BPPressTrigger(class AFortDecoHelper* FortDecoHelper);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DA_AshtonPack_C">();
	}
	static class ADA_AshtonPack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADA_AshtonPack_C>();
	}
};
static_assert(alignof(ADA_AshtonPack_C) == 0x000008, "Wrong alinment on ADA_AshtonPack_C");
static_assert(sizeof(ADA_AshtonPack_C) == 0x000E30, "Wrong size on ADA_AshtonPack_C");
static_assert(offsetof(ADA_AshtonPack_C, UberGraphFrame) == 0x000DB0, "Member 'ADA_AshtonPack_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ADA_AshtonPack_C, PunchPicker) == 0x000DB8, "Member 'ADA_AshtonPack_C::PunchPicker' has a wrong offset!");
static_assert(offsetof(ADA_AshtonPack_C, HasLanded) == 0x000DBC, "Member 'ADA_AshtonPack_C::HasLanded' has a wrong offset!");
static_assert(offsetof(ADA_AshtonPack_C, AshtonAbilityTags) == 0x000DC0, "Member 'ADA_AshtonPack_C::AshtonAbilityTags' has a wrong offset!");
static_assert(offsetof(ADA_AshtonPack_C, GC_JumpTrails) == 0x000DE0, "Member 'ADA_AshtonPack_C::GC_JumpTrails' has a wrong offset!");
static_assert(offsetof(ADA_AshtonPack_C, GC_SkydiveTrails) == 0x000E00, "Member 'ADA_AshtonPack_C::GC_SkydiveTrails' has a wrong offset!");
static_assert(offsetof(ADA_AshtonPack_C, PrimaryFireEventTag) == 0x000E20, "Member 'ADA_AshtonPack_C::PrimaryFireEventTag' has a wrong offset!");
static_assert(offsetof(ADA_AshtonPack_C, SecondaryFireEventTag) == 0x000E28, "Member 'ADA_AshtonPack_C::SecondaryFireEventTag' has a wrong offset!");

}

