#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Diagnostics_Assert

#include "Basic.hpp"


namespace SDK::Params
{

// Function Diagnostics_Assert.Assert.cmp
// 0x0001 (0x0001 - 0x0000)
struct Assert_Cmp final 
{
public:
	uint8                                         __verse_0x123742AA_expression : 1;                 // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, NoDestructor))
};
static_assert(alignof(Assert_Cmp) == 0x000001, "Wrong alinment on Assert_Cmp");
static_assert(sizeof(Assert_Cmp) == 0x000001, "Wrong size on Assert_Cmp");

// Function Diagnostics_Assert.Assert.cmpMsg
// 0x0018 (0x0018 - 0x0000)
struct Assert_CmpMsg final 
{
public:
	uint8                                         __verse_0x123742AA_expression : 1;                 // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, NoDestructor))
	uint8                                         Pad_7A60[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 __verse_0xD212B012_message;                        // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Assert_CmpMsg) == 0x000008, "Wrong alinment on Assert_CmpMsg");
static_assert(sizeof(Assert_CmpMsg) == 0x000018, "Wrong size on Assert_CmpMsg");
static_assert(offsetof(Assert_CmpMsg, __verse_0xD212B012_message) == 0x000008, "Member 'Assert_CmpMsg::__verse_0xD212B012_message' has a wrong offset!");

}

