#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DynamicHUD

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK
{

// Enum DynamicHUD.EDynamicHUDComparison
// NumValues: 0x0004
enum class EDynamicHUDComparison : uint32
{
	Equal                                    = 0,
	LessOrEqual                              = 1,
	GreaterOrEqual                           = 2,
	EDynamicHUDComparison_MAX                = 3,
};

// Enum DynamicHUD.EDynamicHUDOperator
// NumValues: 0x0003
enum class EDynamicHUDOperator : uint32
{
	Addition                                 = 0,
	Substraction                             = 1,
	EDynamicHUDOperator_MAX                  = 2,
};

// Enum DynamicHUD.EDynamicHUDSide
// NumValues: 0x0005
enum class EDynamicHUDSide : uint32
{
	Top                                      = 0,
	Bottom                                   = 1,
	Left                                     = 2,
	Right                                    = 3,
	EDynamicHUDSide_MAX                      = 4,
};

// Enum DynamicHUD.EDynamicHUDAnchor
// NumValues: 0x000A
enum class EDynamicHUDAnchor : uint32
{
	TopLeft                                  = 0,
	TopCenter                                = 1,
	TopRight                                 = 2,
	CenterLeft                               = 3,
	CenterCenter                             = 4,
	CenterRight                              = 5,
	BottomLeft                               = 6,
	BottomCenter                             = 7,
	BottomRight                              = 8,
	EDynamicHUDAnchor_MAX                    = 9,
};

// Enum DynamicHUD.EDynamicHUDStrength
// NumValues: 0x0005
enum class EDynamicHUDStrength : uint32
{
	Weak                                     = 0,
	Medium                                   = 1,
	Strong                                   = 2,
	Required                                 = 3,
	EDynamicHUDStrength_MAX                  = 4,
};

// ScriptStruct DynamicHUD.DirectorData
// 0x0038 (0x0038 - 0x0000)
struct FDirectorData final 
{
public:
	TSoftClassPtr<class UClass>                   DirectorClass;                                     // 0x0000(0x0028)(Transient, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Instance;                                          // 0x0028(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Count;                                             // 0x0030(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_52C4[0x7];                                     // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDirectorData) == 0x000008, "Wrong alinment on FDirectorData");
static_assert(sizeof(FDirectorData) == 0x000038, "Wrong size on FDirectorData");
static_assert(offsetof(FDirectorData, DirectorClass) == 0x000000, "Member 'FDirectorData::DirectorClass' has a wrong offset!");
static_assert(offsetof(FDirectorData, Instance) == 0x000028, "Member 'FDirectorData::Instance' has a wrong offset!");
static_assert(offsetof(FDirectorData, Count) == 0x000030, "Member 'FDirectorData::Count' has a wrong offset!");

// ScriptStruct DynamicHUD.DynamicHUDUnallowed
// 0x0030 (0x0030 - 0x0000)
struct FDynamicHUDUnallowed final 
{
public:
	TSoftClassPtr<class UClass>                   Widget;                                            // 0x0000(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           Tag;                                               // 0x0028(0x0008)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDynamicHUDUnallowed) == 0x000008, "Wrong alinment on FDynamicHUDUnallowed");
static_assert(sizeof(FDynamicHUDUnallowed) == 0x000030, "Wrong size on FDynamicHUDUnallowed");
static_assert(offsetof(FDynamicHUDUnallowed, Widget) == 0x000000, "Member 'FDynamicHUDUnallowed::Widget' has a wrong offset!");
static_assert(offsetof(FDynamicHUDUnallowed, Tag) == 0x000028, "Member 'FDynamicHUDUnallowed::Tag' has a wrong offset!");

// ScriptStruct DynamicHUD.DynamicHUDAllowed
// 0x0040 (0x0040 - 0x0000)
struct FDynamicHUDAllowed final 
{
public:
	TSoftClassPtr<class UClass>                   Widget;                                            // 0x0000(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           Tag;                                               // 0x0028(0x0008)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UDynamicHUDConstraintBase*>      LayoutConstraints;                                 // 0x0030(0x0010)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDynamicHUDAllowed) == 0x000008, "Wrong alinment on FDynamicHUDAllowed");
static_assert(sizeof(FDynamicHUDAllowed) == 0x000040, "Wrong size on FDynamicHUDAllowed");
static_assert(offsetof(FDynamicHUDAllowed, Widget) == 0x000000, "Member 'FDynamicHUDAllowed::Widget' has a wrong offset!");
static_assert(offsetof(FDynamicHUDAllowed, Tag) == 0x000028, "Member 'FDynamicHUDAllowed::Tag' has a wrong offset!");
static_assert(offsetof(FDynamicHUDAllowed, LayoutConstraints) == 0x000030, "Member 'FDynamicHUDAllowed::LayoutConstraints' has a wrong offset!");

// ScriptStruct DynamicHUD.WidgetCatalogEntryClass
// 0x0028 (0x0028 - 0x0000)
struct FWidgetCatalogEntryClass final 
{
public:
	TSoftClassPtr<class UClass>                   WidgetClass;                                       // 0x0000(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FWidgetCatalogEntryClass) == 0x000008, "Wrong alinment on FWidgetCatalogEntryClass");
static_assert(sizeof(FWidgetCatalogEntryClass) == 0x000028, "Wrong size on FWidgetCatalogEntryClass");
static_assert(offsetof(FWidgetCatalogEntryClass, WidgetClass) == 0x000000, "Member 'FWidgetCatalogEntryClass::WidgetClass' has a wrong offset!");

}

