#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EmergencyNoticeWidgetBR

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass EmergencyNoticeWidgetBR.EmergencyNoticeWidgetBR_C
// 0x0028 (0x02B8 - 0x0290)
class UEmergencyNoticeWidgetBR_C final  : public UEmergencyNoticeBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Entrance;                                          // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       BodyText;                                          // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TitleText;                                         // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               VisibilitySB;                                      // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Show_Notice(class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue);
	void ShowNotice(class FText& Title, class FText& Body);
	void HideNotice();
	void ExecuteUbergraph_EmergencyNoticeWidgetBR(int32 EntryPoint, class FText K2Node_Event_Title, class FText K2Node_Event_Body, class FText CallFunc_TextToUpper_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EmergencyNoticeWidgetBR_C">();
	}
	static class UEmergencyNoticeWidgetBR_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEmergencyNoticeWidgetBR_C>();
	}
};
static_assert(alignof(UEmergencyNoticeWidgetBR_C) == 0x000008, "Wrong alinment on UEmergencyNoticeWidgetBR_C");
static_assert(sizeof(UEmergencyNoticeWidgetBR_C) == 0x0002B8, "Wrong size on UEmergencyNoticeWidgetBR_C");
static_assert(offsetof(UEmergencyNoticeWidgetBR_C, UberGraphFrame) == 0x000290, "Member 'UEmergencyNoticeWidgetBR_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UEmergencyNoticeWidgetBR_C, Entrance) == 0x000298, "Member 'UEmergencyNoticeWidgetBR_C::Entrance' has a wrong offset!");
static_assert(offsetof(UEmergencyNoticeWidgetBR_C, BodyText) == 0x0002A0, "Member 'UEmergencyNoticeWidgetBR_C::BodyText' has a wrong offset!");
static_assert(offsetof(UEmergencyNoticeWidgetBR_C, TitleText) == 0x0002A8, "Member 'UEmergencyNoticeWidgetBR_C::TitleText' has a wrong offset!");
static_assert(offsetof(UEmergencyNoticeWidgetBR_C, VisibilitySB) == 0x0002B0, "Member 'UEmergencyNoticeWidgetBR_C::VisibilitySB' has a wrong offset!");

}

