#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Entity_Physics_PhysicsTrace

#include "Basic.hpp"

#include "Interop_CoroutineContext_classes.hpp"
#include "Entity_Physics_PhysicsTraceType_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Entity_Physics_PhysicsTraceCategory_structs.hpp"
#include "Entity_Physics_PhysicsTraceShape_structs.hpp"
#include "Entity_Physics_PhysicsTraceChannel_structs.hpp"


namespace SDK
{

// SolarisGeneratedClass Entity_Physics_PhysicsTrace.Context_PhysicsTrace_WaitPhysicsTrace
// 0x0018 (0x00B0 - 0x0098)
class UContext_PhysicsTrace_WaitPhysicsTrace final  : public UCoroutineContext
{
public:
	class UPhysicsTrace*                          _Self;                                             // 0x0098(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UHitResult*>                     _RetVal;                                           // 0x00A0(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)

public:
	int32 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Context_PhysicsTrace_WaitPhysicsTrace">();
	}
	static class UContext_PhysicsTrace_WaitPhysicsTrace* GetDefaultObj()
	{
		return GetDefaultObjImpl<UContext_PhysicsTrace_WaitPhysicsTrace>();
	}
};
static_assert(alignof(UContext_PhysicsTrace_WaitPhysicsTrace) == 0x000008, "Wrong alinment on UContext_PhysicsTrace_WaitPhysicsTrace");
static_assert(sizeof(UContext_PhysicsTrace_WaitPhysicsTrace) == 0x0000B0, "Wrong size on UContext_PhysicsTrace_WaitPhysicsTrace");
static_assert(offsetof(UContext_PhysicsTrace_WaitPhysicsTrace, _Self) == 0x000098, "Member 'UContext_PhysicsTrace_WaitPhysicsTrace::_Self' has a wrong offset!");
static_assert(offsetof(UContext_PhysicsTrace_WaitPhysicsTrace, _RetVal) == 0x0000A0, "Member 'UContext_PhysicsTrace_WaitPhysicsTrace::_RetVal' has a wrong offset!");

// SolarisGeneratedClass Entity_Physics_PhysicsTrace.PhysicsTrace
// 0x0098 (0x00C0 - 0x0028)
class UPhysicsTrace final  : public UObject
{
public:
	uint8                                         Pad_66D8[0x98];                                    // 0x0028(0x0098)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _InitCDO();
	void _InitInstance();
	void InitPhysicsTrace(class UObject* __verse_0x9866B8E7_contextObject, EPhysicsTraceCategory __verse_0x8D8FA293_traceCategory, EPhysicsTraceType __verse_0xA0F73428_traceType, EPhysicsTraceShape __verse_0x30682E54_traceShape, EPhysicsTraceChannel __verse_0x54D810ED_traceChannel, class UVector3* __verse_0xA0F336DD_start, class UVector3* __verse_0xAA0F01BA_end, uint8 __verse_0x598FB218_ignoreCallingEntity, class UVector3* __verse_0x55F5C86E_traceExtent, float __verse_0x159DEA67_traceRadius, const class FString& __verse_0xD1A8CE6F_profileName);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PhysicsTrace">();
	}
	static class UPhysicsTrace* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPhysicsTrace>();
	}
};
static_assert(alignof(UPhysicsTrace) == 0x000008, "Wrong alinment on UPhysicsTrace");
static_assert(sizeof(UPhysicsTrace) == 0x0000C0, "Wrong size on UPhysicsTrace");

}

