#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Entity_ScriptComponent

#include "Basic.hpp"


namespace SDK::Params
{

// Function Entity_ScriptComponent.ScriptComponent.IsEnabled
// 0x0001 (0x0001 - 0x0000)
struct ScriptComponent_IsEnabled final 
{
public:
	uint8                                         RetVal : 1;                                        // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor))
};
static_assert(alignof(ScriptComponent_IsEnabled) == 0x000001, "Wrong alinment on ScriptComponent_IsEnabled");
static_assert(sizeof(ScriptComponent_IsEnabled) == 0x000001, "Wrong size on ScriptComponent_IsEnabled");

// Function Entity_ScriptComponent.ScriptComponent.addToCreateComponentList
// 0x0010 (0x0010 - 0x0000)
struct ScriptComponent_AddToCreateComponentList final 
{
public:
	TArray<class UClass*>                         __verse_0xC3E99120_components;                     // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
};
static_assert(alignof(ScriptComponent_AddToCreateComponentList) == 0x000008, "Wrong alinment on ScriptComponent_AddToCreateComponentList");
static_assert(sizeof(ScriptComponent_AddToCreateComponentList) == 0x000010, "Wrong size on ScriptComponent_AddToCreateComponentList");
static_assert(offsetof(ScriptComponent_AddToCreateComponentList, __verse_0xC3E99120_components) == 0x000000, "Member 'ScriptComponent_AddToCreateComponentList::__verse_0xC3E99120_components' has a wrong offset!");

// Function Entity_ScriptComponent.ScriptComponent.addToRequiredComponentList
// 0x0010 (0x0010 - 0x0000)
struct ScriptComponent_AddToRequiredComponentList final 
{
public:
	TArray<class UClass*>                         __verse_0xC3E99120_components;                     // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
};
static_assert(alignof(ScriptComponent_AddToRequiredComponentList) == 0x000008, "Wrong alinment on ScriptComponent_AddToRequiredComponentList");
static_assert(sizeof(ScriptComponent_AddToRequiredComponentList) == 0x000010, "Wrong size on ScriptComponent_AddToRequiredComponentList");
static_assert(offsetof(ScriptComponent_AddToRequiredComponentList, __verse_0xC3E99120_components) == 0x000000, "Member 'ScriptComponent_AddToRequiredComponentList::__verse_0xC3E99120_components' has a wrong offset!");

// Function Entity_ScriptComponent.ScriptComponent.getAllComponentsOfType
// 0x0018 (0x0018 - 0x0000)
struct ScriptComponent_GetAllComponentsOfType final 
{
public:
	class UClass*                                 __verse_0x159E825F_componentType;                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UEntityComponent*>               RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(ScriptComponent_GetAllComponentsOfType) == 0x000008, "Wrong alinment on ScriptComponent_GetAllComponentsOfType");
static_assert(sizeof(ScriptComponent_GetAllComponentsOfType) == 0x000018, "Wrong size on ScriptComponent_GetAllComponentsOfType");
static_assert(offsetof(ScriptComponent_GetAllComponentsOfType, __verse_0x159E825F_componentType) == 0x000000, "Member 'ScriptComponent_GetAllComponentsOfType::__verse_0x159E825F_componentType' has a wrong offset!");
static_assert(offsetof(ScriptComponent_GetAllComponentsOfType, RetVal) == 0x000008, "Member 'ScriptComponent_GetAllComponentsOfType::RetVal' has a wrong offset!");

// Function Entity_ScriptComponent.ScriptComponent.getComponentOfType
// 0x0010 (0x0010 - 0x0000)
struct ScriptComponent_GetComponentOfType final 
{
public:
	class UClass*                                 __verse_0x159E825F_componentType;                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEntityComponent*                       RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ScriptComponent_GetComponentOfType) == 0x000008, "Wrong alinment on ScriptComponent_GetComponentOfType");
static_assert(sizeof(ScriptComponent_GetComponentOfType) == 0x000010, "Wrong size on ScriptComponent_GetComponentOfType");
static_assert(offsetof(ScriptComponent_GetComponentOfType, __verse_0x159E825F_componentType) == 0x000000, "Member 'ScriptComponent_GetComponentOfType::__verse_0x159E825F_componentType' has a wrong offset!");
static_assert(offsetof(ScriptComponent_GetComponentOfType, RetVal) == 0x000008, "Member 'ScriptComponent_GetComponentOfType::RetVal' has a wrong offset!");

// Function Entity_ScriptComponent.ScriptComponent.GetFullName
// 0x0010 (0x0010 - 0x0000)
struct ScriptComponent_GetFullName final 
{
public:
	class FString                                 RetVal;                                            // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(ScriptComponent_GetFullName) == 0x000008, "Wrong alinment on ScriptComponent_GetFullName");
static_assert(sizeof(ScriptComponent_GetFullName) == 0x000010, "Wrong size on ScriptComponent_GetFullName");
static_assert(offsetof(ScriptComponent_GetFullName, RetVal) == 0x000000, "Member 'ScriptComponent_GetFullName::RetVal' has a wrong offset!");

// Function Entity_ScriptComponent.ScriptComponent.GetName
// 0x0010 (0x0010 - 0x0000)
struct ScriptComponent_GetName final 
{
public:
	class FString                                 RetVal;                                            // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(ScriptComponent_GetName) == 0x000008, "Wrong alinment on ScriptComponent_GetName");
static_assert(sizeof(ScriptComponent_GetName) == 0x000010, "Wrong size on ScriptComponent_GetName");
static_assert(offsetof(ScriptComponent_GetName, RetVal) == 0x000000, "Member 'ScriptComponent_GetName::RetVal' has a wrong offset!");

// Function Entity_ScriptComponent.ScriptComponent.OnEnabledChanged
// 0x0001 (0x0001 - 0x0000)
struct ScriptComponent_OnEnabledChanged final 
{
public:
	uint8                                         __verse_0x09FAA202_IsEnabled : 1;                  // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, NoDestructor))
};
static_assert(alignof(ScriptComponent_OnEnabledChanged) == 0x000001, "Wrong alinment on ScriptComponent_OnEnabledChanged");
static_assert(sizeof(ScriptComponent_OnEnabledChanged) == 0x000001, "Wrong size on ScriptComponent_OnEnabledChanged");

// Function Entity_ScriptComponent.ScriptComponent.OnTick
// 0x0004 (0x0004 - 0x0000)
struct ScriptComponent_OnTick final 
{
public:
	float                                         __verse_0xEDA0BF94_DeltaTime;                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ScriptComponent_OnTick) == 0x000004, "Wrong alinment on ScriptComponent_OnTick");
static_assert(sizeof(ScriptComponent_OnTick) == 0x000004, "Wrong size on ScriptComponent_OnTick");
static_assert(offsetof(ScriptComponent_OnTick, __verse_0xEDA0BF94_DeltaTime) == 0x000000, "Member 'ScriptComponent_OnTick::__verse_0xEDA0BF94_DeltaTime' has a wrong offset!");

// Function Entity_ScriptComponent.ScriptComponent.SetEnabled
// 0x0001 (0x0001 - 0x0000)
struct ScriptComponent_SetEnabled final 
{
public:
	uint8                                         __verse_0x09FAA202_IsEnabled : 1;                  // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, NoDestructor))
};
static_assert(alignof(ScriptComponent_SetEnabled) == 0x000001, "Wrong alinment on ScriptComponent_SetEnabled");
static_assert(sizeof(ScriptComponent_SetEnabled) == 0x000001, "Wrong size on ScriptComponent_SetEnabled");

// Function Entity_ScriptComponent.ScriptComponent.SetTickEnabled
// 0x0001 (0x0001 - 0x0000)
struct ScriptComponent_SetTickEnabled final 
{
public:
	uint8                                         __verse_0xD50E43B9_InIsEnabled : 1;                // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, NoDestructor))
};
static_assert(alignof(ScriptComponent_SetTickEnabled) == 0x000001, "Wrong alinment on ScriptComponent_SetTickEnabled");
static_assert(sizeof(ScriptComponent_SetTickEnabled) == 0x000001, "Wrong size on ScriptComponent_SetTickEnabled");

}

