#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EventsSimpleButton

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass EventsSimpleButton.EventsSimpleButton_C
// 0x00D8 (0x0C78 - 0x0BA0)
class UEventsSimpleButton_C final  : public UCommonButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BA0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Pressed;                                           // 0x0BA8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x0BB0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       CenterButtonTextWidget;                            // 0x0BB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_VariablePadding;                      // 0x0BC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ButtonTop;                                   // 0x0BC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Shadow;                                      // 0x0BD0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_ButtonBG;                                  // 0x0BD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          ToUpper;                                           // 0x0BE0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          XL;                                                // 0x0BE1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_77A7[0x6];                                     // 0x0BE2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ButtonNameText;                                    // 0x0BE8(0x0018)(Edit, BlueprintVisible)
	TMap<class FString, struct FLinearColor>      Color;                                             // 0x0C00(0x0050)(Edit, BlueprintVisible)
	struct FLinearColor                           GamepadButtonTextColor;                            // 0x0C50(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DefaultTextColor;                                  // 0x0C60(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              ButtonPadding;                                     // 0x0C70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	struct FEventReply OnMouseButtonUp(const struct FGeometry& MyGeometry, struct FPointerEvent& MouseEvent, float Temp_float_Variable, bool Temp_bool_Variable, const struct FEventReply& CallFunc_Unhandled_ReturnValue, float CallFunc_PauseAnimation_ReturnValue, float CallFunc_GetStartTime_ReturnValue, float CallFunc_PauseAnimation_ReturnValue_1, bool CallFunc_LessEqual_FloatFloat_ReturnValue, float CallFunc_Add_FloatFloat_ReturnValue, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue, float CallFunc_GetEndTime_ReturnValue, float CallFunc_Subtract_FloatFloat_ReturnValue, float K2Node_Select_Default, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue_1);
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, struct FPointerEvent& MouseEvent, float Temp_float_Variable, bool Temp_bool_Variable, const struct FEventReply& CallFunc_Unhandled_ReturnValue, float CallFunc_PauseAnimation_ReturnValue, float CallFunc_GetStartTime_ReturnValue, float CallFunc_PauseAnimation_ReturnValue_1, bool CallFunc_LessEqual_FloatFloat_ReturnValue, float CallFunc_Add_FloatFloat_ReturnValue, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue, float CallFunc_GetEndTime_ReturnValue, float CallFunc_Subtract_FloatFloat_ReturnValue, float K2Node_Select_Default, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue_1);
	void Construct();
	void BP_OnHovered();
	void BP_OnUnhovered();
	void BP_OnClicked();
	void BndEvt__CommonActionWidgetAction_K2Node_ComponentBoundEvent_0_OnInputMethodChanged__DelegateSignature(bool bUsingGamepad);
	void PreConstruct(bool IsDesignTime);
	void InputTypeChanged(bool bUsingGamepad);
	void UpdateColor(class FString& ParameterName, const struct FLinearColor& New_Color);
	void ExecuteUbergraph_EventsSimpleButton(int32 EntryPoint, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, bool Temp_bool_Variable, bool Temp_bool_Variable_1, bool Temp_bool_Variable_2, class FString& Temp_string_Variable, class FString& Temp_string_Variable_1, class FString& Temp_string_Variable_2, class FString& Temp_string_Variable_3, class FString& Temp_string_Variable_4, class UMaterialInstanceDynamic* CallFunc_GetDynamicFontMaterial_ReturnValue, float CallFunc_GetStartTime_ReturnValue, float CallFunc_GetEndTime_ReturnValue, float CallFunc_GetStartTime_ReturnValue_1, float CallFunc_GetEndTime_ReturnValue_1, float CallFunc_PauseAnimation_ReturnValue, float CallFunc_PauseAnimation_ReturnValue_1, bool CallFunc_LessEqual_FloatFloat_ReturnValue, float CallFunc_Add_FloatFloat_ReturnValue, float CallFunc_Subtract_FloatFloat_ReturnValue, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue, float CallFunc_PauseAnimation_ReturnValue_2, float CallFunc_PauseAnimation_ReturnValue_3, bool CallFunc_LessEqual_FloatFloat_ReturnValue_1, float CallFunc_Add_FloatFloat_ReturnValue_1, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue_1, float CallFunc_Subtract_FloatFloat_ReturnValue_1, bool K2Node_ComponentBoundEvent_bUsingGamepad, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue_2, class FText CallFunc_TextToUpper_ReturnValue, class FString& Temp_string_Variable_5, bool K2Node_Event_IsDesignTime, bool K2Node_CustomEvent_bUsingGamepad, class FString& Temp_string_Variable_6, ESlateVisibility Temp_byte_Variable_2, const struct FLinearColor& CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, const struct FLinearColor& CallFunc_Map_Find_Value_1, bool CallFunc_Map_Find_ReturnValue_1, const struct FLinearColor& CallFunc_Map_Find_Value_2, bool CallFunc_Map_Find_ReturnValue_2, ESlateVisibility Temp_byte_Variable_3, float CallFunc_BreakColor_R, float CallFunc_BreakColor_G, float CallFunc_BreakColor_B, float CallFunc_BreakColor_A, bool CallFunc_LessEqual_FloatFloat_ReturnValue_2, ESlateVisibility K2Node_Select_Default, const struct FLinearColor& CallFunc_Map_Find_Value_3, bool CallFunc_Map_Find_ReturnValue_3, const struct FLinearColor& CallFunc_Map_Find_Value_4, bool CallFunc_Map_Find_ReturnValue_4, const struct FLinearColor& CallFunc_Map_Find_Value_5, bool CallFunc_Map_Find_ReturnValue_5, const struct FLinearColor& CallFunc_Map_Find_Value_6, bool CallFunc_Map_Find_ReturnValue_6, bool Temp_bool_Variable_3, class UFortGlobalUIContext* CallFunc_GetContext_ReturnValue, bool Temp_bool_Variable_4, bool CallFunc_IsUsingGamepad_ReturnValue, class FText K2Node_Select_Default_1, ESlateVisibility K2Node_Select_Default_2, class UMaterialInstanceDynamic* CallFunc_GetDynamicMaterial_ReturnValue, class UMaterialInstanceDynamic* CallFunc_GetDynamicFontMaterial_ReturnValue_1, float Temp_float_Variable, bool Temp_bool_Variable_5, const struct FLinearColor& K2Node_Select_Default_3, float K2Node_Select_Default_4, float Temp_float_Variable_1, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue_3, float K2Node_Select_Default_5, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue_4, class FString& K2Node_CustomEvent_ParameterName, const struct FLinearColor& K2Node_CustomEvent_New_Color, float CallFunc_BreakVector2D_X, float CallFunc_BreakVector2D_Y, const struct FMargin& K2Node_MakeStruct_Margin);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EventsSimpleButton_C">();
	}
	static class UEventsSimpleButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEventsSimpleButton_C>();
	}
};
static_assert(alignof(UEventsSimpleButton_C) == 0x000008, "Wrong alinment on UEventsSimpleButton_C");
static_assert(sizeof(UEventsSimpleButton_C) == 0x000C78, "Wrong size on UEventsSimpleButton_C");
static_assert(offsetof(UEventsSimpleButton_C, UberGraphFrame) == 0x000BA0, "Member 'UEventsSimpleButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UEventsSimpleButton_C, Pressed) == 0x000BA8, "Member 'UEventsSimpleButton_C::Pressed' has a wrong offset!");
static_assert(offsetof(UEventsSimpleButton_C, Hover) == 0x000BB0, "Member 'UEventsSimpleButton_C::Hover' has a wrong offset!");
static_assert(offsetof(UEventsSimpleButton_C, CenterButtonTextWidget) == 0x000BB8, "Member 'UEventsSimpleButton_C::CenterButtonTextWidget' has a wrong offset!");
static_assert(offsetof(UEventsSimpleButton_C, CommonBorder_VariablePadding) == 0x000BC0, "Member 'UEventsSimpleButton_C::CommonBorder_VariablePadding' has a wrong offset!");
static_assert(offsetof(UEventsSimpleButton_C, Image_ButtonTop) == 0x000BC8, "Member 'UEventsSimpleButton_C::Image_ButtonTop' has a wrong offset!");
static_assert(offsetof(UEventsSimpleButton_C, Image_Shadow) == 0x000BD0, "Member 'UEventsSimpleButton_C::Image_Shadow' has a wrong offset!");
static_assert(offsetof(UEventsSimpleButton_C, Overlay_ButtonBG) == 0x000BD8, "Member 'UEventsSimpleButton_C::Overlay_ButtonBG' has a wrong offset!");
static_assert(offsetof(UEventsSimpleButton_C, ToUpper) == 0x000BE0, "Member 'UEventsSimpleButton_C::ToUpper' has a wrong offset!");
static_assert(offsetof(UEventsSimpleButton_C, XL) == 0x000BE1, "Member 'UEventsSimpleButton_C::XL' has a wrong offset!");
static_assert(offsetof(UEventsSimpleButton_C, ButtonNameText) == 0x000BE8, "Member 'UEventsSimpleButton_C::ButtonNameText' has a wrong offset!");
static_assert(offsetof(UEventsSimpleButton_C, Color) == 0x000C00, "Member 'UEventsSimpleButton_C::Color' has a wrong offset!");
static_assert(offsetof(UEventsSimpleButton_C, GamepadButtonTextColor) == 0x000C50, "Member 'UEventsSimpleButton_C::GamepadButtonTextColor' has a wrong offset!");
static_assert(offsetof(UEventsSimpleButton_C, DefaultTextColor) == 0x000C60, "Member 'UEventsSimpleButton_C::DefaultTextColor' has a wrong offset!");
static_assert(offsetof(UEventsSimpleButton_C, ButtonPadding) == 0x000C70, "Member 'UEventsSimpleButton_C::ButtonPadding' has a wrong offset!");

}

