#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EventLeaderboardScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass EventLeaderboardScreen.EventLeaderboardScreen_C
// 0x0238 (0x0670 - 0x0438)
class UEventLeaderboardScreen_C final  : public UFortEventLeaderboardScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0438(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UEventsSimpleButton_C*                  Button_Back;                                       // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCloseButton_C*                         CloseButton;                                       // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEventLeaderboardEntryDetails_C*        EntryDetails;                                      // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEventLeaderboardEventDetails_C*        EventLeaderboardEventDetails;                      // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_Tab;                                 // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_EntryDetailsVisibility;                    // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortEventLeaderboardEntryData*         DebugLeaderboardEntry1;                            // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortEventLeaderboardEntryData*         DebugLeaderboardEntry2;                            // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortEventLeaderboardEntryData*         DebugLeaderboardEntry3;                            // 0x0488(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortEventLeaderboardEntryData*         DebugLeaderboardEntry4;                            // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UFortEventLeaderboardEntryData*> DebugLeaderboardEntries;                           // 0x0498(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             EventCloseButton;                                  // 0x04A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             EventViewLiveGames;                                // 0x04B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FFortTournamentDisplayInfo             CurrentDisplayInfo;                                // 0x04C8(0x01A8)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void EventCloseButton__DelegateSignature();
	void EventViewLiveGames__DelegateSignature();
	void ExecuteUbergraph_EventLeaderboardScreen(int32 EntryPoint, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, bool Temp_bool_Variable, ESlateVisibility Temp_byte_Variable_2, ESlateVisibility Temp_byte_Variable_3, class UFortEventLeaderboardEntryData* K2Node_Event_EntryData, bool Temp_bool_Variable_1, class UCommonButton* K2Node_CustomEvent_Button, class UFortEventLeaderboardEntryData* CallFunc_GetMyLeaderboardEntry_ReturnValue, class UCommonButton* K2Node_ComponentBoundEvent_Button_2, class UListView* CallFunc_GetListView_ReturnValue, class ULeaderboardListViewWrapper_C* K2Node_DynamicCast_AsLeaderboard_List_View_Wrapper, bool K2Node_DynamicCast_bSuccess, class UObject* K2Node_CustomEvent_Item, class UFortEventLeaderboardEntryData* K2Node_DynamicCast_AsFort_Event_Leaderboard_Entry_Data, bool K2Node_DynamicCast_bSuccess_1, class ULeaderboardTab_C* K2Node_DynamicCast_AsLeaderboard_Tab, bool K2Node_DynamicCast_bSuccess_2, bool K2Node_Event_bIsVisible, class UCommonButton* K2Node_ComponentBoundEvent_Button_1, ESlateVisibility K2Node_Select_Default, class UEventsSimpleButton_C* K2Node_DynamicCast_AsEvents_Simple_Button, bool K2Node_DynamicCast_bSuccess_3, TDelegate<void(class UObject* Item)> K2Node_CreateDelegate_OutputDelegate, class UCommonButton* K2Node_Event_TabButton, class FText K2Node_Event_TabText, class UEventsSimpleTab_C* K2Node_DynamicCast_AsEvents_Simple_Tab, bool K2Node_DynamicCast_bSuccess_4, TDelegate<void(class UCommonButton* Button)> K2Node_CreateDelegate_OutputDelegate_1, const struct FFortTournamentDisplayInfo& K2Node_CustomEvent_TournamentDisplayInfo, bool K2Node_Event_bShowDetailsPanel, ESlateVisibility K2Node_Select_Default_1, class UCommonButton* K2Node_ComponentBoundEvent_Button);
	void BndEvt__Button_Back2_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnDetailsPanelUpdate(bool bShowDetailsPanel);
	void EventColorize(const struct FFortTournamentDisplayInfo& TournamentDisplayInfo);
	void InitializeTabButton(class UCommonButton* TabButton, class FText& TabText);
	void BndEvt__LiveGames_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnTabVisibilityChange(bool bIsVisible);
	void Item_DoubleMinusClicked(class UObject* Item);
	void BndEvt__CloseButton_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void ShowMyStats(class UCommonButton* Button);
	void Construct();
	void Event_Leaderboard_Screen_On_Activated();
	void OnLeaderboardEntrySelected(class UFortEventLeaderboardEntryData* EntryData);
	void EventIntro();
	void Init(const class FString& EventWindowId, const class FString& TournamentSeriesId, ESlateVisibility CallFunc_GetVisibility_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue, class ULeaderboardTab_C* K2Node_DynamicCast_AsLeaderboard_Tab, bool K2Node_DynamicCast_bSuccess);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EventLeaderboardScreen_C">();
	}
	static class UEventLeaderboardScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEventLeaderboardScreen_C>();
	}
};
static_assert(alignof(UEventLeaderboardScreen_C) == 0x000008, "Wrong alinment on UEventLeaderboardScreen_C");
static_assert(sizeof(UEventLeaderboardScreen_C) == 0x000670, "Wrong size on UEventLeaderboardScreen_C");
static_assert(offsetof(UEventLeaderboardScreen_C, UberGraphFrame) == 0x000438, "Member 'UEventLeaderboardScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardScreen_C, Button_Back) == 0x000440, "Member 'UEventLeaderboardScreen_C::Button_Back' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardScreen_C, CloseButton) == 0x000448, "Member 'UEventLeaderboardScreen_C::CloseButton' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardScreen_C, EntryDetails) == 0x000450, "Member 'UEventLeaderboardScreen_C::EntryDetails' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardScreen_C, EventLeaderboardEventDetails) == 0x000458, "Member 'UEventLeaderboardScreen_C::EventLeaderboardEventDetails' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardScreen_C, HorizontalBox_Tab) == 0x000460, "Member 'UEventLeaderboardScreen_C::HorizontalBox_Tab' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardScreen_C, Overlay_EntryDetailsVisibility) == 0x000468, "Member 'UEventLeaderboardScreen_C::Overlay_EntryDetailsVisibility' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardScreen_C, SafeZone_0) == 0x000470, "Member 'UEventLeaderboardScreen_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardScreen_C, DebugLeaderboardEntry1) == 0x000478, "Member 'UEventLeaderboardScreen_C::DebugLeaderboardEntry1' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardScreen_C, DebugLeaderboardEntry2) == 0x000480, "Member 'UEventLeaderboardScreen_C::DebugLeaderboardEntry2' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardScreen_C, DebugLeaderboardEntry3) == 0x000488, "Member 'UEventLeaderboardScreen_C::DebugLeaderboardEntry3' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardScreen_C, DebugLeaderboardEntry4) == 0x000490, "Member 'UEventLeaderboardScreen_C::DebugLeaderboardEntry4' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardScreen_C, DebugLeaderboardEntries) == 0x000498, "Member 'UEventLeaderboardScreen_C::DebugLeaderboardEntries' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardScreen_C, EventCloseButton) == 0x0004A8, "Member 'UEventLeaderboardScreen_C::EventCloseButton' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardScreen_C, EventViewLiveGames) == 0x0004B8, "Member 'UEventLeaderboardScreen_C::EventViewLiveGames' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardScreen_C, CurrentDisplayInfo) == 0x0004C8, "Member 'UEventLeaderboardScreen_C::CurrentDisplayInfo' has a wrong offset!");

}

