#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EventLeaderboardEventDetails

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass EventLeaderboardEventDetails.EventLeaderboardEventDetails_C
// 0x0020 (0x06D8 - 0x06B8)
class UEventLeaderboardEventDetails_C final  : public UFortShowdownDetailView
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       Text_EventName;                                    // 0x06C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_RegionName;                                   // 0x06C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_SessionName;                                  // 0x06D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void RefreshDataBP();
	void ExecuteUbergraph_EventLeaderboardEventDetails(int32 EntryPoint, class FText CallFunc_GetCurrentRegionName_ReturnValue, class FText CallFunc_TextToUpper_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array, class FText CallFunc_Format_ReturnValue, class FText CallFunc_TextToUpper_ReturnValue_1, class FText CallFunc_TextToUpper_ReturnValue_2, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_1, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_2, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array_1, class FText CallFunc_Format_ReturnValue_1);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EventLeaderboardEventDetails_C">();
	}
	static class UEventLeaderboardEventDetails_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEventLeaderboardEventDetails_C>();
	}
};
static_assert(alignof(UEventLeaderboardEventDetails_C) == 0x000008, "Wrong alinment on UEventLeaderboardEventDetails_C");
static_assert(sizeof(UEventLeaderboardEventDetails_C) == 0x0006D8, "Wrong size on UEventLeaderboardEventDetails_C");
static_assert(offsetof(UEventLeaderboardEventDetails_C, UberGraphFrame) == 0x0006B8, "Member 'UEventLeaderboardEventDetails_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEventDetails_C, Text_EventName) == 0x0006C0, "Member 'UEventLeaderboardEventDetails_C::Text_EventName' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEventDetails_C, Text_RegionName) == 0x0006C8, "Member 'UEventLeaderboardEventDetails_C::Text_RegionName' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEventDetails_C, Text_SessionName) == 0x0006D0, "Member 'UEventLeaderboardEventDetails_C::Text_SessionName' has a wrong offset!");

}

