#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ExplosiveBowLayerAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ExplosiveBowLayerAnimBP.ExplosiveBowLayerAnimBP_C
// 0x2600 (0x2A20 - 0x0420)
class UExplosiveBowLayerAnimBP_C final  : public UFortItemLayerAnimInstance_ExplosiveBow
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0420(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimInstanceSubsystemData             AnimBlueprintClassSubsystem_PropertyAccess;        // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E51[0x7];                                     // 0x0429(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_Root                         AnimGraphNode_Root_34;                             // 0x0430(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_17;                  // 0x0460(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_33;                             // 0x04E8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_16;                  // 0x0518(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_32;                             // 0x05A0(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_15;                  // 0x05D0(0x0088)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_14;                  // 0x0658(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_31;                             // 0x06E0(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_13;                  // 0x0710(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_30;                             // 0x0798(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_29;                             // 0x07C8(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_28;                             // 0x07F8(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_27;                             // 0x0828(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_26;                             // 0x0858(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_25;                             // 0x0888(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_12;                  // 0x08B8(0x0088)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x0940(0x00E0)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace;            // 0x0A20(0x0188)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_16;                   // 0x0BA8(0x0078)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x0C20(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x0CE8(0x00E0)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_1;                   // 0x0DC8(0x00B0)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum;                     // 0x0E78(0x00B0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_15;                   // 0x0F28(0x0078)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_8;                   // 0x0FA0(0x00A0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_24;                             // 0x1040(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_11;                  // 0x1070(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_23;                             // 0x10F8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_10;                  // 0x1128(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_22;                             // 0x11B0(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_21;                             // 0x11E0(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_20;                             // 0x1210(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_14;                   // 0x1240(0x0078)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_7;                   // 0x12B8(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_13;                   // 0x1358(0x0078)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_6;                   // 0x13D0(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_12;                   // 0x1470(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_19;                             // 0x14E8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_11;                   // 0x1518(0x0078)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_5;                   // 0x1590(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_10;                   // 0x1630(0x0078)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_4;                   // 0x16A8(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9;                    // 0x1748(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_18;                             // 0x17C0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8;                    // 0x17F0(0x0078)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0x1868(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0x1908(0x0078)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x1980(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x1A20(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_17;                             // 0x1A98(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x1AC8(0x0078)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x1B40(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x1BE0(0x0078)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x1C58(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x1CF8(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_16;                             // 0x1D70(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x1DA0(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_15;                             // 0x1E18(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x1E48(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_14;                             // 0x1EC0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x1EF0(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_13;                             // 0x1F68(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_12;                             // 0x1F98(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_11;                             // 0x1FC8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_9;                   // 0x1FF8(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_10;                             // 0x2080(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_8;                   // 0x20B0(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_9;                              // 0x2138(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_7;                   // 0x2168(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_8;                              // 0x21F0(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_6;                   // 0x2220(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_7;                              // 0x22A8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_5;                   // 0x22D8(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_6;                              // 0x2360(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_4;                   // 0x2390(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_5;                              // 0x2418(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_3;                   // 0x2448(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_4;                              // 0x24D0(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x2500(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x2588(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x25B8(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x2640(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x2670(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x26F8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_SubInput;                            // 0x2728(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x27B0(0x0030)()
	struct FFortAnimInput_AdjustedAim             InputParam;                                        // 0x27E0(0x0240)(BlueprintReadOnly, NoDestructor)

public:
	void ExecuteUbergraph_ExplosiveBowLayerAnimBP(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void ItemRelaxedEntry(const struct FPoseLink& InPoseRelaxedEntry, struct FPoseLink* Param_ItemRelaxedEntry);
	void ItemLowerBodyJogPostPivot(const struct FPoseLink& InPoseLowerBodyJogPostPivot, struct FPoseLink* Param_ItemLowerBodyJogPostPivot);
	void ItemLowerBodyJogPrePivot(const struct FPoseLink& InPoseLowerBodyJogPrePivot, struct FPoseLink* Param_ItemLowerBodyJogPrePivot);
	void ItemLowerBodyJogStop(const struct FPoseLink& InPoseLowerBodyJogStop, struct FPoseLink* Param_ItemLowerBodyJogStop);
	void ItemLowerBodyJogStart(const struct FPoseLink& InPoseLowerBodyJogStart, struct FPoseLink* Param_ItemLowerBodyJogStart);
	void ItemLowerBodyLeanAdditive(const struct FPoseLink& InPoseLowerBodyLeanAdditive, struct FPoseLink* Param_ItemLowerBodyLeanAdditive);
