#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ExplosvieBow_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ExplosvieBow_AnimBP.ExplosvieBow_AnimBP_C
// 0x1200 (0x1620 - 0x0420)
class UExplosvieBow_AnimBP_C final  : public UFortBowWeaponAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0420(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimInstanceSubsystemData             AnimBlueprintClassSubsystem_PropertyAccess;        // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C83[0x7];                                     // 0x0429(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0430(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x0460(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x04A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x04D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x04F8(0x0028)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0520(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0540(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x0560(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0668(0x0108)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_3;                  // 0x0770(0x00E0)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_1;                   // 0x0850(0x00B0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x0900(0x0078)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum;                     // 0x0978(0x00B0)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_2;                     // 0x0A28(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x0AF0(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0B68(0x0078)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace;            // 0x0BE0(0x0188)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend;                         // 0x0D68(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_2;                  // 0x0E30(0x00E0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x0F10(0x00E0)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_1;                     // 0x0FF0(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x10B8(0x0030)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x10E8(0x0018)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x1100(0x00A0)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x11A0(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x1268(0x00E0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x1348(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x13C0(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x13F0(0x00B0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x14A0(0x00C0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x1560(0x0078)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x15D8(0x0048)()

public:
	void ExecuteUbergraph_ExplosvieBow_AnimBP(int32 EntryPoint, float CallFunc_GetCurveValue_ReturnValue, float CallFunc_Multiply_FloatFloat_ReturnValue, const struct FRotator& CallFunc_MakeRotator_ReturnValue, const struct FRotator& CallFunc_MakeRotator_ReturnValue_1);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ExplosvieBow_AnimBP_AnimGraphNode_ModifyBone_0E1011B841DA7A109A69F18ED59C9A93();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ExplosvieBow_AnimBP_AnimGraphNode_ModifyBone_D0BC44E84FB0F05DC49A24B18D5B2D51();
	void AnimGraph(struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ExplosvieBow_AnimBP_C">();
	}
	static class UExplosvieBow_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UExplosvieBow_AnimBP_C>();
	}
};
static_assert(alignof(UExplosvieBow_AnimBP_C) == 0x000010, "Wrong alinment on UExplosvieBow_AnimBP_C");
static_assert(sizeof(UExplosvieBow_AnimBP_C) == 0x001620, "Wrong size on UExplosvieBow_AnimBP_C");
static_assert(offsetof(UExplosvieBow_AnimBP_C, UberGraphFrame) == 0x000420, "Member 'UExplosvieBow_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimBlueprintClassSubsystem_PropertyAccess) == 0x000428, "Member 'UExplosvieBow_AnimBP_C::AnimBlueprintClassSubsystem_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimGraphNode_Root) == 0x000430, "Member 'UExplosvieBow_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimGraphNode_Slot_1) == 0x000460, "Member 'UExplosvieBow_AnimBP_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimGraphNode_TransitionResult_2) == 0x0004A8, "Member 'UExplosvieBow_AnimBP_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimGraphNode_TransitionResult_1) == 0x0004D0, "Member 'UExplosvieBow_AnimBP_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimGraphNode_TransitionResult) == 0x0004F8, "Member 'UExplosvieBow_AnimBP_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x000520, "Member 'UExplosvieBow_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x000540, "Member 'UExplosvieBow_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimGraphNode_ModifyBone_1) == 0x000560, "Member 'UExplosvieBow_AnimBP_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimGraphNode_ModifyBone) == 0x000668, "Member 'UExplosvieBow_AnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimGraphNode_BlendSpacePlayer_3) == 0x000770, "Member 'UExplosvieBow_AnimBP_C::AnimGraphNode_BlendSpacePlayer_3' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimGraphNode_BlendListByEnum_1) == 0x000850, "Member 'UExplosvieBow_AnimBP_C::AnimGraphNode_BlendListByEnum_1' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimGraphNode_SequencePlayer_4) == 0x000900, "Member 'UExplosvieBow_AnimBP_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimGraphNode_BlendListByEnum) == 0x000978, "Member 'UExplosvieBow_AnimBP_C::AnimGraphNode_BlendListByEnum' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimGraphNode_ApplyAdditive_2) == 0x000A28, "Member 'UExplosvieBow_AnimBP_C::AnimGraphNode_ApplyAdditive_2' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimGraphNode_SequencePlayer_3) == 0x000AF0, "Member 'UExplosvieBow_AnimBP_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimGraphNode_SequencePlayer_2) == 0x000B68, "Member 'UExplosvieBow_AnimBP_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimGraphNode_RotationOffsetBlendSpace) == 0x000BE0, "Member 'UExplosvieBow_AnimBP_C::AnimGraphNode_RotationOffsetBlendSpace' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimGraphNode_TwoWayBlend) == 0x000D68, "Member 'UExplosvieBow_AnimBP_C::AnimGraphNode_TwoWayBlend' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimGraphNode_BlendSpacePlayer_2) == 0x000E30, "Member 'UExplosvieBow_AnimBP_C::AnimGraphNode_BlendSpacePlayer_2' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimGraphNode_BlendSpacePlayer_1) == 0x000F10, "Member 'UExplosvieBow_AnimBP_C::AnimGraphNode_BlendSpacePlayer_1' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimGraphNode_ApplyAdditive_1) == 0x000FF0, "Member 'UExplosvieBow_AnimBP_C::AnimGraphNode_ApplyAdditive_1' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimGraphNode_StateResult_1) == 0x0010B8, "Member 'UExplosvieBow_AnimBP_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimGraphNode_LocalRefPose) == 0x0010E8, "Member 'UExplosvieBow_AnimBP_C::AnimGraphNode_LocalRefPose' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimGraphNode_BlendListByBool) == 0x001100, "Member 'UExplosvieBow_AnimBP_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimGraphNode_ApplyAdditive) == 0x0011A0, "Member 'UExplosvieBow_AnimBP_C::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimGraphNode_BlendSpacePlayer) == 0x001268, "Member 'UExplosvieBow_AnimBP_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimGraphNode_SequencePlayer_1) == 0x001348, "Member 'UExplosvieBow_AnimBP_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimGraphNode_StateResult) == 0x0013C0, "Member 'UExplosvieBow_AnimBP_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimGraphNode_StateMachine) == 0x0013F0, "Member 'UExplosvieBow_AnimBP_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimGraphNode_LayeredBoneBlend) == 0x0014A0, "Member 'UExplosvieBow_AnimBP_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimGraphNode_SequencePlayer) == 0x001560, "Member 'UExplosvieBow_AnimBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UExplosvieBow_AnimBP_C, AnimGraphNode_Slot) == 0x0015D8, "Member 'UExplosvieBow_AnimBP_C::AnimGraphNode_Slot' has a wrong offset!");

}

