#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FancyToastWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FancyToastWidget.FancyToastWidget_C
// 0x00A8 (0x0330 - 0x0288)
class UFancyToastWidget_C final  : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0288(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Outro;                                             // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       Description;                                       // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       DescriptionRegular;                                // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               RegularToast;                                      // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SmallPreviewPortrait;                              // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               SpecialToast;                                      // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Title;                                             // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TitleRegular;                                      // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        TypeWidgetSwitcher;                                // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnFinishedToast;                                   // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TSoftObjectPtr<class UTexture2D>              Dev_TestImage;                                     // 0x02F0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnToastClicked;                                    // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          DoNotUseTimerToDismiss;                            // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	struct FEventReply OnMouseButtonUp(const struct FGeometry& MyGeometry, struct FPointerEvent& MouseEvent, const struct FEventReply& CallFunc_Unhandled_ReturnValue, int32 CallFunc_PointerEvent_GetPointerIndex_ReturnValue, int32 CallFunc_PointerEvent_GetUserIndex_ReturnValue, const struct FKey& CallFunc_PointerEvent_GetEffectingButton_ReturnValue, bool CallFunc_HasMouseCaptureByUser_ReturnValue, bool CallFunc_EqualEqual_KeyKey_ReturnValue, const struct FEventReply& CallFunc_Handled_ReturnValue, const struct FEventReply& CallFunc_ReleaseMouseCapture_ReturnValue);
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, struct FPointerEvent& MouseEvent, const struct FEventReply& CallFunc_Unhandled_ReturnValue, const struct FKey& CallFunc_PointerEvent_GetEffectingButton_ReturnValue, bool CallFunc_EqualEqual_KeyKey_ReturnValue, const struct FEventReply& CallFunc_Handled_ReturnValue, const struct FEventReply& CallFunc_CaptureMouse_ReturnValue);
	void SetAndShowText(class FText Text, class UCommonTextBlock* TextBlock, class UCommonTextBlock* LocalTextBlock, class FText LocalText, bool CallFunc_TextIsEmpty_ReturnValue, class FText CallFunc_TextToUpper_ReturnValue);
	void ShowToast(const struct FFortToastDisplayInfo& DisplayInfo, uint8 Temp_byte_Variable, class UWidget* K2Node_Select_Default);
	void OnLoaded_9A8F5ACC4328AC430C10CEB22D17B3C8(class UObject* Loaded);
	void OnShowToast(const struct FFortToastDisplayInfo& DispalyInfo);
	void Start_Toast_Animation();
	void On_Idle_Finished();
	void SimulateAthenaStoreToast();
	void Clicked();
	void CompleteToast();
	void RemoveWidget();
	void WidgetAnimationEvt_Intro_K2Node_WidgetAnimationEvent_0();
	void WidgetAnimationEvt_Intro_K2Node_WidgetAnimationEvent_1();
	void WidgetAnimationEvt_Outro_K2Node_WidgetAnimationEvent_2();
	void ExecuteUbergraph_FancyToastWidget(int32 EntryPoint, class UObject* K2Node_CustomEvent_Loaded, class UObject* Temp_object_Variable, class UTexture2D* K2Node_DynamicCast_AsTexture_2D, bool K2Node_DynamicCast_bSuccess, const struct FFortToastDisplayInfo& K2Node_CustomEvent_DispalyInfo, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue, bool CallFunc_IsAssetNull_ReturnValue, class UMaterialInstanceDynamic* CallFunc_GetDynamicMaterial_ReturnValue, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue_1, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, const struct FFortToastDisplayInfo& K2Node_MakeStruct_FortToastDisplayInfo, TDelegate<void(class UObject* Loaded)> K2Node_CreateDelegate_OutputDelegate_1);
	void OnToastClicked__DelegateSignature();
	void OnFinishedToast__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FancyToastWidget_C">();
	}
	static class UFancyToastWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFancyToastWidget_C>();
	}
};
static_assert(alignof(UFancyToastWidget_C) == 0x000008, "Wrong alinment on UFancyToastWidget_C");
static_assert(sizeof(UFancyToastWidget_C) == 0x000330, "Wrong size on UFancyToastWidget_C");
static_assert(offsetof(UFancyToastWidget_C, UberGraphFrame) == 0x000288, "Member 'UFancyToastWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFancyToastWidget_C, Outro) == 0x000290, "Member 'UFancyToastWidget_C::Outro' has a wrong offset!");
static_assert(offsetof(UFancyToastWidget_C, Intro) == 0x000298, "Member 'UFancyToastWidget_C::Intro' has a wrong offset!");
static_assert(offsetof(UFancyToastWidget_C, Description) == 0x0002A0, "Member 'UFancyToastWidget_C::Description' has a wrong offset!");
static_assert(offsetof(UFancyToastWidget_C, DescriptionRegular) == 0x0002A8, "Member 'UFancyToastWidget_C::DescriptionRegular' has a wrong offset!");
static_assert(offsetof(UFancyToastWidget_C, RegularToast) == 0x0002B0, "Member 'UFancyToastWidget_C::RegularToast' has a wrong offset!");
static_assert(offsetof(UFancyToastWidget_C, SmallPreviewPortrait) == 0x0002B8, "Member 'UFancyToastWidget_C::SmallPreviewPortrait' has a wrong offset!");
static_assert(offsetof(UFancyToastWidget_C, SpecialToast) == 0x0002C0, "Member 'UFancyToastWidget_C::SpecialToast' has a wrong offset!");
static_assert(offsetof(UFancyToastWidget_C, Title) == 0x0002C8, "Member 'UFancyToastWidget_C::Title' has a wrong offset!");
static_assert(offsetof(UFancyToastWidget_C, TitleRegular) == 0x0002D0, "Member 'UFancyToastWidget_C::TitleRegular' has a wrong offset!");
static_assert(offsetof(UFancyToastWidget_C, TypeWidgetSwitcher) == 0x0002D8, "Member 'UFancyToastWidget_C::TypeWidgetSwitcher' has a wrong offset!");
static_assert(offsetof(UFancyToastWidget_C, OnFinishedToast) == 0x0002E0, "Member 'UFancyToastWidget_C::OnFinishedToast' has a wrong offset!");
static_assert(offsetof(UFancyToastWidget_C, Dev_TestImage) == 0x0002F0, "Member 'UFancyToastWidget_C::Dev_TestImage' has a wrong offset!");
static_assert(offsetof(UFancyToastWidget_C, OnToastClicked) == 0x000318, "Member 'UFancyToastWidget_C::OnToastClicked' has a wrong offset!");
static_assert(offsetof(UFancyToastWidget_C, DoNotUseTimerToDismiss) == 0x000328, "Member 'UFancyToastWidget_C::DoNotUseTimerToDismiss' has a wrong offset!");

}

