#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FloppingRabbitLayerAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass FloppingRabbitLayerAnimBP.FloppingRabbitLayerAnimBP_C
// 0x1890 (0x1C80 - 0x03F0)
class UFloppingRabbitLayerAnimBP_C final  : public UFortItemLayerAnimInstance_FullLocomotion
{
public:
	uint8                                         Pad_57A5[0x8];                                     // 0x03E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimInstanceSubsystemData             AnimBlueprintClassSubsystem_PropertyAccess;        // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57A6[0x7];                                     // 0x03F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_Root                         AnimGraphNode_Root_34;                             // 0x0400(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_18;                  // 0x0430(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_33;                             // 0x04B8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_17;                  // 0x04E8(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_32;                             // 0x0570(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_16;                  // 0x05A0(0x0088)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_15;                  // 0x0628(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_31;                             // 0x06B0(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_14;                  // 0x06E0(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_30;                             // 0x0768(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9;                    // 0x0798(0x0078)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_4;                   // 0x0810(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8;                    // 0x08B0(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_29;                             // 0x0928(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0x0958(0x0078)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0x09D0(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x0A70(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_28;                             // 0x0AE8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x0B18(0x0078)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x0B90(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x0C30(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_27;                             // 0x0CA8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x0CD8(0x0078)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x0D50(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0DF0(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_26;                             // 0x0E68(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_13;                  // 0x0E98(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_25;                             // 0x0F20(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_12;                  // 0x0F50(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_24;                             // 0x0FD8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_11;                  // 0x1008(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_23;                             // 0x1090(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_22;                             // 0x10C0(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_21;                             // 0x10F0(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_20;                             // 0x1120(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_19;                             // 0x1150(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_18;                             // 0x1180(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_17;                             // 0x11B0(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_16;                             // 0x11E0(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_15;                             // 0x1210(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_14;                             // 0x1240(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_13;                             // 0x1270(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_12;                             // 0x12A0(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_10;                  // 0x12D0(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_11;                             // 0x1358(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_9;                   // 0x1388(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_10;                             // 0x1410(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_8;                   // 0x1440(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_9;                              // 0x14C8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_7;                   // 0x14F8(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_8;                              // 0x1580(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_6;                   // 0x15B0(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_7;                              // 0x1638(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_5;                   // 0x1668(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_6;                              // 0x16F0(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_4;                   // 0x1720(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_5;                              // 0x17A8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_3;                   // 0x17D8(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_4;                              // 0x1860(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x1890(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x1918(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x1948(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x19D0(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x1A00(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x1A88(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x1AB8(0x0078)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x1B30(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x1BD0(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1C48(0x0030)()
	bool                                          OneHandGrip;                                       // 0x1C78(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_FloppingRabbitLayerAnimBP(int32 EntryPoint, class APawn* CallFunc_TryGetPawnOwner_ReturnValue, class AFortPawn* K2Node_DynamicCast_AsFort_Pawn, bool K2Node_DynamicCast_bSuccess, float K2Node_Event_DeltaTimeX, class AB_FloppingRabbit_Weap_Athena_C* K2Node_DynamicCast_AsB_Flopping_Rabbit_Weap_Athena, bool K2Node_DynamicCast_bSuccess_1);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void ItemSwimJumpStart(struct FPoseLink* Param_ItemSwimJumpStart);
	void ItemRelaxedEntry(const struct FPoseLink& InPoseRelaxedEntry, struct FPoseLink* Param_ItemRelaxedEntry);
	void ItemLowerBodyJogPostPivot(const struct FPoseLink& InPoseLowerBodyJogPostPivot, struct FPoseLink* Param_ItemLowerBodyJogPostPivot);
	void ItemLowerBodyJogPrePivot(const struct FPoseLink& InPoseLowerBodyJogPrePivot, struct FPoseLink* Param_ItemLowerBodyJogPrePivot);
	void ItemLowerBodyJogStop(const struct FPoseLink& InPoseLowerBodyJogStop, struct FPoseLink* Param_ItemLowerBodyJogStop);
	void ItemLowerBodyJogStart(const struct FPoseLink& InPoseLowerBodyJogStart, struct FPoseLink* Param_ItemLowerBodyJogStart);
	void ItemLowerBodyLeanAdditive(const struct FPoseLink& InPoseLowerBodyLeanAdditive, struct FPoseLink* Param_ItemLowerBodyLeanAdditive);
	void ItemLowerBodyMovement(const struct FPoseLink& InPoseLowerBodyMovement, struct FPoseLink* Param_ItemLowerBodyMovement);
	void ItemJogPostPivotAdditive(const struct FPoseLink& InPosePostPivotAdditive, struct FPoseLink* Param_ItemJogPostPivotAdditive);
	void ItemJogPrePivotAdditive(const struct FPoseLink& InPosePrePivotAdditive, struct FPoseLink* Param_ItemJogPrePivotAdditive);
	void ItemJogStopAdditive(const struct FPoseLink& InPoseJogStopAdditive, struct FPoseLink* Param_ItemJogStopAdditive);
	void ItemJogStartAdditive(const struct FPoseLink& InPoseJogStartAdditive, struct FPoseLink* Param_ItemJogStartAdditive);
	void ItemFlyModeLoopAdditive(struct FPoseLink* Param_ItemFlyModeLoopAdditive);
	void ItemFlyModeStartAdditive(struct FPoseLink* Param_ItemFlyModeStartAdditive);
	void ItemZipLineStartAdditive(struct FPoseLink* Param_ItemZipLineStartAdditive);
	void ItemJetPackJumpAdditive(struct FPoseLink* Param_ItemJetPackJumpAdditive);
	void ItemJetPackStartAdditive(struct FPoseLink* Param_ItemJetPackStartAdditive);
	void ItemFallLandAdditive(struct FPoseLink* Param_ItemFallLandAdditive);
	void ItemFallAdditive(struct FPoseLink* Param_ItemFallAdditive);
	void ItemJumpLoopAdditive(struct FPoseLink* Param_ItemJumpLoopAdditive);
	void ItemJumpUpAdditive(struct FPoseLink* Param_ItemJumpUpAdditive);
	void ItemSlopeSliding(struct FPoseLink* Param_ItemSlopeSliding);
	void ItemCrouchTurningAdditive(struct FPoseLink* Param_ItemCrouchTurningAdditive);
	void ItemIdleAdditive(const struct FPoseLink& InPoseIdleAdditive, struct FPoseLink* Param_ItemIdleAdditive);
	void ItemFullBodySprint(const struct FPoseLink& InPoseSprint, struct FPoseLink* Param_ItemFullBodySprint);
	void ItemUpperBody(const struct FPoseLink& InPoseUpperBody, const struct FFortAnimInput_AdjustedAim& InputParam, struct FPoseLink* Param_ItemUpperBody);
	void ItemSwimJumpStartLoop(struct FPoseLink* Param_ItemSwimJumpStartLoop);
	void ItemSwimJumpFallLoop(struct FPoseLink* Param_ItemSwimJumpFallLoop);
	void ItemSwimJumpSurfaceLoop(struct FPoseLink* Param_ItemSwimJumpSurfaceLoop);
	void ItemSwimJumpSurfaceEnd(struct FPoseLink* Param_ItemSwimJumpSurfaceEnd);
	void ItemSkeletalControl(const struct FPoseLink& InPose, struct FPoseLink* Param_ItemSkeletalControl);
	void ItemAimOffset(const struct FPoseLink& InPose_AimOffset, float AimOffsetAlpha, float Yaw, float Pitch, const struct FPoseLink& InPose_UpperLowerPreMeleeAO, struct FPoseLink* Param_ItemAimOffset);
	void ItemFullBodyOverride(const struct FPoseLink& InPoseFullBody, struct FPoseLink* Param_ItemFullBodyOverride);
	void ItemPreIK(const struct FPoseLink& InPose_PreIK, struct FPoseLink* Param_ItemPreIK);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FloppingRabbitLayerAnimBP_C">();
	}
	static class UFloppingRabbitLayerAnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFloppingRabbitLayerAnimBP_C>();
	}
};
static_assert(alignof(UFloppingRabbitLayerAnimBP_C) == 0x000010, "Wrong alinment on UFloppingRabbitLayerAnimBP_C");
static_assert(sizeof(UFloppingRabbitLayerAnimBP_C) == 0x001C80, "Wrong size on UFloppingRabbitLayerAnimBP_C");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, UberGraphFrame) == 0x0003F0, "Member 'UFloppingRabbitLayerAnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimBlueprintClassSubsystem_PropertyAccess) == 0x0003F8, "Member 'UFloppingRabbitLayerAnimBP_C::AnimBlueprintClassSubsystem_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_34) == 0x000400, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_34' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_LinkedInputPose_18) == 0x000430, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_LinkedInputPose_18' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_33) == 0x0004B8, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_33' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_LinkedInputPose_17) == 0x0004E8, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_LinkedInputPose_17' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_32) == 0x000570, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_32' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_LinkedInputPose_16) == 0x0005A0, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_LinkedInputPose_16' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_LinkedInputPose_15) == 0x000628, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_LinkedInputPose_15' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_31) == 0x0006B0, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_31' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_LinkedInputPose_14) == 0x0006E0, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_LinkedInputPose_14' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_30) == 0x000768, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_30' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_SequencePlayer_9) == 0x000798, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_SequencePlayer_9' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_BlendListByBool_4) == 0x000810, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_BlendListByBool_4' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_SequencePlayer_8) == 0x0008B0, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_SequencePlayer_8' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_29) == 0x000928, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_29' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_SequencePlayer_7) == 0x000958, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_SequencePlayer_7' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_BlendListByBool_3) == 0x0009D0, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_BlendListByBool_3' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_SequencePlayer_6) == 0x000A70, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_SequencePlayer_6' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_28) == 0x000AE8, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_28' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_SequencePlayer_5) == 0x000B18, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_BlendListByBool_2) == 0x000B90, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_BlendListByBool_2' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_SequencePlayer_4) == 0x000C30, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_27) == 0x000CA8, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_27' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_SequencePlayer_3) == 0x000CD8, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_BlendListByBool_1) == 0x000D50, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_SequencePlayer_2) == 0x000DF0, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_26) == 0x000E68, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_26' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_LinkedInputPose_13) == 0x000E98, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_LinkedInputPose_13' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_25) == 0x000F20, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_25' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_LinkedInputPose_12) == 0x000F50, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_LinkedInputPose_12' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_24) == 0x000FD8, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_24' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_LinkedInputPose_11) == 0x001008, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_LinkedInputPose_11' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_23) == 0x001090, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_23' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_22) == 0x0010C0, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_22' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_21) == 0x0010F0, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_21' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_20) == 0x001120, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_20' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_19) == 0x001150, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_19' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_18) == 0x001180, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_18' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_17) == 0x0011B0, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_17' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_16) == 0x0011E0, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_16' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_15) == 0x001210, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_15' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_14) == 0x001240, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_14' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_13) == 0x001270, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_13' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_12) == 0x0012A0, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_12' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_LinkedInputPose_10) == 0x0012D0, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_LinkedInputPose_10' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_11) == 0x001358, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_11' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_LinkedInputPose_9) == 0x001388, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_LinkedInputPose_9' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_10) == 0x001410, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_10' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_LinkedInputPose_8) == 0x001440, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_LinkedInputPose_8' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_9) == 0x0014C8, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_9' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_LinkedInputPose_7) == 0x0014F8, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_LinkedInputPose_7' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_8) == 0x001580, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_8' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_LinkedInputPose_6) == 0x0015B0, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_LinkedInputPose_6' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_7) == 0x001638, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_7' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_LinkedInputPose_5) == 0x001668, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_LinkedInputPose_5' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_6) == 0x0016F0, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_6' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_LinkedInputPose_4) == 0x001720, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_LinkedInputPose_4' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_5) == 0x0017A8, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_5' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_LinkedInputPose_3) == 0x0017D8, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_LinkedInputPose_3' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_4) == 0x001860, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_4' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_LinkedInputPose_2) == 0x001890, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_LinkedInputPose_2' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_3) == 0x001918, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_3' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_LinkedInputPose_1) == 0x001948, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_LinkedInputPose_1' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_2) == 0x0019D0, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_2' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_LinkedInputPose) == 0x001A00, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root_1) == 0x001A88, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_SequencePlayer_1) == 0x001AB8, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_BlendListByBool) == 0x001B30, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_SequencePlayer) == 0x001BD0, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, AnimGraphNode_Root) == 0x001C48, "Member 'UFloppingRabbitLayerAnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UFloppingRabbitLayerAnimBP_C, OneHandGrip) == 0x001C78, "Member 'UFloppingRabbitLayerAnimBP_C::OneHandGrip' has a wrong offset!");

}

