#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FoleySound

#include "Basic.hpp"


namespace SDK::Params
{

// Function FoleySound.FoleySoundSubsystem.AddLibraries
// 0x0018 (0x0018 - 0x0000)
struct FoleySoundSubsystem_AddLibraries final 
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class UFoleySoundLibrary>> Libraries;                                         // 0x0008(0x0010)(Parm, ZeroConstructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FoleySoundSubsystem_AddLibraries) == 0x000008, "Wrong alinment on FoleySoundSubsystem_AddLibraries");
static_assert(sizeof(FoleySoundSubsystem_AddLibraries) == 0x000018, "Wrong size on FoleySoundSubsystem_AddLibraries");
static_assert(offsetof(FoleySoundSubsystem_AddLibraries, Actor) == 0x000000, "Member 'FoleySoundSubsystem_AddLibraries::Actor' has a wrong offset!");
static_assert(offsetof(FoleySoundSubsystem_AddLibraries, Libraries) == 0x000008, "Member 'FoleySoundSubsystem_AddLibraries::Libraries' has a wrong offset!");

// Function FoleySound.FoleySoundSubsystem.AddLibrary
// 0x0010 (0x0010 - 0x0000)
struct FoleySoundSubsystem_AddLibrary final 
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UFoleySoundLibrary>         Library;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FoleySoundSubsystem_AddLibrary) == 0x000008, "Wrong alinment on FoleySoundSubsystem_AddLibrary");
static_assert(sizeof(FoleySoundSubsystem_AddLibrary) == 0x000010, "Wrong size on FoleySoundSubsystem_AddLibrary");
static_assert(offsetof(FoleySoundSubsystem_AddLibrary, Actor) == 0x000000, "Member 'FoleySoundSubsystem_AddLibrary::Actor' has a wrong offset!");
static_assert(offsetof(FoleySoundSubsystem_AddLibrary, Library) == 0x000008, "Member 'FoleySoundSubsystem_AddLibrary::Library' has a wrong offset!");

// Function FoleySound.FoleySoundSubsystem.RemoveLibraries
// 0x0018 (0x0018 - 0x0000)
struct FoleySoundSubsystem_RemoveLibraries final 
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class UFoleySoundLibrary>> Libraries;                                         // 0x0008(0x0010)(Parm, ZeroConstructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FoleySoundSubsystem_RemoveLibraries) == 0x000008, "Wrong alinment on FoleySoundSubsystem_RemoveLibraries");
static_assert(sizeof(FoleySoundSubsystem_RemoveLibraries) == 0x000018, "Wrong size on FoleySoundSubsystem_RemoveLibraries");
static_assert(offsetof(FoleySoundSubsystem_RemoveLibraries, Actor) == 0x000000, "Member 'FoleySoundSubsystem_RemoveLibraries::Actor' has a wrong offset!");
static_assert(offsetof(FoleySoundSubsystem_RemoveLibraries, Libraries) == 0x000008, "Member 'FoleySoundSubsystem_RemoveLibraries::Libraries' has a wrong offset!");

// Function FoleySound.FoleySoundSubsystem.RemoveLibrary
// 0x0010 (0x0010 - 0x0000)
struct FoleySoundSubsystem_RemoveLibrary final 
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UFoleySoundLibrary>         Library;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FoleySoundSubsystem_RemoveLibrary) == 0x000008, "Wrong alinment on FoleySoundSubsystem_RemoveLibrary");
static_assert(sizeof(FoleySoundSubsystem_RemoveLibrary) == 0x000010, "Wrong size on FoleySoundSubsystem_RemoveLibrary");
static_assert(offsetof(FoleySoundSubsystem_RemoveLibrary, Actor) == 0x000000, "Member 'FoleySoundSubsystem_RemoveLibrary::Actor' has a wrong offset!");
static_assert(offsetof(FoleySoundSubsystem_RemoveLibrary, Library) == 0x000008, "Member 'FoleySoundSubsystem_RemoveLibrary::Library' has a wrong offset!");

}

