#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortRadioButtonGroup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortRadioButtonItemStruct_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FortRadioButtonGroup.FortRadioButtonGroup_C
// 0x0068 (0x02C8 - 0x0260)
class UFortRadioButtonGroup_C final  : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USizeBox*                               SizeBox_Buttons;                                   // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Buttons;                               // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<struct FFortRadioButtonItemStruct>     Buttons;                                           // 0x0278(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UIconTextButton_C*>              CreatedButtons;                                    // 0x0288(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             RadioButtonClicked_Event;                          // 0x0298(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                         WidthOverride;                                     // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B8B[0x4];                                     // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonGroup*                     CreatedButtonsGroup;                               // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CommonButtonGroup;                                 // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HeightOverride;                                    // 0x02C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CenterOnWidget(class UIconTextButton_C* CallFunc_Array_Get_Item);
	void OnButtonClicked_Bind(class UCommonButton* AssociatedButton, int32 ButtonIndex);
	void Destruct();
	void UpdateButtons();
	void ExecuteUbergraph_FortRadioButtonGroup(int32 EntryPoint, int32 Temp_int_Array_Index_Variable, const struct FFortRadioButtonItemStruct& CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, class UIconTextButton_C* CallFunc_Create_ReturnValue, int32 CallFunc_Array_Add_ReturnValue, bool CallFunc_Greater_FloatFloat_ReturnValue, class UPanelSlot* CallFunc_AddChild_ReturnValue, class UVerticalBoxSlot* K2Node_DynamicCast_AsVertical_Box_Slot, bool K2Node_DynamicCast_bSuccess, const struct FSlateChildSize& K2Node_MakeStruct_SlateChildSize, class UCommonButton* K2Node_CustomEvent_AssociatedButton, int32 K2Node_CustomEvent_ButtonIndex, TDelegate<void(class UCommonButton* AssociatedButton, int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate, class UCommonButtonGroup* CallFunc_SpawnObject_ReturnValue, bool CallFunc_Greater_FloatFloat_ReturnValue_1, int32 Temp_int_Loop_Counter_Variable, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue);
	void RadioButtonClicked_Event__DelegateSignature(int32 SelectedIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FortRadioButtonGroup_C">();
	}
	static class UFortRadioButtonGroup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortRadioButtonGroup_C>();
	}
};
static_assert(alignof(UFortRadioButtonGroup_C) == 0x000008, "Wrong alinment on UFortRadioButtonGroup_C");
static_assert(sizeof(UFortRadioButtonGroup_C) == 0x0002C8, "Wrong size on UFortRadioButtonGroup_C");
static_assert(offsetof(UFortRadioButtonGroup_C, UberGraphFrame) == 0x000260, "Member 'UFortRadioButtonGroup_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFortRadioButtonGroup_C, SizeBox_Buttons) == 0x000268, "Member 'UFortRadioButtonGroup_C::SizeBox_Buttons' has a wrong offset!");
static_assert(offsetof(UFortRadioButtonGroup_C, VerticalBox_Buttons) == 0x000270, "Member 'UFortRadioButtonGroup_C::VerticalBox_Buttons' has a wrong offset!");
static_assert(offsetof(UFortRadioButtonGroup_C, Buttons) == 0x000278, "Member 'UFortRadioButtonGroup_C::Buttons' has a wrong offset!");
static_assert(offsetof(UFortRadioButtonGroup_C, CreatedButtons) == 0x000288, "Member 'UFortRadioButtonGroup_C::CreatedButtons' has a wrong offset!");
static_assert(offsetof(UFortRadioButtonGroup_C, RadioButtonClicked_Event) == 0x000298, "Member 'UFortRadioButtonGroup_C::RadioButtonClicked_Event' has a wrong offset!");
static_assert(offsetof(UFortRadioButtonGroup_C, WidthOverride) == 0x0002A8, "Member 'UFortRadioButtonGroup_C::WidthOverride' has a wrong offset!");
static_assert(offsetof(UFortRadioButtonGroup_C, CreatedButtonsGroup) == 0x0002B0, "Member 'UFortRadioButtonGroup_C::CreatedButtonsGroup' has a wrong offset!");
static_assert(offsetof(UFortRadioButtonGroup_C, CommonButtonGroup) == 0x0002B8, "Member 'UFortRadioButtonGroup_C::CommonButtonGroup' has a wrong offset!");
static_assert(offsetof(UFortRadioButtonGroup_C, HeightOverride) == 0x0002C0, "Member 'UFortRadioButtonGroup_C::HeightOverride' has a wrong offset!");

}

