#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_FloppingRabbit

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GA_ThrowConsumable_classes.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_FloppingRabbit.GA_Athena_FloppingRabbit_C
// 0x0028 (0x0E70 - 0x0E48)
class UGA_Athena_FloppingRabbit_C : public UGA_ThrowConsumable_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Athena_FloppingRabbit_C;         // 0x0E48(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTag                           T_Active;                                          // 0x0E50(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           T_InWorld;                                         // 0x0E58(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CastMontageWeapon;                                 // 0x0E60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           InVehicleTag;                                      // 0x0E68(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Athena_FloppingRabbit(int32 EntryPoint, class FName K2Node_CustomEvent_NotifyName_3, class UAbilityTask_WaitGameplayTagAdded* CallFunc_WaitGameplayTagAdd_ReturnValue, TDelegate<void(class FName NotifyName)> K2Node_CreateDelegate_OutputDelegate, bool CallFunc_IsValid_ReturnValue, class FName K2Node_CustomEvent_NotifyName_2, class FName K2Node_CustomEvent_NotifyName_1, TDelegate<void(class FName NotifyName)> K2Node_CreateDelegate_OutputDelegate_1, class FName K2Node_CustomEvent_NotifyName, TDelegate<void(class FName NotifyName)> K2Node_CreateDelegate_OutputDelegate_2, class FName Temp_name_Variable, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_3, class AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue, class AFortPlayerPawn* K2Node_DynamicCast_AsFort_Player_Pawn, bool K2Node_DynamicCast_bSuccess, TScriptInterface<class IGameplayTagAssetInterface> CallFunc_DoesTagAssetInterfaceHaveTag_TagContainerInterface_CastInput, bool CallFunc_DoesTagAssetInterfaceHaveTag_ReturnValue, class AB_FloppingRabbit_Weap_Athena_C* K2Node_DynamicCast_AsB_Flopping_Rabbit_Weap_Athena, bool K2Node_DynamicCast_bSuccess_1, class APrj_Athena_FloppingRabbit_C* K2Node_DynamicCast_AsPrj_Athena_Flopping_Rabbit, bool K2Node_DynamicCast_bSuccess_2, TDelegate<void(class FName NotifyName)> K2Node_CreateDelegate_OutputDelegate_4, bool CallFunc_IsServer_ReturnValue, class FName K2Node_CustomEvent_NotifyName_4, TDelegate<void(class FName NotifyName)> K2Node_CreateDelegate_OutputDelegate_5, class UPlayMontageCallbackProxy* CallFunc_CreateProxyObjectForPlayMontage_ReturnValue, bool CallFunc_IsValid_ReturnValue_1);
	void ThrowMontageStarted();
	void K2_ActivateAbility();
	void Added_5FF18B9B4B9A1DE12D88D68E50AB8A5B();
	void OnCompleted_27A3BC8E4EB0B07EA2FD509EEE97AFC7(class FName NotifyName);
	void OnBlendOut_27A3BC8E4EB0B07EA2FD509EEE97AFC7(class FName NotifyName);
	void OnInterrupted_27A3BC8E4EB0B07EA2FD509EEE97AFC7(class FName NotifyName);
	void OnNotifyBegin_27A3BC8E4EB0B07EA2FD509EEE97AFC7(class FName NotifyName);
	void OnNotifyEnd_27A3BC8E4EB0B07EA2FD509EEE97AFC7(class FName NotifyName);

	bool K2_CanActivateAbility(const struct FGameplayAbilityActorInfo& ActorInfo, struct FGameplayAbilitySpecHandle& Handle, struct FGameplayTagContainer* RelevantTags, class AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue, class AFortPlayerPawn* K2Node_DynamicCast_AsFort_Player_Pawn, bool K2Node_DynamicCast_bSuccess, TScriptInterface<class IGameplayTagAssetInterface> CallFunc_DoesTagAssetInterfaceHaveTag_TagContainerInterface_CastInput, bool CallFunc_DoesTagAssetInterfaceHaveTag_ReturnValue, TScriptInterface<class IGameplayTagAssetInterface> CallFunc_DoesTagAssetInterfaceHaveTag_TagContainerInterface_CastInput_1, bool CallFunc_DoesTagAssetInterfaceHaveTag_ReturnValue_1, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_BooleanOR_ReturnValue) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_FloppingRabbit_C">();
	}
	static class UGA_Athena_FloppingRabbit_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_FloppingRabbit_C>();
	}
};
static_assert(alignof(UGA_Athena_FloppingRabbit_C) == 0x000008, "Wrong alinment on UGA_Athena_FloppingRabbit_C");
static_assert(sizeof(UGA_Athena_FloppingRabbit_C) == 0x000E70, "Wrong size on UGA_Athena_FloppingRabbit_C");
static_assert(offsetof(UGA_Athena_FloppingRabbit_C, UberGraphFrame_GA_Athena_FloppingRabbit_C) == 0x000E48, "Member 'UGA_Athena_FloppingRabbit_C::UberGraphFrame_GA_Athena_FloppingRabbit_C' has a wrong offset!");
static_assert(offsetof(UGA_Athena_FloppingRabbit_C, T_Active) == 0x000E50, "Member 'UGA_Athena_FloppingRabbit_C::T_Active' has a wrong offset!");
static_assert(offsetof(UGA_Athena_FloppingRabbit_C, T_InWorld) == 0x000E58, "Member 'UGA_Athena_FloppingRabbit_C::T_InWorld' has a wrong offset!");
static_assert(offsetof(UGA_Athena_FloppingRabbit_C, CastMontageWeapon) == 0x000E60, "Member 'UGA_Athena_FloppingRabbit_C::CastMontageWeapon' has a wrong offset!");
static_assert(offsetof(UGA_Athena_FloppingRabbit_C, InVehicleTag) == 0x000E68, "Member 'UGA_Athena_FloppingRabbit_C::InVehicleTag' has a wrong offset!");

}

