#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_HolidayGiftBox_Secondary

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GA_Athena_Grenade_ThrowWithTrajectory_Secondary_Parent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_HolidayGiftBox_Secondary.GA_Athena_HolidayGiftBox_Secondary_C
// 0x0018 (0x0EB8 - 0x0EA0)
class UGA_Athena_HolidayGiftBox_Secondary_C final  : public UGA_Athena_Grenade_ThrowWithTrajectory_Secondary_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Athena_HolidayGiftBox_Secondary_C; // 0x0EA0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABP_ProjectileTrajectory_C*             ProjectileTrajectoryRed;                           // 0x0EA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 TrajectoryIndicatorRedClass;                       // 0x0EB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Athena_HolidayGiftBox_Secondary(int32 EntryPoint, bool CallFunc_IsLocallyControlled_ReturnValue, bool Temp_bool_Variable, bool Temp_bool_Variable_1, bool CallFunc_IsTrajectoryHidden_ReturnValue, TArray<struct FVector>& CallFunc_GetProjectileTrajectoryPoints_OutSplinePoints, TArray<struct FVector>& CallFunc_GetProjectileTrajectoryPoints_OutSplineTangents, const struct FHitResult& CallFunc_GetProjectileTrajectoryPoints_OutHitResult, bool CallFunc_BreakHitResult_bBlockingHit, bool CallFunc_BreakHitResult_bInitialOverlap, float CallFunc_BreakHitResult_Time, float CallFunc_BreakHitResult_Distance, const struct FVector& CallFunc_BreakHitResult_Location, const struct FVector& CallFunc_BreakHitResult_ImpactPoint, const struct FVector& CallFunc_BreakHitResult_Normal, const struct FVector& CallFunc_BreakHitResult_ImpactNormal, class UPhysicalMaterial* CallFunc_BreakHitResult_PhysMat, class AActor* CallFunc_BreakHitResult_HitActor, class UPrimitiveComponent* CallFunc_BreakHitResult_HitComponent, class FName CallFunc_BreakHitResult_HitBoneName, int32 CallFunc_BreakHitResult_HitItem, int32 CallFunc_BreakHitResult_ElementIndex, int32 CallFunc_BreakHitResult_FaceIndex, const struct FVector& CallFunc_BreakHitResult_TraceStart, const struct FVector& CallFunc_BreakHitResult_TraceEnd, bool CallFunc_Not_PreBool_ReturnValue, class AAthenaSupplyDropBalloon_C* K2Node_DynamicCast_AsAthena_Supply_Drop_Balloon, bool K2Node_DynamicCast_bSuccess, class AFortAthenaSupplyDrop* K2Node_DynamicCast_AsFort_Athena_Supply_Drop, bool K2Node_DynamicCast_bSuccess_1, class AFortPawn* K2Node_DynamicCast_AsFort_Pawn, bool K2Node_DynamicCast_bSuccess_2, class ABuildingProp* K2Node_DynamicCast_AsBuilding_Prop, bool K2Node_DynamicCast_bSuccess_3, bool CallFunc_BooleanOR_ReturnValue, bool CallFunc_BooleanOR_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue_2, bool CallFunc_BooleanOR_ReturnValue_3, class ABP_ProjectileTrajectory_C* K2Node_Select_Default, class ABP_ProjectileTrajectory_C* K2Node_Select_Default_1);
	void UpdateTrajectorySpline();
	void CleanupTrajectory();
	void K2_ActivateAbility();
	bool IsTrajectoryHidden(bool CallFunc_BooleanAND_ReturnValue);
	void SetupDummyProjectileRed(bool CallFunc_IsValid_ReturnValue, struct FTransform& CallFunc_GetTransform_ReturnValue, class AActor* CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue, class AActor* CallFunc_FinishSpawningActor_ReturnValue, class ABP_ProjectileTrajectory_C* K2Node_DynamicCast_AsBP_Projectile_Trajectory, bool K2Node_DynamicCast_bSuccess);
	class AFortProjectileTrajectory* SpawnTrajectoryIndicator(bool bSpawnOnEquip, class AFortProjectileTrajectory* CallFunc_SpawnTrajectoryIndicator_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_HolidayGiftBox_Secondary_C">();
	}
	static class UGA_Athena_HolidayGiftBox_Secondary_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_HolidayGiftBox_Secondary_C>();
	}
};
static_assert(alignof(UGA_Athena_HolidayGiftBox_Secondary_C) == 0x000008, "Wrong alinment on UGA_Athena_HolidayGiftBox_Secondary_C");
static_assert(sizeof(UGA_Athena_HolidayGiftBox_Secondary_C) == 0x000EB8, "Wrong size on UGA_Athena_HolidayGiftBox_Secondary_C");
static_assert(offsetof(UGA_Athena_HolidayGiftBox_Secondary_C, UberGraphFrame_GA_Athena_HolidayGiftBox_Secondary_C) == 0x000EA0, "Member 'UGA_Athena_HolidayGiftBox_Secondary_C::UberGraphFrame_GA_Athena_HolidayGiftBox_Secondary_C' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HolidayGiftBox_Secondary_C, ProjectileTrajectoryRed) == 0x000EA8, "Member 'UGA_Athena_HolidayGiftBox_Secondary_C::ProjectileTrajectoryRed' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HolidayGiftBox_Secondary_C, TrajectoryIndicatorRedClass) == 0x000EB0, "Member 'UGA_Athena_HolidayGiftBox_Secondary_C::TrajectoryIndicatorRedClass' has a wrong offset!");

}

