#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_Flopper_Battle_Marking

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_Flopper_Battle_Marking.GA_Athena_Flopper_Battle_Marking_C
// 0x00A8 (0x0B60 - 0x0AB8)
class UGA_Athena_Flopper_Battle_Marking_C final  : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AB8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FScalableFloat                         MarkingRadius;                                     // 0x0AC0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         CurrentMarkingRadius;                              // 0x0AE8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C05[0x4];                                     // 0x0AEC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPawn*>                      WorkingList;                                       // 0x0AF0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, HasGetValueTypeHash)
	struct FGameplayTag                           CueOnMark;                                         // 0x0B00(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         MarkingDuration;                                   // 0x0B08(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         CurrentMarkingDuration;                            // 0x0B30(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C06[0x4];                                     // 0x0B34(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         DisableMarkingPlayers;                             // 0x0B38(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GA_Athena_Flopper_Battle_Marking(int32 EntryPoint, bool Temp_bool_Has_Been_Initd_Variable, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, const struct FIndicatedActorParticleSystemData& CallFunc_MakeIndicatedActorParticleSystemData_ReturnValue, class AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue, class AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1, class AFortPawn* K2Node_DynamicCast_AsFort_Pawn, bool K2Node_DynamicCast_bSuccess, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, TArray<class AFortPawn*>& CallFunc_GetFortPawnsInRange_OutFortPawns, class AActor* CallFunc_GetClosestActorFromArray_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, TArray<class AActor*>& K2Node_MakeArray_Array, class AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2, class AFortPlayerController* CallFunc_GetFortPlayerControllerFromActor_ReturnValue, class AFortPlayerControllerAthena* K2Node_DynamicCast_AsFort_Player_Controller_Athena, bool K2Node_DynamicCast_bSuccess_1, float CallFunc_GetValueAtLevel_ReturnValue, class AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue_3, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_1, int32 Temp_int_Loop_Counter_Variable, const struct FGameplayCueParameters& CallFunc_MakeGameplayCueParameters_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, bool CallFunc_IsServer_ReturnValue, float CallFunc_GetValueAtLevel_ReturnValue_1, const struct FStenciledActorData& CallFunc_MakeStenciledActorData_ReturnValue, const struct FIndicatedActorData& CallFunc_MakeIndicatedActorData_ReturnValue, bool Temp_bool_IsClosed_Variable, bool CallFunc_RowToBool_ReturnValue, int32 Temp_int_Array_Index_Variable, class AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue_4, class AFortPawn* CallFunc_Array_Get_Item, bool CallFunc_OnSameTeam_ReturnValue, class AFortPlayerPawnAthena* K2Node_DynamicCast_AsFort_Player_Pawn_Athena, bool K2Node_DynamicCast_bSuccess_2, int32 CallFunc_Array_AddUnique_ReturnValue);
	void MarkEnemies_();
	void K2_ActivateAbility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_Flopper_Battle_Marking_C">();
	}
	static class UGA_Athena_Flopper_Battle_Marking_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_Flopper_Battle_Marking_C>();
	}
};
static_assert(alignof(UGA_Athena_Flopper_Battle_Marking_C) == 0x000008, "Wrong alinment on UGA_Athena_Flopper_Battle_Marking_C");
static_assert(sizeof(UGA_Athena_Flopper_Battle_Marking_C) == 0x000B60, "Wrong size on UGA_Athena_Flopper_Battle_Marking_C");
static_assert(offsetof(UGA_Athena_Flopper_Battle_Marking_C, UberGraphFrame) == 0x000AB8, "Member 'UGA_Athena_Flopper_Battle_Marking_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Flopper_Battle_Marking_C, MarkingRadius) == 0x000AC0, "Member 'UGA_Athena_Flopper_Battle_Marking_C::MarkingRadius' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Flopper_Battle_Marking_C, CurrentMarkingRadius) == 0x000AE8, "Member 'UGA_Athena_Flopper_Battle_Marking_C::CurrentMarkingRadius' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Flopper_Battle_Marking_C, WorkingList) == 0x000AF0, "Member 'UGA_Athena_Flopper_Battle_Marking_C::WorkingList' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Flopper_Battle_Marking_C, CueOnMark) == 0x000B00, "Member 'UGA_Athena_Flopper_Battle_Marking_C::CueOnMark' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Flopper_Battle_Marking_C, MarkingDuration) == 0x000B08, "Member 'UGA_Athena_Flopper_Battle_Marking_C::MarkingDuration' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Flopper_Battle_Marking_C, CurrentMarkingDuration) == 0x000B30, "Member 'UGA_Athena_Flopper_Battle_Marking_C::CurrentMarkingDuration' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Flopper_Battle_Marking_C, DisableMarkingPlayers) == 0x000B38, "Member 'UGA_Athena_Flopper_Battle_Marking_C::DisableMarkingPlayers' has a wrong offset!");

}

