#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_ShockGrenade_RemoveFX

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_ShockGrenade_RemoveFX.GA_Athena_ShockGrenade_RemoveFX_C
// 0x0028 (0x0AE0 - 0x0AB8)
class UGA_Athena_ShockGrenade_RemoveFX_C final  : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AB8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0AC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Looping_GC;                                        // 0x0AC8(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Player_Landing_GC;                                 // 0x0AD0(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           VehicleOnGroundTimer;                              // 0x0AD8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Athena_ShockGrenade_RemoveFX(int32 EntryPoint, EMovementMode K2Node_CustomEvent_NewMovementMode_1, EMovementMode Temp_byte_Variable, class UAbilityTask_WaitMovementModeChange* CallFunc_CreateWaitMovementModeChange_ReturnValue, bool CallFunc_IsValid_ReturnValue, TDelegate<void(EMovementMode NewMovementMode)> K2Node_CreateDelegate_OutputDelegate, EMovementMode K2Node_CustomEvent_NewMovementMode, EMovementMode Temp_byte_Variable_1, class UAbilityTask_WaitMovementModeChange* CallFunc_CreateWaitMovementModeChange_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_1, class AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue, class AFortPlayerPawn* K2Node_DynamicCast_AsFort_Player_Pawn, bool K2Node_DynamicCast_bSuccess, TDelegate<void(EMovementMode NewMovementMode)> K2Node_CreateDelegate_OutputDelegate_1, TScriptInterface<class IFortVehicleInterface> CallFunc_GetVehicleUInterface_ReturnValue, bool CallFunc_IsInVehicle_ReturnValue, bool CallFunc_IsTouchingGround_ReturnValue, class UObject* CallFunc_Conv_InterfaceToObject_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_IsValid_ReturnValue_2, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_2, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue);
	void VehicleLandedCheck();
	void K2_ActivateAbility();
	void OnChange_FB10A796481939495F3E43A6ECDEF98E(EMovementMode NewMovementMode);
	void OnChange_4AD3DFC14DFECA79ED54A7B53F3A9E7E(EMovementMode NewMovementMode);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_ShockGrenade_RemoveFX_C">();
	}
	static class UGA_Athena_ShockGrenade_RemoveFX_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_ShockGrenade_RemoveFX_C>();
	}
};
static_assert(alignof(UGA_Athena_ShockGrenade_RemoveFX_C) == 0x000008, "Wrong alinment on UGA_Athena_ShockGrenade_RemoveFX_C");
static_assert(sizeof(UGA_Athena_ShockGrenade_RemoveFX_C) == 0x000AE0, "Wrong size on UGA_Athena_ShockGrenade_RemoveFX_C");
static_assert(offsetof(UGA_Athena_ShockGrenade_RemoveFX_C, UberGraphFrame) == 0x000AB8, "Member 'UGA_Athena_ShockGrenade_RemoveFX_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Athena_ShockGrenade_RemoveFX_C, PlayerPawn) == 0x000AC0, "Member 'UGA_Athena_ShockGrenade_RemoveFX_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(UGA_Athena_ShockGrenade_RemoveFX_C, Looping_GC) == 0x000AC8, "Member 'UGA_Athena_ShockGrenade_RemoveFX_C::Looping_GC' has a wrong offset!");
static_assert(offsetof(UGA_Athena_ShockGrenade_RemoveFX_C, Player_Landing_GC) == 0x000AD0, "Member 'UGA_Athena_ShockGrenade_RemoveFX_C::Player_Landing_GC' has a wrong offset!");
static_assert(offsetof(UGA_Athena_ShockGrenade_RemoveFX_C, VehicleOnGroundTimer) == 0x000AD8, "Member 'UGA_Athena_ShockGrenade_RemoveFX_C::VehicleOnGroundTimer' has a wrong offset!");

}

