#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_TillLandFallDamageImmunity_Parent

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_TillLandFallDamageImmunity_Parent.GA_Athena_TillLandFallDamageImmunity_Parent_C
// 0x0050 (0x0B08 - 0x0AB8)
class UGA_Athena_TillLandFallDamageImmunity_Parent_C : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AB8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UClass*                                 GE_FallDamageImmunity;                             // 0x0AC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            GEH_FallDamageImmunity;                            // 0x0AC8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         Delay_PostLand;                                    // 0x0AD0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Tag_SurfaceSwimming;                               // 0x0AD4(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B93[0x4];                                     // 0x0ADC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  TC_IgnoreApplication;                              // 0x0AE0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           Tag_InVehicle;                                     // 0x0B00(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Athena_TillLandFallDamageImmunity_Parent(int32 EntryPoint, bool Temp_bool_Variable, TDelegate<void(struct FHitResult& Hit)> K2Node_CreateDelegate_OutputDelegate, bool CallFunc_Not_PreBool_ReturnValue, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_1, bool Temp_bool_IsClosed_Variable, bool K2Node_Event_bWasCancelled, const struct FActiveGameplayEffectHandle& CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_2, class AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue, struct FHitResult& K2Node_CustomEvent_Hit, class AFortPawn* K2Node_DynamicCast_AsFort_Pawn, bool K2Node_DynamicCast_bSuccess, class UAbilityTask_WaitGameplayTagAdded* CallFunc_WaitGameplayTagAdd_ReturnValue, class AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1, TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface, bool K2Node_DynamicCast_bSuccess_1, bool CallFunc_IsValid_ReturnValue, bool CallFunc_HasAnyMatchingGameplayTags_ReturnValue, class UAbilityTask_WaitGameplayTagAdded* CallFunc_WaitGameplayTagAdd_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_1, bool Temp_bool_Has_Been_Initd_Variable);
	void PawnLanded(struct FHitResult& Hit);
	void SetUpBinds();
	void SetUpWaits();
	void CallEnd();
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_ActivateAbility();
	void Added_15DBA1504E74C72F22BBCBAD8E3CD31E();
	void Added_3DBE819D4ED6A0A0909A7690321F9B09();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_TillLandFallDamageImmunity_Parent_C">();
	}
	static class UGA_Athena_TillLandFallDamageImmunity_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_TillLandFallDamageImmunity_Parent_C>();
	}
};
static_assert(alignof(UGA_Athena_TillLandFallDamageImmunity_Parent_C) == 0x000008, "Wrong alinment on UGA_Athena_TillLandFallDamageImmunity_Parent_C");
static_assert(sizeof(UGA_Athena_TillLandFallDamageImmunity_Parent_C) == 0x000B08, "Wrong size on UGA_Athena_TillLandFallDamageImmunity_Parent_C");
static_assert(offsetof(UGA_Athena_TillLandFallDamageImmunity_Parent_C, UberGraphFrame) == 0x000AB8, "Member 'UGA_Athena_TillLandFallDamageImmunity_Parent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Athena_TillLandFallDamageImmunity_Parent_C, GE_FallDamageImmunity) == 0x000AC0, "Member 'UGA_Athena_TillLandFallDamageImmunity_Parent_C::GE_FallDamageImmunity' has a wrong offset!");
static_assert(offsetof(UGA_Athena_TillLandFallDamageImmunity_Parent_C, GEH_FallDamageImmunity) == 0x000AC8, "Member 'UGA_Athena_TillLandFallDamageImmunity_Parent_C::GEH_FallDamageImmunity' has a wrong offset!");
static_assert(offsetof(UGA_Athena_TillLandFallDamageImmunity_Parent_C, Delay_PostLand) == 0x000AD0, "Member 'UGA_Athena_TillLandFallDamageImmunity_Parent_C::Delay_PostLand' has a wrong offset!");
static_assert(offsetof(UGA_Athena_TillLandFallDamageImmunity_Parent_C, Tag_SurfaceSwimming) == 0x000AD4, "Member 'UGA_Athena_TillLandFallDamageImmunity_Parent_C::Tag_SurfaceSwimming' has a wrong offset!");
static_assert(offsetof(UGA_Athena_TillLandFallDamageImmunity_Parent_C, TC_IgnoreApplication) == 0x000AE0, "Member 'UGA_Athena_TillLandFallDamageImmunity_Parent_C::TC_IgnoreApplication' has a wrong offset!");
static_assert(offsetof(UGA_Athena_TillLandFallDamageImmunity_Parent_C, Tag_InVehicle) == 0x000B00, "Member 'UGA_Athena_TillLandFallDamageImmunity_Parent_C::Tag_InVehicle' has a wrong offset!");

}

