#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_Track_PurpleMouse

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_Track_PurpleMouse.GA_Athena_Track_PurpleMouse_C
// 0x0028 (0x0AE0 - 0x0AB8)
class UGA_Athena_Track_PurpleMouse_C final  : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AB8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0AC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           TrackGroupTag;                                     // 0x0AC8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         ProxMineActors;                                    // 0x0AD0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Athena_Track_PurpleMouse(int32 EntryPoint, const struct FGameplayEventData& Temp_struct_Variable, TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate, class UAbilityTask_WaitGameplayEvent* CallFunc_WaitGameplayEvent_ReturnValue, TDelegate<void(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum)> K2Node_CreateDelegate_OutputDelegate_1, bool CallFunc_IsValid_ReturnValue, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_2, const struct FGameplayAbilityActorInfo& CallFunc_GetActorInfo_ReturnValue, class AFortPlayerPawn* K2Node_DynamicCast_AsFort_Player_Pawn, bool K2Node_DynamicCast_bSuccess, const struct FGameplayAbilityTargetDataHandle& CallFunc_AbilityTargetDataFromActor_ReturnValue, TArray<struct FActiveGameplayEffectHandle>& CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue, bool CallFunc_K2_CommitAbility_ReturnValue, bool K2Node_Event_bWasCancelled, const struct FGameplayEventData& K2Node_CustomEvent_Payload, class AActor* K2Node_CustomEvent_DamagedActor, float K2Node_CustomEvent_Damage, class AController* K2Node_CustomEvent_InstigatedBy, class AActor* K2Node_CustomEvent_DamageCauser, const struct FVector& K2Node_CustomEvent_HitLocation, class UPrimitiveComponent* K2Node_CustomEvent_FHitComponent, class FName K2Node_CustomEvent_BoneName, const struct FVector& K2Node_CustomEvent_Momentum, class AFortVolumeManager* CallFunc_GetVolumeManager_OutVolumeManager, EVolumeValidityResult CallFunc_GetVolumeManager_OutIsValid, bool K2Node_SwitchEnum_CmpSuccess, class AFortVolume* CallFunc_GetVolumeForActor_ReturnValue, class AFortMinigame* CallFunc_GetMinigameForVolume_ReturnValue);
	void OnMinigameChanged();
	void OnPlayerDeath(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_ActivateAbility();
	void EventReceived_739900834D974D726220CC9B70F2219C(const struct FGameplayEventData& Payload);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_Track_PurpleMouse_C">();
	}
	static class UGA_Athena_Track_PurpleMouse_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_Track_PurpleMouse_C>();
	}
};
static_assert(alignof(UGA_Athena_Track_PurpleMouse_C) == 0x000008, "Wrong alinment on UGA_Athena_Track_PurpleMouse_C");
static_assert(sizeof(UGA_Athena_Track_PurpleMouse_C) == 0x000AE0, "Wrong size on UGA_Athena_Track_PurpleMouse_C");
static_assert(offsetof(UGA_Athena_Track_PurpleMouse_C, UberGraphFrame) == 0x000AB8, "Member 'UGA_Athena_Track_PurpleMouse_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Track_PurpleMouse_C, PlayerPawn) == 0x000AC0, "Member 'UGA_Athena_Track_PurpleMouse_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Track_PurpleMouse_C, TrackGroupTag) == 0x000AC8, "Member 'UGA_Athena_Track_PurpleMouse_C::TrackGroupTag' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Track_PurpleMouse_C, ProxMineActors) == 0x000AD0, "Member 'UGA_Athena_Track_PurpleMouse_C::ProxMineActors' has a wrong offset!");

}

