#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_ZeroPoint_Dash

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GA_Athena_ZeroPoint_Dash.GA_Athena_ZeroPoint_Dash_C.ExecuteUbergraph_GA_Athena_ZeroPoint_Dash
// 0x0148 (0x0148 - 0x0000)
struct GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash final 
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C44[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C45[0x2];                                     // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Get_Movement_End_Velocity_FinalVelocity;  // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCurrentAcceleration_ReturnValue;       // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C46[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue_1;                 // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Get_Target_Location_Based_On_Aim_Rotation_ReturnValue; // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue;           // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Get_Target_Location_Based_On_Acceleration_TargetLocation; // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_2;                          // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbilityCooldown_ReturnValue;     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C47[0x3];                                     // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasRecentlyExitedZiplineFromJumping_ReturnValue; // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C48[0x3];                                     // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C49[0x4];                                     // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_ApplyRootMotionMoveToForce* CallFunc_ApplyRootMotionMoveToForce_ReturnValue;   // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue_1;         // 0x0104(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C4A[0x3];                                     // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue_2;            // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C4B[0x3];                                     // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0120(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1; // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn_1;           // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSkydiving_ReturnValue;                  // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash) == 0x000008, "Wrong alinment on GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash");
static_assert(sizeof(GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash) == 0x000148, "Wrong size on GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash, EntryPoint) == 0x000000, "Member 'GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000004, "Member 'GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash, CallFunc_GetContext_ReturnValue) == 0x000010, "Member 'GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000028, "Member 'GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000030, "Member 'GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash, K2Node_Event_bWasCancelled) == 0x000039, "Member 'GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash, CallFunc_Get_Movement_End_Velocity_FinalVelocity) == 0x00003C, "Member 'GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash::CallFunc_Get_Movement_End_Velocity_FinalVelocity' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash, CallFunc_GetCurrentAcceleration_ReturnValue) == 0x000048, "Member 'GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash::CallFunc_GetCurrentAcceleration_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash, CallFunc_GetContext_ReturnValue_1) == 0x000058, "Member 'GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash, CallFunc_Add_VectorVector_ReturnValue) == 0x000060, "Member 'GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash, CallFunc_Get_Target_Location_Based_On_Aim_Rotation_ReturnValue) == 0x00006C, "Member 'GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash::CallFunc_Get_Target_Location_Based_On_Aim_Rotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash, CallFunc_Divide_VectorFloat_ReturnValue) == 0x000078, "Member 'GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash::CallFunc_Divide_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash, CallFunc_BreakVector_X) == 0x000084, "Member 'GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash, CallFunc_BreakVector_Y) == 0x000088, "Member 'GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash, CallFunc_BreakVector_Z) == 0x00008C, "Member 'GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash, CallFunc_Get_Target_Location_Based_On_Acceleration_TargetLocation) == 0x000090, "Member 'GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash::CallFunc_Get_Target_Location_Based_On_Acceleration_TargetLocation' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash, CallFunc_BreakVector_X_1) == 0x00009C, "Member 'GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash, CallFunc_BreakVector_Y_1) == 0x0000A0, "Member 'GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash, CallFunc_BreakVector_Z_1) == 0x0000A4, "Member 'GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000A8, "Member 'GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash, CallFunc_BreakVector_X_2) == 0x0000B4, "Member 'GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash, CallFunc_BreakVector_Y_2) == 0x0000B8, "Member 'GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash, CallFunc_BreakVector_Z_2) == 0x0000BC, "Member 'GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0000C0, "Member 'GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000CC, "Member 'GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash, CallFunc_K2_CommitAbilityCooldown_ReturnValue) == 0x0000D0, "Member 'GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash::CallFunc_K2_CommitAbilityCooldown_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash, CallFunc_MakeVector_ReturnValue) == 0x0000D4, "Member 'GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000E0, "Member 'GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash, CallFunc_HasRecentlyExitedZiplineFromJumping_ReturnValue) == 0x0000EC, "Member 'GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash::CallFunc_HasRecentlyExitedZiplineFromJumping_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash, CallFunc_GetValueAtLevel_ReturnValue) == 0x0000F0, "Member 'GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash, CallFunc_ApplyRootMotionMoveToForce_ReturnValue) == 0x0000F8, "Member 'GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash::CallFunc_ApplyRootMotionMoveToForce_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x000100, "Member 'GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash, CallFunc_Divide_VectorFloat_ReturnValue_1) == 0x000104, "Member 'GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash::CallFunc_Divide_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash, CallFunc_IsValid_ReturnValue) == 0x000110, "Member 'GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash, CallFunc_GetValueAtLevel_ReturnValue_2) == 0x000114, "Member 'GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash::CallFunc_GetValueAtLevel_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000118, "Member 'GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash, CallFunc_IsValid_ReturnValue_1) == 0x00011C, "Member 'GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash, K2Node_CreateDelegate_OutputDelegate_1) == 0x000120, "Member 'GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1) == 0x000130, "Member 'GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash, K2Node_DynamicCast_AsFort_Player_Pawn_1) == 0x000138, "Member 'GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash::K2Node_DynamicCast_AsFort_Player_Pawn_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash, K2Node_DynamicCast_bSuccess_1) == 0x000140, "Member 'GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash, CallFunc_IsValid_ReturnValue_2) == 0x000141, "Member 'GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash, CallFunc_IsSkydiving_ReturnValue) == 0x000142, "Member 'GA_Athena_ZeroPoint_Dash_C_ExecuteUbergraph_GA_Athena_ZeroPoint_Dash::CallFunc_IsSkydiving_ReturnValue' has a wrong offset!");

// Function GA_Athena_ZeroPoint_Dash.GA_Athena_ZeroPoint_Dash_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Athena_ZeroPoint_Dash_C_K2_OnEndAbility final 
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Athena_ZeroPoint_Dash_C_K2_OnEndAbility) == 0x000001, "Wrong alinment on GA_Athena_ZeroPoint_Dash_C_K2_OnEndAbility");
static_assert(sizeof(GA_Athena_ZeroPoint_Dash_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Athena_ZeroPoint_Dash_C_K2_OnEndAbility");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Athena_ZeroPoint_Dash_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Athena_ZeroPoint_Dash.GA_Athena_ZeroPoint_Dash_C.SetPawnCollision
// 0x0010 (0x0010 - 0x0000)
struct GA_Athena_ZeroPoint_Dash_C_SetPawnCollision final 
{
public:
	bool                                          Condition;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C4C[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetCollisionProfileName_ReturnValue;      // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Athena_ZeroPoint_Dash_C_SetPawnCollision) == 0x000004, "Wrong alinment on GA_Athena_ZeroPoint_Dash_C_SetPawnCollision");
static_assert(sizeof(GA_Athena_ZeroPoint_Dash_C_SetPawnCollision) == 0x000010, "Wrong size on GA_Athena_ZeroPoint_Dash_C_SetPawnCollision");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_SetPawnCollision, Condition) == 0x000000, "Member 'GA_Athena_ZeroPoint_Dash_C_SetPawnCollision::Condition' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_SetPawnCollision, CallFunc_GetCollisionProfileName_ReturnValue) == 0x000004, "Member 'GA_Athena_ZeroPoint_Dash_C_SetPawnCollision::CallFunc_GetCollisionProfileName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_SetPawnCollision, CallFunc_NotEqual_NameName_ReturnValue) == 0x00000C, "Member 'GA_Athena_ZeroPoint_Dash_C_SetPawnCollision::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");

// Function GA_Athena_ZeroPoint_Dash.GA_Athena_ZeroPoint_Dash_C.Get Movement End Velocity
// 0x0080 (0x0080 - 0x0000)
struct GA_Athena_ZeroPoint_Dash_C_Get_Movement_End_Velocity final 
{
public:
	class AFortPlayerPawn*                        Param_FortPawn;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FinalVelocity;                                     // 0x0008(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue_1;      // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue_2;      // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C4D[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_ZeroPoint_Dash_C_Get_Movement_End_Velocity) == 0x000008, "Wrong alinment on GA_Athena_ZeroPoint_Dash_C_Get_Movement_End_Velocity");
static_assert(sizeof(GA_Athena_ZeroPoint_Dash_C_Get_Movement_End_Velocity) == 0x000080, "Wrong size on GA_Athena_ZeroPoint_Dash_C_Get_Movement_End_Velocity");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_Get_Movement_End_Velocity, Param_FortPawn) == 0x000000, "Member 'GA_Athena_ZeroPoint_Dash_C_Get_Movement_End_Velocity::Param_FortPawn' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_Get_Movement_End_Velocity, FinalVelocity) == 0x000008, "Member 'GA_Athena_ZeroPoint_Dash_C_Get_Movement_End_Velocity::FinalVelocity' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_Get_Movement_End_Velocity, CallFunc_GetVelocity_ReturnValue) == 0x000014, "Member 'GA_Athena_ZeroPoint_Dash_C_Get_Movement_End_Velocity::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_Get_Movement_End_Velocity, CallFunc_GetActorForwardVector_ReturnValue) == 0x000020, "Member 'GA_Athena_ZeroPoint_Dash_C_Get_Movement_End_Velocity::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_Get_Movement_End_Velocity, CallFunc_BreakVector_X) == 0x00002C, "Member 'GA_Athena_ZeroPoint_Dash_C_Get_Movement_End_Velocity::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_Get_Movement_End_Velocity, CallFunc_BreakVector_Y) == 0x000030, "Member 'GA_Athena_ZeroPoint_Dash_C_Get_Movement_End_Velocity::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_Get_Movement_End_Velocity, CallFunc_BreakVector_Z) == 0x000034, "Member 'GA_Athena_ZeroPoint_Dash_C_Get_Movement_End_Velocity::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_Get_Movement_End_Velocity, CallFunc_VSize_ReturnValue) == 0x000038, "Member 'GA_Athena_ZeroPoint_Dash_C_Get_Movement_End_Velocity::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_Get_Movement_End_Velocity, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x00003C, "Member 'GA_Athena_ZeroPoint_Dash_C_Get_Movement_End_Velocity::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_Get_Movement_End_Velocity, CallFunc_EqualEqual_FloatFloat_ReturnValue_1) == 0x00003D, "Member 'GA_Athena_ZeroPoint_Dash_C_Get_Movement_End_Velocity::CallFunc_EqualEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_Get_Movement_End_Velocity, CallFunc_EqualEqual_FloatFloat_ReturnValue_2) == 0x00003E, "Member 'GA_Athena_ZeroPoint_Dash_C_Get_Movement_End_Velocity::CallFunc_EqualEqual_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_Get_Movement_End_Velocity, CallFunc_BooleanAND_ReturnValue) == 0x00003F, "Member 'GA_Athena_ZeroPoint_Dash_C_Get_Movement_End_Velocity::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_Get_Movement_End_Velocity, CallFunc_BooleanOR_ReturnValue) == 0x000040, "Member 'GA_Athena_ZeroPoint_Dash_C_Get_Movement_End_Velocity::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_Get_Movement_End_Velocity, CallFunc_SelectVector_ReturnValue) == 0x000044, "Member 'GA_Athena_ZeroPoint_Dash_C_Get_Movement_End_Velocity::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_Get_Movement_End_Velocity, CallFunc_BreakVector_X_1) == 0x000050, "Member 'GA_Athena_ZeroPoint_Dash_C_Get_Movement_End_Velocity::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_Get_Movement_End_Velocity, CallFunc_BreakVector_Y_1) == 0x000054, "Member 'GA_Athena_ZeroPoint_Dash_C_Get_Movement_End_Velocity::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_Get_Movement_End_Velocity, CallFunc_BreakVector_Z_1) == 0x000058, "Member 'GA_Athena_ZeroPoint_Dash_C_Get_Movement_End_Velocity::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_Get_Movement_End_Velocity, CallFunc_MakeVector_ReturnValue) == 0x00005C, "Member 'GA_Athena_ZeroPoint_Dash_C_Get_Movement_End_Velocity::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_Get_Movement_End_Velocity, CallFunc_Normal_ReturnValue) == 0x000068, "Member 'GA_Athena_ZeroPoint_Dash_C_Get_Movement_End_Velocity::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_Get_Movement_End_Velocity, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000074, "Member 'GA_Athena_ZeroPoint_Dash_C_Get_Movement_End_Velocity::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");

// Function GA_Athena_ZeroPoint_Dash.GA_Athena_ZeroPoint_Dash_C.Get Target Location Based On Aim Rotation
// 0x0040 (0x0040 - 0x0000)
struct GA_Athena_ZeroPoint_Dash_C_Get_Target_Location_Based_On_Aim_Rotation final 
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetDefaultTargetingRotation_ReturnValue;  // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_ZeroPoint_Dash_C_Get_Target_Location_Based_On_Aim_Rotation) == 0x000004, "Wrong alinment on GA_Athena_ZeroPoint_Dash_C_Get_Target_Location_Based_On_Aim_Rotation");
static_assert(sizeof(GA_Athena_ZeroPoint_Dash_C_Get_Target_Location_Based_On_Aim_Rotation) == 0x000040, "Wrong size on GA_Athena_ZeroPoint_Dash_C_Get_Target_Location_Based_On_Aim_Rotation");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_Get_Target_Location_Based_On_Aim_Rotation, ReturnValue) == 0x000000, "Member 'GA_Athena_ZeroPoint_Dash_C_Get_Target_Location_Based_On_Aim_Rotation::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_Get_Target_Location_Based_On_Aim_Rotation, CallFunc_GetValueAtLevel_ReturnValue) == 0x00000C, "Member 'GA_Athena_ZeroPoint_Dash_C_Get_Target_Location_Based_On_Aim_Rotation::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_Get_Target_Location_Based_On_Aim_Rotation, CallFunc_GetDefaultTargetingRotation_ReturnValue) == 0x000010, "Member 'GA_Athena_ZeroPoint_Dash_C_Get_Target_Location_Based_On_Aim_Rotation::CallFunc_GetDefaultTargetingRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_Get_Target_Location_Based_On_Aim_Rotation, CallFunc_Conv_RotatorToVector_ReturnValue) == 0x00001C, "Member 'GA_Athena_ZeroPoint_Dash_C_Get_Target_Location_Based_On_Aim_Rotation::CallFunc_Conv_RotatorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_Get_Target_Location_Based_On_Aim_Rotation, CallFunc_Normal_ReturnValue) == 0x000028, "Member 'GA_Athena_ZeroPoint_Dash_C_Get_Target_Location_Based_On_Aim_Rotation::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_Get_Target_Location_Based_On_Aim_Rotation, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000034, "Member 'GA_Athena_ZeroPoint_Dash_C_Get_Target_Location_Based_On_Aim_Rotation::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");

// Function GA_Athena_ZeroPoint_Dash.GA_Athena_ZeroPoint_Dash_C.Get Target Location Based On Acceleration
// 0x0094 (0x0094 - 0x0000)
struct GA_Athena_ZeroPoint_Dash_C_Get_Target_Location_Based_On_Acceleration final 
{
public:
	struct FVector                                TargetLocation;                                    // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCurrentAcceleration_ReturnValue;       // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue_1;      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C4E[0x2];                                     // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue_2;      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C4F[0x1];                                     // 0x004B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_ZeroPoint_Dash_C_Get_Target_Location_Based_On_Acceleration) == 0x000004, "Wrong alinment on GA_Athena_ZeroPoint_Dash_C_Get_Target_Location_Based_On_Acceleration");
static_assert(sizeof(GA_Athena_ZeroPoint_Dash_C_Get_Target_Location_Based_On_Acceleration) == 0x000094, "Wrong size on GA_Athena_ZeroPoint_Dash_C_Get_Target_Location_Based_On_Acceleration");
static_assert(offsetof(GA_Athena_ZeroPoint_Dash_C_Get_Target_Location_Based_On_Acceleration, TargetLocation) == 0x000000, "Member 'GA_Athena_ZeroPoint_Dash_C_Get_Target_Location_Based_On_Acceleration::TargetLocation' has a wrong offset!");
