#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_Rift_Flopper

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GA_Athena_MedConsumable_Parent_classes.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_Rift_Flopper.GA_Athena_Rift_Flopper_C
// 0x0020 (0x0C30 - 0x0C10)
class UGA_Athena_Rift_Flopper_C final  : public UGA_Athena_MedConsumable_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Athena_Rift_Flopper_C;           // 0x0C10(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FName                                   RiftItemHolster;                                   // 0x0C18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           EquippingCue;                                      // 0x0C20(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 TeleportGameplayEffect;                            // 0x0C28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Athena_Rift_Flopper(int32 EntryPoint, bool CallFunc_IsDedicatedServer_ReturnValue, const struct FActiveGameplayEffectHandle& CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue, bool K2Node_Event_bWasCancelled, bool CallFunc_Is_Flying_NewParam, const struct FTransform& CallFunc_K2_GetComponentToWorld_ReturnValue, const struct FVector& CallFunc_BreakTransform_Location, const struct FRotator& CallFunc_BreakTransform_Rotation, const struct FVector& CallFunc_BreakTransform_Scale, const struct FTransform& CallFunc_MakeTransform_ReturnValue, class AActor* CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue, class ABGA_RiftPortal_Item_Athena_C* CallFunc_FinishSpawningActor_ReturnValue);
	void OnMontageTriggeredPostCommitSuccess();
	void K2_OnEndAbility(bool bWasCancelled);
	void Is_Flying(bool* NewParam, class UPawnMovementComponent* CallFunc_GetMovementComponent_ReturnValue, class UFortMovementComp_Character* K2Node_DynamicCast_AsFort_Movement_Comp_Character, bool K2Node_DynamicCast_bSuccess, bool CallFunc_EqualEqual_ByteByte_ReturnValue);

	bool K2_CanActivateAbility(const struct FGameplayAbilityActorInfo& ActorInfo, struct FGameplayAbilitySpecHandle& Handle, struct FGameplayTagContainer* RelevantTags, class AFortPlayerPawnAthena* K2Node_DynamicCast_AsFort_Player_Pawn_Athena, bool K2Node_DynamicCast_bSuccess) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_Rift_Flopper_C">();
	}
	static class UGA_Athena_Rift_Flopper_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_Rift_Flopper_C>();
	}
};
static_assert(alignof(UGA_Athena_Rift_Flopper_C) == 0x000008, "Wrong alinment on UGA_Athena_Rift_Flopper_C");
static_assert(sizeof(UGA_Athena_Rift_Flopper_C) == 0x000C30, "Wrong size on UGA_Athena_Rift_Flopper_C");
static_assert(offsetof(UGA_Athena_Rift_Flopper_C, UberGraphFrame_GA_Athena_Rift_Flopper_C) == 0x000C10, "Member 'UGA_Athena_Rift_Flopper_C::UberGraphFrame_GA_Athena_Rift_Flopper_C' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Rift_Flopper_C, RiftItemHolster) == 0x000C18, "Member 'UGA_Athena_Rift_Flopper_C::RiftItemHolster' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Rift_Flopper_C, EquippingCue) == 0x000C20, "Member 'UGA_Athena_Rift_Flopper_C::EquippingCue' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Rift_Flopper_C, TeleportGameplayEffect) == 0x000C28, "Member 'UGA_Athena_Rift_Flopper_C::TeleportGameplayEffect' has a wrong offset!");

}

