#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_SuperTowerGrenadeWithTrajectory

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GA_Athena_UtilityGrenade_WithTrajectory_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_SuperTowerGrenadeWithTrajectory.GA_Athena_SuperTowerGrenadeWithTrajectory_C
// 0x0040 (0x0EB8 - 0x0E78)
class UGA_Athena_SuperTowerGrenadeWithTrajectory_C : public UGA_Athena_UtilityGrenade_WithTrajectory_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Athena_SuperTowerGrenadeWithTrajectory_C; // 0x0E78(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABP_ProjectileTrajectory_C*             ProjectileTrajectoryRed;                           // 0x0E80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 TrajectoryIndicatorRedClass;                       // 0x0E88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestItemDefinition*               QuestItemUsePortafort;                             // 0x0E90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  T_TargetTags;                                      // 0x0E98(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GA_Athena_SuperTowerGrenadeWithTrajectory(int32 EntryPoint, bool Temp_bool_Variable, const struct FVector& K2Node_Event_Location, const struct FRotator& K2Node_Event_Direction, class AGameStateBase* CallFunc_GetGameState_ReturnValue, class AFortGameStateAthena* K2Node_DynamicCast_AsFort_Game_State_Athena, bool K2Node_DynamicCast_bSuccess, TArray<struct FVector>& CallFunc_GetProjectileTrajectoryPoints_OutSplinePoints, TArray<struct FVector>& CallFunc_GetProjectileTrajectoryPoints_OutSplineTangents, const struct FHitResult& CallFunc_GetProjectileTrajectoryPoints_OutHitResult, const struct FGameplayTagContainer& CallFunc_GetAthenaPlaylistContextTags_ReturnValue, bool CallFunc_BreakHitResult_bBlockingHit, bool CallFunc_BreakHitResult_bInitialOverlap, float CallFunc_BreakHitResult_Time, float CallFunc_BreakHitResult_Distance, const struct FVector& CallFunc_BreakHitResult_Location, const struct FVector& CallFunc_BreakHitResult_ImpactPoint, const struct FVector& CallFunc_BreakHitResult_Normal, const struct FVector& CallFunc_BreakHitResult_ImpactNormal, class UPhysicalMaterial* CallFunc_BreakHitResult_PhysMat, class AActor* CallFunc_BreakHitResult_HitActor, class UPrimitiveComponent* CallFunc_BreakHitResult_HitComponent, class FName CallFunc_BreakHitResult_HitBoneName, int32 CallFunc_BreakHitResult_HitItem, int32 CallFunc_BreakHitResult_ElementIndex, int32 CallFunc_BreakHitResult_FaceIndex, const struct FVector& CallFunc_BreakHitResult_TraceStart, const struct FVector& CallFunc_BreakHitResult_TraceEnd, bool CallFunc_HasTag_ReturnValue, class AAthenaSupplyDropBalloon_C* K2Node_DynamicCast_AsAthena_Supply_Drop_Balloon, bool K2Node_DynamicCast_bSuccess_1, class AFortAthenaSupplyDrop* K2Node_DynamicCast_AsFort_Athena_Supply_Drop, bool K2Node_DynamicCast_bSuccess_2, class AFortPawn* K2Node_DynamicCast_AsFort_Pawn, bool K2Node_DynamicCast_bSuccess_3, class ABuildingProp* K2Node_DynamicCast_AsBuilding_Prop, bool K2Node_DynamicCast_bSuccess_4, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_BooleanOR_ReturnValue, class AFortPlayerPawn* CallFunc_GetOwningPlayer_Player_Pawn, bool CallFunc_BooleanOR_ReturnValue_1, class AController* CallFunc_GetController_ReturnValue, bool CallFunc_BooleanOR_ReturnValue_2, class AFortPlayerController* K2Node_DynamicCast_AsFort_Player_Controller, bool K2Node_DynamicCast_bSuccess_5, bool CallFunc_BooleanOR_ReturnValue_3, TArray<class AFortPlayerController*>& K2Node_MakeArray_Array, class ABP_ProjectileTrajectory_C* K2Node_Select_Default, class AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue, class AFortPlayerController* CallFunc_GetFortPlayerControllerFromActor_ReturnValue, bool Temp_bool_Variable_1, class UFortQuestManager* CallFunc_GetQuestManager_ReturnValue, bool CallFunc_SendComplexCustomStatEvent_QuestActive, bool CallFunc_SendComplexCustomStatEvent_QuestCompleted, class ABP_ProjectileTrajectory_C* K2Node_Select_Default_1);
	void CleanupTrajectoryDisplay();
	void UpdateTrajectorySpline();
	void Server_SpawnProjectile(const struct FVector& Location, const struct FRotator& Direction);
	void SetupDummyProjectileRed(class AFortPlayerPawn* CallFunc_GetOwningPlayer_Player_Pawn, bool CallFunc_IsValid_ReturnValue, struct FTransform& CallFunc_GetTransform_ReturnValue, class AActor* CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue, class AActor* CallFunc_FinishSpawningActor_ReturnValue, class ABP_ProjectileTrajectory_C* K2Node_DynamicCast_AsBP_Projectile_Trajectory, bool K2Node_DynamicCast_bSuccess);
	class AFortProjectileTrajectory* SpawnTrajectoryIndicator(bool bSpawnOnEquip, class AFortPlayerPawn* CallFunc_GetOwningPlayer_Player_Pawn, class AFortProjectileTrajectory* CallFunc_SpawnTrajectoryIndicator_ReturnValue, bool CallFunc_IsLocallyControlled_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_SuperTowerGrenadeWithTrajectory_C">();
	}
	static class UGA_Athena_SuperTowerGrenadeWithTrajectory_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_SuperTowerGrenadeWithTrajectory_C>();
	}
};
static_assert(alignof(UGA_Athena_SuperTowerGrenadeWithTrajectory_C) == 0x000008, "Wrong alinment on UGA_Athena_SuperTowerGrenadeWithTrajectory_C");
static_assert(sizeof(UGA_Athena_SuperTowerGrenadeWithTrajectory_C) == 0x000EB8, "Wrong size on UGA_Athena_SuperTowerGrenadeWithTrajectory_C");
static_assert(offsetof(UGA_Athena_SuperTowerGrenadeWithTrajectory_C, UberGraphFrame_GA_Athena_SuperTowerGrenadeWithTrajectory_C) == 0x000E78, "Member 'UGA_Athena_SuperTowerGrenadeWithTrajectory_C::UberGraphFrame_GA_Athena_SuperTowerGrenadeWithTrajectory_C' has a wrong offset!");
static_assert(offsetof(UGA_Athena_SuperTowerGrenadeWithTrajectory_C, ProjectileTrajectoryRed) == 0x000E80, "Member 'UGA_Athena_SuperTowerGrenadeWithTrajectory_C::ProjectileTrajectoryRed' has a wrong offset!");
static_assert(offsetof(UGA_Athena_SuperTowerGrenadeWithTrajectory_C, TrajectoryIndicatorRedClass) == 0x000E88, "Member 'UGA_Athena_SuperTowerGrenadeWithTrajectory_C::TrajectoryIndicatorRedClass' has a wrong offset!");
static_assert(offsetof(UGA_Athena_SuperTowerGrenadeWithTrajectory_C, QuestItemUsePortafort) == 0x000E90, "Member 'UGA_Athena_SuperTowerGrenadeWithTrajectory_C::QuestItemUsePortafort' has a wrong offset!");
static_assert(offsetof(UGA_Athena_SuperTowerGrenadeWithTrajectory_C, T_TargetTags) == 0x000E98, "Member 'UGA_Athena_SuperTowerGrenadeWithTrajectory_C::T_TargetTags' has a wrong offset!");

}

