#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_Track_DangerGrape

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_Track_DangerGrape.GA_Athena_Track_DangerGrape_C
// 0x0040 (0x0AF8 - 0x0AB8)
class UGA_Athena_Track_DangerGrape_C final  : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AB8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class AActor*>                         SpawnedDecoys;                                     // 0x0AC0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, HasGetValueTypeHash)
	struct FScalableFloat                         MaxActorsInWorld;                                  // 0x0AD0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GA_Athena_Track_DangerGrape(int32 EntryPoint, const struct FGameplayEventData& K2Node_CustomEvent_Payload_1, const struct FGameplayEventData& Temp_struct_Variable, class UAbilityTask_WaitGameplayEvent* CallFunc_WaitGameplayEvent_ReturnValue, class AActor* K2Node_DynamicCast_AsActor, bool K2Node_DynamicCast_bSuccess, bool CallFunc_IsValid_ReturnValue, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, const struct FGameplayEventData& K2Node_CustomEvent_Payload, TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_1, TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_2, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable, const struct FGameplayAbilityActorInfo& CallFunc_GetActorInfo_ReturnValue, class AFortPlayerPawn* K2Node_DynamicCast_AsFort_Player_Pawn, bool K2Node_DynamicCast_bSuccess_1, class AController* CallFunc_GetController_ReturnValue, const struct FGameplayAbilityTargetDataHandle& CallFunc_AbilityTargetDataFromActor_ReturnValue, class AFortPlayerControllerZone* K2Node_DynamicCast_AsFort_Player_Controller_Zone, bool K2Node_DynamicCast_bSuccess_2, TArray<struct FActiveGameplayEffectHandle>& CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue, bool CallFunc_K2_CommitAbility_ReturnValue, bool K2Node_Event_bWasCancelled, int32 CallFunc_Array_Length_ReturnValue, float CallFunc_GetValueAtLevel_ReturnValue, int32 CallFunc_FTrunc_ReturnValue, class AActor* CallFunc_Array_Get_Item, bool CallFunc_LessEqual_IntInt_ReturnValue, class ABP_Pawn_DangerGrape_C* K2Node_DynamicCast_AsBP_Pawn_Danger_Grape, bool K2Node_DynamicCast_bSuccess_3, class UAbilityTask_WaitGameplayEvent* CallFunc_WaitGameplayEvent_ReturnValue_1, int32 CallFunc_Array_Find_ReturnValue, class AActor* CallFunc_Array_Get_Item_1, class ABP_Pawn_DangerGrape_C* K2Node_DynamicCast_AsBP_Pawn_Danger_Grape_1, bool K2Node_DynamicCast_bSuccess_4, bool CallFunc_IsValid_ReturnValue_1, const struct FGameplayEventData& Temp_struct_Variable_1, class AActor* K2Node_DynamicCast_AsActor_1, bool K2Node_DynamicCast_bSuccess_5, int32 CallFunc_Array_Add_ReturnValue, class AActor* CallFunc_Array_Get_Item_2, int32 CallFunc_Array_Length_ReturnValue_1, class ABP_Pawn_DangerGrape_C* K2Node_DynamicCast_AsBP_Pawn_Danger_Grape_2, bool K2Node_DynamicCast_bSuccess_6, bool CallFunc_Less_IntInt_ReturnValue);
	void On_Possesed_Pawn_Died();
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_ActivateAbility();
	void EventReceived_13B4A7014CFACBC3914C3BA737F355B3(const struct FGameplayEventData& Payload);
	void EventReceived_CECFA813476EFF4163BB1EAFBFD4E985(const struct FGameplayEventData& Payload);
	void OnRep_SnowmenActors();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_Track_DangerGrape_C">();
	}
	static class UGA_Athena_Track_DangerGrape_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_Track_DangerGrape_C>();
	}
};
static_assert(alignof(UGA_Athena_Track_DangerGrape_C) == 0x000008, "Wrong alinment on UGA_Athena_Track_DangerGrape_C");
static_assert(sizeof(UGA_Athena_Track_DangerGrape_C) == 0x000AF8, "Wrong size on UGA_Athena_Track_DangerGrape_C");
static_assert(offsetof(UGA_Athena_Track_DangerGrape_C, UberGraphFrame) == 0x000AB8, "Member 'UGA_Athena_Track_DangerGrape_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Track_DangerGrape_C, SpawnedDecoys) == 0x000AC0, "Member 'UGA_Athena_Track_DangerGrape_C::SpawnedDecoys' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Track_DangerGrape_C, MaxActorsInWorld) == 0x000AD0, "Member 'UGA_Athena_Track_DangerGrape_C::MaxActorsInWorld' has a wrong offset!");

}

