#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_Knockback_Parent

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Athena_Knockback_Parent_Type_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_Knockback_Parent.GA_Athena_Knockback_Parent_C
// 0x0290 (0x0D48 - 0x0AB8)
class UGA_Athena_Knockback_Parent_C : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AB8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AActor*                                 Launcher;                                          // 0x0AC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Target;                                            // 0x0AC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  TC_TagsToIgnore;                                   // 0x0AD0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_XYKnockMag;                                    // 0x0AF0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_ZKnockMag;                                     // 0x0B18(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_ZAdd;                                          // 0x0B40(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          ZAlwayzPositive;                                   // 0x0B68(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          KnockTowardsLauncher;                              // 0x0B69(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C71[0x6];                                     // 0x0B6A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         Row_ZVelPercentMaintained;                         // 0x0B70(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_XYVelPercentMaintained;                        // 0x0B98(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_PhysicsObjectImpulseMultiplier;                // 0x0BC0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  DefaultTags;                                       // 0x0BE8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, AdvancedDisplay)
	struct FVector                                FinalLaunchVel;                                    // 0x0C08(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	float                                         DistanceMagMult;                                   // 0x0C14(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	float                                         Distance;                                          // 0x0C18(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	float                                         LaunchDuration;                                    // 0x0C1C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          XYMagUsesInstigatorDistanceMod;                    // 0x0C20(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ZMagUsesInstigatorDistanceMod;                     // 0x0C21(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C72[0x6];                                     // 0x0C22(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         Row_MinDistance;                                   // 0x0C28(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_MaxDistance;                                   // 0x0C50(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          ResetFallHeight;                                   // 0x0C78(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ImpulseMustBePositiveForReset;                     // 0x0C79(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	EAthena_Knockback_Parent_Type                 LaunchType;                                        // 0x0C7A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          KnocksVehicles;                                    // 0x0C7B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C73[0x4];                                     // 0x0C7C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         Row_VehicleXYMult;                                 // 0x0C80(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_VehicleZMult;                                  // 0x0CA8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	ERootMotionFinishVelocityMode                 VelocityOnFinish;                                  // 0x0CD0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C74[0x3];                                     // 0x0CD1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                SetVelocityOnFinish;                               // 0x0CD4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ClampVelocityOnFinish;                             // 0x0CE0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UsesGravity;                                       // 0x0CE4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor)
	bool                                          AccountsForGravityZScale;                          // 0x0CE5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C75[0x2];                                     // 0x0CE6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LowZGravityDampenerIntensity;                      // 0x0CE8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HighZGravityMultiplierIntensity;                   // 0x0CEC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            Curve_StrengthOverTime;                            // 0x0CF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveVector*                           Curve_PathOffset;                                  // 0x0CF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_Knockback_Status;                               // 0x0D00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldApplyKnockbackStatus;                        // 0x0D08(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          SetKnockbackDurationEqualToLaunchDuration;         // 0x0D09(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C76[0x6];                                     // 0x0D0A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         Row_KnockbackDuration;                             // 0x0D10(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         LocalGravityScale;                                 // 0x0D38(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Tag_BuildingPhysics;                               // 0x0D3C(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         FailsafeDelay;                                     // 0x0D44(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Athena_Knockback_Parent(int32 EntryPoint, float CallFunc_BreakVector_X, float CallFunc_BreakVector_Y, float CallFunc_BreakVector_Z, bool CallFunc_Greater_FloatFloat_ReturnValue, const struct FVector& CallFunc_CalcVehicleMult_ReturnValue, float CallFunc_VSize_ReturnValue, const struct FVector& CallFunc_Normal_ReturnValue, const struct FGameplayEffectContextHandle& CallFunc_GetGrantedByEffectContext_ReturnValue, class AActor* CallFunc_EffectContextGetEffectCauser_ReturnValue, class AFortPlayerController* CallFunc_GetFortPlayerControllerFromActor_ReturnValue, class AActor* CallFunc_Find_Launcher_LauncherOut, bool CallFunc_IsValid_ReturnValue, class AActor* CallFunc_GetOwner_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, class AFortPlayerController* CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1, bool Temp_bool_Variable, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_BooleanOR_ReturnValue, bool CallFunc_BooleanOR_ReturnValue_1, class AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue, bool CallFunc_IsValid_ReturnValue_2, bool Temp_bool_Variable_1, class AController* K2Node_Select_Default, const struct FVector& CallFunc_GetKnockbackOrigin_ReturnValue, bool CallFunc_IsValid_ReturnValue_3, bool Temp_bool_Variable_2, class AFortPawn* K2Node_DynamicCast_AsFort_Pawn, bool K2Node_DynamicCast_bSuccess, class AController* CallFunc_GetController_ReturnValue, bool CallFunc_IsBotControlled_ReturnValue, class AFortAthenaAIBotController* K2Node_DynamicCast_AsFort_Athena_AIBot_Controller, bool K2Node_DynamicCast_bSuccess_1, class AFortPlayerPawnAthena* K2Node_DynamicCast_AsFort_Player_Pawn_Athena, bool K2Node_DynamicCast_bSuccess_2, TScriptInterface<class IFortVehicleInterface> K2Node_DynamicCast_AsFort_Vehicle_Interface, bool K2Node_DynamicCast_bSuccess_3, class AActor* CallFunc_GetVehicleActorPtr_ReturnValue, TScriptInterface<class IFortVehicleInterface> K2Node_DynamicCast_AsFort_Vehicle_Interface_1, bool K2Node_DynamicCast_bSuccess_4, bool Temp_bool_Variable_3, TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface, bool K2Node_DynamicCast_bSuccess_5, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, bool CallFunc_HasAnyMatchingGameplayTags_ReturnValue, float CallFunc_CalculateDistanceMod_ModAmount, bool CallFunc_CalculateDistanceMod_AboveMax, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue_1, const struct FVector& K2Node_Select_Default_1, const struct FVector& CallFunc_Get_Initial_Knock_Mag_LaunchMag, const struct FVector& CallFunc_CalculateVelocityMaintained_ModifiedLaunchSpeed, const struct FVector& K2Node_CustomEvent_Vel, const struct FVector& CallFunc_Normal_ReturnValue_1, float CallFunc_VSize_ReturnValue_1, const struct FVector& CallFunc_GetTargetLocation_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, class UAbilityTask_ApplyRootMotionMoveToForce* CallFunc_ApplyRootMotionMoveToForce_ReturnValue, bool CallFunc_IsValid_ReturnValue_4, float CallFunc_CheckGravityScale_ReturnValue, float CallFunc_CheckGravityScale_ReturnValue_1, float CallFunc_Multiply_FloatFloat_ReturnValue, float CallFunc_Multiply_FloatFloat_ReturnValue_1, class UAbilityTask_ApplyRootMotionConstantForce* CallFunc_ApplyRootMotionConstantForce_ReturnValue, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue, bool CallFunc_IsValid_ReturnValue_5, bool Temp_bool_Variable_4, bool CallFunc_Not_PreBool_ReturnValue_1, const struct FGameplayEffectSpecHandle& CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue, float CallFunc_GetValueAtLevel_ReturnValue, class AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1, float K2Node_Select_Default_2, float CallFunc_FMax_ReturnValue, class AActor* K2Node_CustomEvent_Actor, const struct FGameplayEffectSpecHandle& CallFunc_SetDuration_ReturnValue, TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface_1, bool K2Node_DynamicCast_bSuccess_6, const struct FActiveGameplayEffectHandle& CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue, class USceneComponent* CallFunc_K2_GetRootComponent_ReturnValue, bool CallFunc_GetActorEnableCollision_ReturnValue, class UPrimitiveComponent* K2Node_DynamicCast_AsPrimitive_Component, bool K2Node_DynamicCast_bSuccess_7, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_1, class UFortPhysicsObjectComponent* CallFunc_GetComponentByClass_ReturnValue, bool CallFunc_IsValid_ReturnValue_6, bool CallFunc_HasMatchingGameplayTag_ReturnValue, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_1, TDelegate<void(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum)> K2Node_CreateDelegate_OutputDelegate_2, class AActor* K2Node_CustomEvent_DamagedActor, float K2Node_CustomEvent_Damage, class AController* K2Node_CustomEvent_InstigatedBy, class AActor* K2Node_CustomEvent_DamageCauser, const struct FVector& K2Node_CustomEvent_HitLocation, class UPrimitiveComponent* K2Node_CustomEvent_FHitComponent, class FName K2Node_CustomEvent_BoneName, const struct FVector& K2Node_CustomEvent_Momentum, float CallFunc_GetValueAtLevel_ReturnValue_1, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_3, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue_1, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_4);
	void FailsafeEndAbility();
	void OwningPawnDied(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void LaunchBuldingActors(class AActor* Actor);
	void LaunchFinished();
	void DoLaunch(const struct FVector& Vel);
	void K2_ActivateAbility();
	void OnTimedOut_C8C9B5D948887DE06B469CAFC5621C02();
	void OnTimedOutAndDestinationReached_C8C9B5D948887DE06B469CAFC5621C02();
	void OnFinish_78B7A0C144DB79535B9890B75AE5F853();
	void CalculateVelocityMaintained(class AActor* LaunchTarget, const struct FVector& LaunchMagIn, struct FVector* ModifiedLaunchSpeed, const struct FVector& CallFunc_GetVelocity_ReturnValue, float CallFunc_GetValueAtLevel_ReturnValue, float CallFunc_BreakVector_X, float CallFunc_BreakVector_Y, float CallFunc_BreakVector_Z, float CallFunc_Multiply_FloatFloat_ReturnValue, float CallFunc_GetValueAtLevel_ReturnValue_1, float CallFunc_Multiply_FloatFloat_ReturnValue_1, float CallFunc_Multiply_FloatFloat_ReturnValue_2, const struct FVector& CallFunc_MakeVector_ReturnValue, const struct FVector& CallFunc_Add_VectorVector_ReturnValue);
	void Get_Initial_Knock_Mag(const struct FVector& Direction, struct FVector* LaunchMag, const struct FVector& CallFunc_Normal_ReturnValue, float CallFunc_GetValueAtLevel_ReturnValue, float CallFunc_BreakVector_X, float CallFunc_BreakVector_Y, float CallFunc_BreakVector_Z, float CallFunc_FClamp_ReturnValue, float CallFunc_SelectFloat_ReturnValue, float CallFunc_GetValueAtLevel_ReturnValue_1, float CallFunc_Multiply_FloatFloat_ReturnValue, float CallFunc_SelectFloat_ReturnValue_1, float CallFunc_GetValueAtLevel_ReturnValue_2, float CallFunc_Multiply_FloatFloat_ReturnValue_1, float CallFunc_Multiply_FloatFloat_ReturnValue_2, float CallFunc_SelectFloat_ReturnValue_2, float CallFunc_Multiply_FloatFloat_ReturnValue_3, float CallFunc_Multiply_FloatFloat_ReturnValue_4, const struct FVector& CallFunc_MakeVector_ReturnValue, float CallFunc_BreakVector_X_1, float CallFunc_BreakVector_Y_1, float CallFunc_BreakVector_Z_1, float CallFunc_Add_FloatFloat_ReturnValue, const struct FVector& CallFunc_MakeVector_ReturnValue_1);
	struct FVector GetKnockbackOrigin(class AActor* OriginActor, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue);
	void CalculateDistanceMod(const struct FVector& TargetLocation, const struct FVector& KnockOrigin, float* ModAmount, bool* AboveMax, float CallFunc_DistanceBetweenTwoVectors_Distance, float CallFunc_GetValueAtLevel_ReturnValue, bool CallFunc_Greater_FloatFloat_ReturnValue, float CallFunc_GetValueAtLevel_ReturnValue_1, bool CallFunc_Less_FloatFloat_ReturnValue, float CallFunc_Divide_FloatFloat_ReturnValue, float CallFunc_Subtract_FloatFloat_ReturnValue, float CallFunc_Abs_ReturnValue);
	struct FVector CalcVehicleMult(const struct FVector& InVec, float CallFunc_BreakVector_X, float CallFunc_BreakVector_Y, float CallFunc_BreakVector_Z, float CallFunc_GetValueAtLevel_ReturnValue, float CallFunc_Multiply_FloatFloat_ReturnValue, float CallFunc_GetValueAtLevel_ReturnValue_1, float CallFunc_Multiply_FloatFloat_ReturnValue_1, float CallFunc_Multiply_FloatFloat_ReturnValue_2, const struct FVector& CallFunc_MakeVector_ReturnValue);
	struct FVector GetTargetLocation(float CallFunc_GetValueAtLevel_ReturnValue, float CallFunc_GetValueAtLevel_ReturnValue_1, const struct FVector& CallFunc_MakeVector_ReturnValue, float CallFunc_GetValueAtLevel_ReturnValue_2, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, const struct FVector& CallFunc_MakeVector_ReturnValue_1, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_1, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue, const struct FVector& CallFunc_Normal_ReturnValue, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue, const struct FVector& CallFunc_Add_VectorVector_ReturnValue, const struct FVector& CallFunc_Add_VectorVector_ReturnValue_1, const struct FVector& CallFunc_Add_VectorVector_ReturnValue_2);
	void Find_Launcher(class AActor* DefaultLauncher, class AActor** LauncherOut);
	float CheckGravityScale(const struct FGameplayAttribute& Attribute_Gravity_Scale, float CallFunc_Multiply_FloatFloat_ReturnValue, bool CallFunc_Greater_FloatFloat_ReturnValue, bool CallFunc_Less_FloatFloat_ReturnValue, float CallFunc_SafeDivide_ReturnValue, class UCharacterMovementComponent* CallFunc_GetComponentByClass_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute, float CallFunc_GetFloatAttribute_ReturnValue, bool CallFunc_EqualEqual_FloatFloat_ReturnValue, bool CallFunc_BooleanAND_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_Knockback_Parent_C">();
	}
	static class UGA_Athena_Knockback_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_Knockback_Parent_C>();
	}
};
static_assert(alignof(UGA_Athena_Knockback_Parent_C) == 0x000008, "Wrong alinment on UGA_Athena_Knockback_Parent_C");
static_assert(sizeof(UGA_Athena_Knockback_Parent_C) == 0x000D48, "Wrong size on UGA_Athena_Knockback_Parent_C");
static_assert(offsetof(UGA_Athena_Knockback_Parent_C, UberGraphFrame) == 0x000AB8, "Member 'UGA_Athena_Knockback_Parent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Knockback_Parent_C, Launcher) == 0x000AC0, "Member 'UGA_Athena_Knockback_Parent_C::Launcher' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Knockback_Parent_C, Target) == 0x000AC8, "Member 'UGA_Athena_Knockback_Parent_C::Target' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Knockback_Parent_C, TC_TagsToIgnore) == 0x000AD0, "Member 'UGA_Athena_Knockback_Parent_C::TC_TagsToIgnore' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Knockback_Parent_C, Row_XYKnockMag) == 0x000AF0, "Member 'UGA_Athena_Knockback_Parent_C::Row_XYKnockMag' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Knockback_Parent_C, Row_ZKnockMag) == 0x000B18, "Member 'UGA_Athena_Knockback_Parent_C::Row_ZKnockMag' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Knockback_Parent_C, Row_ZAdd) == 0x000B40, "Member 'UGA_Athena_Knockback_Parent_C::Row_ZAdd' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Knockback_Parent_C, ZAlwayzPositive) == 0x000B68, "Member 'UGA_Athena_Knockback_Parent_C::ZAlwayzPositive' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Knockback_Parent_C, KnockTowardsLauncher) == 0x000B69, "Member 'UGA_Athena_Knockback_Parent_C::KnockTowardsLauncher' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Knockback_Parent_C, Row_ZVelPercentMaintained) == 0x000B70, "Member 'UGA_Athena_Knockback_Parent_C::Row_ZVelPercentMaintained' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Knockback_Parent_C, Row_XYVelPercentMaintained) == 0x000B98, "Member 'UGA_Athena_Knockback_Parent_C::Row_XYVelPercentMaintained' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Knockback_Parent_C, Row_PhysicsObjectImpulseMultiplier) == 0x000BC0, "Member 'UGA_Athena_Knockback_Parent_C::Row_PhysicsObjectImpulseMultiplier' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Knockback_Parent_C, DefaultTags) == 0x000BE8, "Member 'UGA_Athena_Knockback_Parent_C::DefaultTags' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Knockback_Parent_C, FinalLaunchVel) == 0x000C08, "Member 'UGA_Athena_Knockback_Parent_C::FinalLaunchVel' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Knockback_Parent_C, DistanceMagMult) == 0x000C14, "Member 'UGA_Athena_Knockback_Parent_C::DistanceMagMult' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Knockback_Parent_C, Distance) == 0x000C18, "Member 'UGA_Athena_Knockback_Parent_C::Distance' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Knockback_Parent_C, LaunchDuration) == 0x000C1C, "Member 'UGA_Athena_Knockback_Parent_C::LaunchDuration' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Knockback_Parent_C, XYMagUsesInstigatorDistanceMod) == 0x000C20, "Member 'UGA_Athena_Knockback_Parent_C::XYMagUsesInstigatorDistanceMod' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Knockback_Parent_C, ZMagUsesInstigatorDistanceMod) == 0x000C21, "Member 'UGA_Athena_Knockback_Parent_C::ZMagUsesInstigatorDistanceMod' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Knockback_Parent_C, Row_MinDistance) == 0x000C28, "Member 'UGA_Athena_Knockback_Parent_C::Row_MinDistance' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Knockback_Parent_C, Row_MaxDistance) == 0x000C50, "Member 'UGA_Athena_Knockback_Parent_C::Row_MaxDistance' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Knockback_Parent_C, ResetFallHeight) == 0x000C78, "Member 'UGA_Athena_Knockback_Parent_C::ResetFallHeight' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Knockback_Parent_C, ImpulseMustBePositiveForReset) == 0x000C79, "Member 'UGA_Athena_Knockback_Parent_C::ImpulseMustBePositiveForReset' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Knockback_Parent_C, LaunchType) == 0x000C7A, "Member 'UGA_Athena_Knockback_Parent_C::LaunchType' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Knockback_Parent_C, KnocksVehicles) == 0x000C7B, "Member 'UGA_Athena_Knockback_Parent_C::KnocksVehicles' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Knockback_Parent_C, Row_VehicleXYMult) == 0x000C80, "Member 'UGA_Athena_Knockback_Parent_C::Row_VehicleXYMult' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Knockback_Parent_C, Row_VehicleZMult) == 0x000CA8, "Member 'UGA_Athena_Knockback_Parent_C::Row_VehicleZMult' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Knockback_Parent_C, VelocityOnFinish) == 0x000CD0, "Member 'UGA_Athena_Knockback_Parent_C::VelocityOnFinish' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Knockback_Parent_C, SetVelocityOnFinish) == 0x000CD4, "Member 'UGA_Athena_Knockback_Parent_C::SetVelocityOnFinish' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Knockback_Parent_C, ClampVelocityOnFinish) == 0x000CE0, "Member 'UGA_Athena_Knockback_Parent_C::ClampVelocityOnFinish' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Knockback_Parent_C, UsesGravity) == 0x000CE4, "Member 'UGA_Athena_Knockback_Parent_C::UsesGravity' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Knockback_Parent_C, AccountsForGravityZScale) == 0x000CE5, "Member 'UGA_Athena_Knockback_Parent_C::AccountsForGravityZScale' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Knockback_Parent_C, LowZGravityDampenerIntensity) == 0x000CE8, "Member 'UGA_Athena_Knockback_Parent_C::LowZGravityDampenerIntensity' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Knockback_Parent_C, HighZGravityMultiplierIntensity) == 0x000CEC, "Member 'UGA_Athena_Knockback_Parent_C::HighZGravityMultiplierIntensity' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Knockback_Parent_C, Curve_StrengthOverTime) == 0x000CF0, "Member 'UGA_Athena_Knockback_Parent_C::Curve_StrengthOverTime' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Knockback_Parent_C, Curve_PathOffset) == 0x000CF8, "Member 'UGA_Athena_Knockback_Parent_C::Curve_PathOffset' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Knockback_Parent_C, GE_Knockback_Status) == 0x000D00, "Member 'UGA_Athena_Knockback_Parent_C::GE_Knockback_Status' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Knockback_Parent_C, ShouldApplyKnockbackStatus) == 0x000D08, "Member 'UGA_Athena_Knockback_Parent_C::ShouldApplyKnockbackStatus' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Knockback_Parent_C, SetKnockbackDurationEqualToLaunchDuration) == 0x000D09, "Member 'UGA_Athena_Knockback_Parent_C::SetKnockbackDurationEqualToLaunchDuration' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Knockback_Parent_C, Row_KnockbackDuration) == 0x000D10, "Member 'UGA_Athena_Knockback_Parent_C::Row_KnockbackDuration' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Knockback_Parent_C, LocalGravityScale) == 0x000D38, "Member 'UGA_Athena_Knockback_Parent_C::LocalGravityScale' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Knockback_Parent_C, Tag_BuildingPhysics) == 0x000D3C, "Member 'UGA_Athena_Knockback_Parent_C::Tag_BuildingPhysics' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Knockback_Parent_C, FailsafeDelay) == 0x000D44, "Member 'UGA_Athena_Knockback_Parent_C::FailsafeDelay' has a wrong offset!");

}

