#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_ActivePower_LeapGlider_Parent

#include "Basic.hpp"

#include "GA_Athena_ActivePower_Leap_Parent_classes.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_ActivePower_LeapGlider_Parent.GA_Athena_ActivePower_LeapGlider_Parent_C
// 0x0110 (0x1090 - 0x0F80)
class UGA_Athena_ActivePower_LeapGlider_Parent_C : public UGA_Athena_ActivePower_Leap_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Athena_ActivePower_LeapGlider_Parent_C; // 0x0F80(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAthenaGliderItemDefinition*            Glider_Cosmetic_Override;                          // 0x0F88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             OpenGliderSoundCue;                                // 0x0F90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 LensEffectClass;                                   // 0x0F98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEmitterCameraLensEffectBase*           LensEffect;                                        // 0x0FA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  T_SkyDivingMessageTag;                             // 0x0FA8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           T_StartRedeploy;                                   // 0x0FC8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          GenericFailsafeHit;                                // 0x0FD0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ParachuteOpened;                                   // 0x0FD1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D1A[0x6];                                     // 0x0FD2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  T_OpenParahcute;                                   // 0x0FD8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  BlockedTags;                                       // 0x0FF8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  TC_GrantedActive;                                  // 0x1018(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  TC_InfCooldown;                                    // 0x1038(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 GE_MinActiveTime;                                  // 0x1058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         Row_MinActiveTime;                                 // 0x1060(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 GE_Active;                                         // 0x1088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Athena_ActivePower_LeapGlider_Parent(int32 EntryPoint, class UFortHUDContext* CallFunc_GetContext_ReturnValue, class UAbilityTask_NetworkSyncPoint* CallFunc_WaitNetSync_ReturnValue, TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate, bool CallFunc_IsValid_ReturnValue, const struct FGameplayEventData& K2Node_CustomEvent_Payload, const struct FGameplayEventData& Temp_struct_Variable, class UAbilityTask_WaitGameplayEvent* CallFunc_WaitGameplayEvent_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_1, class UAbilityTask_NetworkSyncPoint* CallFunc_WaitNetSync_ReturnValue_1, TDelegate<void(class UFortWorldItem* ItemDropped)> K2Node_CreateDelegate_OutputDelegate_2, bool CallFunc_IsValid_ReturnValue_2, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_3, class UAbilityTask_NetworkSyncPoint* CallFunc_WaitNetSync_ReturnValue_2, class USceneComponent* CallFunc_K2_GetRootComponent_ReturnValue, bool CallFunc_IsValid_ReturnValue_3, const struct FGameplayTag& K2Node_Event_NotifyTag, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_4, bool CallFunc_EqualEqual_GameplayTag_ReturnValue, class ACharacter* K2Node_CustomEvent_Character, EMovementMode K2Node_CustomEvent_PrevMovementMode, uint8 K2Node_CustomEvent_PreviousCustomMode, TDelegate<void(class ACharacter* Character, EMovementMode PrevMovementMode, uint8 PreviousCustomMode)> K2Node_CreateDelegate_OutputDelegate_5, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_6, struct FHitResult& K2Node_Event_Hit, bool CallFunc_K2_CommitAbility_ReturnValue, class UFortAbilitySystemComponent* CallFunc_GetFortAbilitySystemComponent_ReturnValue, bool K2Node_Event_bWasCancelled, class UFortWorldItem* K2Node_CustomEvent_ItemDropped, class UFortAbilitySystemComponent* CallFunc_GetFortAbilitySystemComponent_ReturnValue_1, class AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue, class AFortPlayerController* CallFunc_GetFortPlayerControllerFromActor_ReturnValue, class AFortPlayerControllerAthena* K2Node_DynamicCast_AsFort_Player_Controller_Athena, bool K2Node_DynamicCast_bSuccess, bool CallFunc_IsLocallyControlled_ReturnValue, class UAbilityTask_WaitGameplayTagAdded* CallFunc_WaitGameplayTagAdd_ReturnValue, bool CallFunc_IsValid_ReturnValue_4, class AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1, class AFortPlayerPawnAthena* K2Node_DynamicCast_AsFort_Player_Pawn_Athena, bool K2Node_DynamicCast_bSuccess_1, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_7, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_8, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_9, const struct FGameplayEffectSpecHandle& CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue, const struct FActiveGameplayEffectHandle& CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue, TDelegate<void(class ACharacter* Character, EMovementMode PrevMovementMode, uint8 PreviousCustomMode)> K2Node_CreateDelegate_OutputDelegate_10, class UAbilityTask_NetworkSyncPoint* CallFunc_WaitNetSync_ReturnValue_3, bool CallFunc_IsValid_ReturnValue_5, TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput, bool CallFunc_HasAnyMatchingGameplayTags_ReturnValue, float CallFunc_GetValueAtLevel_ReturnValue, const struct FGameplayEffectSpecHandle& CallFunc_SetDuration_ReturnValue, class UAudioComponent* CallFunc_SpawnSoundAttached_ReturnValue, const struct FActiveGameplayEffectHandle& CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue, class UFortHUDContext* CallFunc_GetContext_ReturnValue_1);
	void HandleItemEquip();
	void WeaponUnequipped();
	void BoardDroppedMidGlide(class UFortWorldItem* ItemDropped);
	void K2_OnEndAbility(bool bWasCancelled);
	void OnLand(struct FHitResult& Hit);
	void GenericFailSafe();
	void MovementModeChangeFailSafe(class ACharacter* Character, EMovementMode PrevMovementMode, uint8 PreviousCustomMode);
	void CastMontageNotifyStart(const struct FGameplayTag& NotifyTag);
	void K2_ActivateAbility();
	void PowerCommitFailed();
	void CastMontageCancelledOrInterrupted();
	void CastMontageNotifyEndAbility();
	void CastMontageBlendOut();
	void CleanupAbility();
	void OnSync_68C1AC134C9324B6EC0F089B02953286();
	void OnSync_3ADE1BE041AF08C4CB1C9FA374F2E496();
	void EventReceived_46002FDB48565B7FA88DA089C488CA73(const struct FGameplayEventData& Payload);
	void OnSync_48D3266A4217EF7058D7FCA507015CB5();
	void Added_9CF55B3043720DD4EE05809F2B45DD91();
	void OnSync_5B9655A74696A7C0515A278467F52358();
	void InitAbility(bool CallFunc_IsValidClass_ReturnValue, class AEmitterCameraLensEffectBase* CallFunc_SpawnCameraLensEffect_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_ActivePower_LeapGlider_Parent_C">();
	}
	static class UGA_Athena_ActivePower_LeapGlider_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_ActivePower_LeapGlider_Parent_C>();
	}
};
static_assert(alignof(UGA_Athena_ActivePower_LeapGlider_Parent_C) == 0x000008, "Wrong alinment on UGA_Athena_ActivePower_LeapGlider_Parent_C");
static_assert(sizeof(UGA_Athena_ActivePower_LeapGlider_Parent_C) == 0x001090, "Wrong size on UGA_Athena_ActivePower_LeapGlider_Parent_C");
static_assert(offsetof(UGA_Athena_ActivePower_LeapGlider_Parent_C, UberGraphFrame_GA_Athena_ActivePower_LeapGlider_Parent_C) == 0x000F80, "Member 'UGA_Athena_ActivePower_LeapGlider_Parent_C::UberGraphFrame_GA_Athena_ActivePower_LeapGlider_Parent_C' has a wrong offset!");
static_assert(offsetof(UGA_Athena_ActivePower_LeapGlider_Parent_C, Glider_Cosmetic_Override) == 0x000F88, "Member 'UGA_Athena_ActivePower_LeapGlider_Parent_C::Glider_Cosmetic_Override' has a wrong offset!");
static_assert(offsetof(UGA_Athena_ActivePower_LeapGlider_Parent_C, OpenGliderSoundCue) == 0x000F90, "Member 'UGA_Athena_ActivePower_LeapGlider_Parent_C::OpenGliderSoundCue' has a wrong offset!");
static_assert(offsetof(UGA_Athena_ActivePower_LeapGlider_Parent_C, LensEffectClass) == 0x000F98, "Member 'UGA_Athena_ActivePower_LeapGlider_Parent_C::LensEffectClass' has a wrong offset!");
static_assert(offsetof(UGA_Athena_ActivePower_LeapGlider_Parent_C, LensEffect) == 0x000FA0, "Member 'UGA_Athena_ActivePower_LeapGlider_Parent_C::LensEffect' has a wrong offset!");
static_assert(offsetof(UGA_Athena_ActivePower_LeapGlider_Parent_C, T_SkyDivingMessageTag) == 0x000FA8, "Member 'UGA_Athena_ActivePower_LeapGlider_Parent_C::T_SkyDivingMessageTag' has a wrong offset!");
static_assert(offsetof(UGA_Athena_ActivePower_LeapGlider_Parent_C, T_StartRedeploy) == 0x000FC8, "Member 'UGA_Athena_ActivePower_LeapGlider_Parent_C::T_StartRedeploy' has a wrong offset!");
static_assert(offsetof(UGA_Athena_ActivePower_LeapGlider_Parent_C, GenericFailsafeHit) == 0x000FD0, "Member 'UGA_Athena_ActivePower_LeapGlider_Parent_C::GenericFailsafeHit' has a wrong offset!");
static_assert(offsetof(UGA_Athena_ActivePower_LeapGlider_Parent_C, ParachuteOpened) == 0x000FD1, "Member 'UGA_Athena_ActivePower_LeapGlider_Parent_C::ParachuteOpened' has a wrong offset!");
static_assert(offsetof(UGA_Athena_ActivePower_LeapGlider_Parent_C, T_OpenParahcute) == 0x000FD8, "Member 'UGA_Athena_ActivePower_LeapGlider_Parent_C::T_OpenParahcute' has a wrong offset!");
static_assert(offsetof(UGA_Athena_ActivePower_LeapGlider_Parent_C, BlockedTags) == 0x000FF8, "Member 'UGA_Athena_ActivePower_LeapGlider_Parent_C::BlockedTags' has a wrong offset!");
static_assert(offsetof(UGA_Athena_ActivePower_LeapGlider_Parent_C, TC_GrantedActive) == 0x001018, "Member 'UGA_Athena_ActivePower_LeapGlider_Parent_C::TC_GrantedActive' has a wrong offset!");
static_assert(offsetof(UGA_Athena_ActivePower_LeapGlider_Parent_C, TC_InfCooldown) == 0x001038, "Member 'UGA_Athena_ActivePower_LeapGlider_Parent_C::TC_InfCooldown' has a wrong offset!");
static_assert(offsetof(UGA_Athena_ActivePower_LeapGlider_Parent_C, GE_MinActiveTime) == 0x001058, "Member 'UGA_Athena_ActivePower_LeapGlider_Parent_C::GE_MinActiveTime' has a wrong offset!");
static_assert(offsetof(UGA_Athena_ActivePower_LeapGlider_Parent_C, Row_MinActiveTime) == 0x001060, "Member 'UGA_Athena_ActivePower_LeapGlider_Parent_C::Row_MinActiveTime' has a wrong offset!");
static_assert(offsetof(UGA_Athena_ActivePower_LeapGlider_Parent_C, GE_Active) == 0x001088, "Member 'UGA_Athena_ActivePower_LeapGlider_Parent_C::GE_Active' has a wrong offset!");

}

