#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_Thermal_Parent_PostProcess

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_Thermal_Parent_PostProcess.GA_Athena_Thermal_Parent_PostProcess_C
// 0x0058 (0x0B10 - 0x0AB8)
class UGA_Athena_Thermal_Parent_PostProcess_C : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AB8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTag                           PP_Cue;                                            // 0x0AC0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerAthena*            PlayerController;                                  // 0x0AC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  TC_QuestTargetTags;                                // 0x0AD0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  NullTagContainer;                                  // 0x0AF0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GA_Athena_Thermal_Parent_PostProcess(int32 EntryPoint, bool CallFunc_IsServer_ReturnValue, bool K2Node_Event_bWasCancelled, bool CallFunc_IsServer_ReturnValue_1, class AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue, class AFortPawn* K2Node_DynamicCast_AsFort_Pawn, bool K2Node_DynamicCast_bSuccess, class APlayerController* CallFunc_GetLocalViewingPlayerController_ReturnValue, class AFortPlayerControllerAthena* K2Node_DynamicCast_AsFort_Player_Controller_Athena, bool K2Node_DynamicCast_bSuccess_1, class AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1, class AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2, const struct FGameplayCueParameters& CallFunc_MakeGameplayCueParameters_ReturnValue, const struct FGameplayCueParameters& CallFunc_MakeGameplayCueParameters_ReturnValue_1, bool CallFunc_IsValid_ReturnValue, class AFortPawn* CallFunc_GetActivatingPawn_ReturnValue, class AFortPlayerController* CallFunc_GetFortPlayerControllerFromActor_ReturnValue, class UFortQuestManager* CallFunc_GetQuestManager_ReturnValue, bool CallFunc_SendComplexCustomStatEvent_QuestActive, bool CallFunc_SendComplexCustomStatEvent_QuestCompleted, bool CallFunc_EqualEqual_GameplayTagContainer_ReturnValue);
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_ActivateAbility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_Thermal_Parent_PostProcess_C">();
	}
	static class UGA_Athena_Thermal_Parent_PostProcess_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_Thermal_Parent_PostProcess_C>();
	}
};
static_assert(alignof(UGA_Athena_Thermal_Parent_PostProcess_C) == 0x000008, "Wrong alinment on UGA_Athena_Thermal_Parent_PostProcess_C");
static_assert(sizeof(UGA_Athena_Thermal_Parent_PostProcess_C) == 0x000B10, "Wrong size on UGA_Athena_Thermal_Parent_PostProcess_C");
static_assert(offsetof(UGA_Athena_Thermal_Parent_PostProcess_C, UberGraphFrame) == 0x000AB8, "Member 'UGA_Athena_Thermal_Parent_PostProcess_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Thermal_Parent_PostProcess_C, PP_Cue) == 0x000AC0, "Member 'UGA_Athena_Thermal_Parent_PostProcess_C::PP_Cue' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Thermal_Parent_PostProcess_C, PlayerController) == 0x000AC8, "Member 'UGA_Athena_Thermal_Parent_PostProcess_C::PlayerController' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Thermal_Parent_PostProcess_C, TC_QuestTargetTags) == 0x000AD0, "Member 'UGA_Athena_Thermal_Parent_PostProcess_C::TC_QuestTargetTags' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Thermal_Parent_PostProcess_C, NullTagContainer) == 0x000AF0, "Member 'UGA_Athena_Thermal_Parent_PostProcess_C::NullTagContainer' has a wrong offset!");

}

