#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_ChillBronco

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GA_ThrowConsumable_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_ChillBronco.GA_Athena_ChillBronco_C
// 0x0010 (0x0E58 - 0x0E48)
class UGA_Athena_ChillBronco_C final  : public UGA_ThrowConsumable_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Athena_ChillBronco_C;            // 0x0E48(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Added_X_SpawnRotation;                             // 0x0E50(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Added_Y_SpawnRotation;                             // 0x0E54(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Athena_ChillBronco(int32 EntryPoint, class AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue, class AFortPlayerController* CallFunc_GetFortPlayerControllerFromActor_ReturnValue, class AFortProjectileBase* K2Node_Event_SpawnedProjectile, class UFortQuestManager* CallFunc_GetQuestManager_ReturnValue, bool CallFunc_SendComplexCustomStatEvent_QuestActive, bool CallFunc_SendComplexCustomStatEvent_QuestCompleted);
	void OnProjectileSpawned(class AFortProjectileBase* Param_SpawnedProjectile);
	void SpawnThrownProjectile(class UClass* Param_ProjectileClass, struct FVector& ProjectileSpawnLocation, struct FRotator& ProjectileSpawnDirection, const struct FFortGameplayEffectContainerSpec& Param_HitEffectContainerSpec, const struct FFortGameplayEffectContainerSpec& Param_ExplosionEffectContainerSpec, float ProjectileInitialSpeed, float Param_ProjectileGravityScale, class AFortProjectileBase** Param_SpawnedProjectile, class AFortProjectileBase* CallFunc_SpawnThrownProjectile_SpawnedProjectile, const struct FRotator& CallFunc_K2_GetActorRotation_ReturnValue, float CallFunc_BreakRotator_Roll, float CallFunc_BreakRotator_Pitch, float CallFunc_BreakRotator_Yaw, float CallFunc_Add_FloatFloat_ReturnValue, float CallFunc_Add_FloatFloat_ReturnValue_1, const struct FRotator& CallFunc_MakeRotator_ReturnValue, bool CallFunc_K2_SetActorRotation_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_ChillBronco_C">();
	}
	static class UGA_Athena_ChillBronco_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_ChillBronco_C>();
	}
};
static_assert(alignof(UGA_Athena_ChillBronco_C) == 0x000008, "Wrong alinment on UGA_Athena_ChillBronco_C");
static_assert(sizeof(UGA_Athena_ChillBronco_C) == 0x000E58, "Wrong size on UGA_Athena_ChillBronco_C");
static_assert(offsetof(UGA_Athena_ChillBronco_C, UberGraphFrame_GA_Athena_ChillBronco_C) == 0x000E48, "Member 'UGA_Athena_ChillBronco_C::UberGraphFrame_GA_Athena_ChillBronco_C' has a wrong offset!");
static_assert(offsetof(UGA_Athena_ChillBronco_C, Added_X_SpawnRotation) == 0x000E50, "Member 'UGA_Athena_ChillBronco_C::Added_X_SpawnRotation' has a wrong offset!");
static_assert(offsetof(UGA_Athena_ChillBronco_C, Added_Y_SpawnRotation) == 0x000E54, "Member 'UGA_Athena_ChillBronco_C::Added_Y_SpawnRotation' has a wrong offset!");

}

