#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Cosmos_MeleeAttack

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Cosmos_MeleeAttack.GA_Cosmos_MeleeAttack_C
// 0x0198 (0x0C50 - 0x0AB8)
class UGA_Cosmos_MeleeAttack_C final  : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AB8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0AC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  T_HudElementToHide;                                // 0x0AC8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          SuccessfulHit;                                     // 0x0AE8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7CC3[0x3];                                     // 0x0AE9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           MeleeMissCue;                                      // 0x0AEC(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Tag_FindTarget;                                    // 0x0AF4(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         FailsafeAbilityDuration;                           // 0x0AFC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Fail_Safe_Timer_Handle;                            // 0x0B00(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 TargetActor;                                       // 0x0B08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DistanceToTarget;                                  // 0x0B10(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ActorsCombinedScaledRadiusSize;                    // 0x0B14(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         DesiredLandingDistanceFromTarget;                  // 0x0B18(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         MinTravelDuration;                                 // 0x0B40(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         MaxTravelDuration;                                 // 0x0B68(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UCurveVector*                           PathOffsetCurve;                                   // 0x0B90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         TravelDistanceNoTarget;                            // 0x0B98(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           Tag_DamageContainer;                               // 0x0BC0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Tag_EndAbility;                                    // 0x0BC8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          ConstrainNoTargetMovementToHorizontalOnly;         // 0x0BD0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7CC4[0x7];                                     // 0x0BD1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         SpeedAfterTravelNoTarget;                          // 0x0BD8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         ZVelocityClampAfterTravelNoTarget;                 // 0x0C00(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UAbilityTask_ApplyRootMotionMoveToActorForce* Root_Motion_Move_To_Actor_Task;                    // 0x0C28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_ApplyRootMotionMoveToForce* Root_Motion_Move_To_Force_Task;                    // 0x0C30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   StartSection;                                      // 0x0C38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MontageSkipDistance;                               // 0x0C40(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           MontageSkipSwingCue;                               // 0x0C44(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Cosmos_MeleeAttack(int32 EntryPoint, class UFortHUDContext* CallFunc_GetContext_ReturnValue, const struct FGameplayTag& K2Node_CustomEvent_NotifyTag_3, TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate, const struct FGameplayTag& K2Node_CustomEvent_NotifyTag_2, TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate_1, const struct FGameplayTag& K2Node_CustomEvent_NotifyTag_1, TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate_2, const struct FGameplayTag& K2Node_CustomEvent_NotifyTag, TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate_3, const struct FGameplayTag& Temp_struct_Variable, TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_4, struct FGameplayAbilityTargetDataHandle& K2Node_CustomEvent_TargetData_3, const struct FGameplayTag& K2Node_CustomEvent_ApplicationTag_3, struct FGameplayAbilityTargetDataHandle& K2Node_CustomEvent_TargetData_2, const struct FGameplayTag& K2Node_CustomEvent_ApplicationTag_2, TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_5, const struct FGameplayTag& Temp_struct_Variable_1, const struct FGameplayAbilityTargetDataHandle& Temp_struct_Variable_2, TArray<class AActor*>& CallFunc_GetActorsFromTargetData_ReturnValue, bool CallFunc_TargetDataHasActor_ReturnValue, class UFortHUDContext* CallFunc_GetContext_ReturnValue_1, bool K2Node_CustomEvent_DestinationReached, bool K2Node_CustomEvent_TimedOut, const struct FVector& K2Node_CustomEvent_FinalTargetLocation, TDelegate<void(bool DestinationReached, bool TimedOut, const struct FVector& FinalTargetLocation)> K2Node_CreateDelegate_OutputDelegate_6, const struct FVector& Temp_struct_Variable_3, bool Temp_bool_Variable, bool Temp_bool_Variable_1, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_7, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_8, struct FGameplayAbilityTargetDataHandle& K2Node_CustomEvent_TargetData_1, const struct FGameplayTag& K2Node_CustomEvent_ApplicationTag_1, TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_9, struct FGameplayAbilityTargetDataHandle& K2Node_CustomEvent_TargetData, const struct FGameplayTag& K2Node_CustomEvent_ApplicationTag, TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_10, const struct FGameplayTag& Temp_struct_Variable_4, const struct FGameplayAbilityTargetDataHandle& Temp_struct_Variable_5, TArray<struct FActiveGameplayEffectHandle>& CallFunc_ApplyGameplayEffectContainer_ReturnValue, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_11, bool CallFunc_IsSurfaceSwimming_ReturnValue, bool CallFunc_IsFalling_ReturnValue, bool CallFunc_BooleanOR_ReturnValue, class AB_Rifle_Sniper_Cosmos_C* K2Node_DynamicCast_AsB_Rifle_Sniper_Cosmos, bool K2Node_DynamicCast_bSuccess, const struct FGameplayTag& K2Node_CustomEvent_NotifyTag_4, class UAnimMontage* Temp_object_Variable, TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate_12, bool Temp_bool_Variable_2, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, float CallFunc_GetValueAtLevel_ReturnValue, float CallFunc_FMax_ReturnValue, float CallFunc_GetValueAtLevel_ReturnValue_1, const struct FVector& CallFunc_MakeVector_ReturnValue, float CallFunc_GetValueAtLevel_ReturnValue_2, float CallFunc_GetValueAtLevel_ReturnValue_3, float CallFunc_Divide_FloatFloat_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, float CallFunc_FClamp_ReturnValue, float CallFunc_Lerp_ReturnValue, class AFortPawn* K2Node_DynamicCast_AsFort_Pawn, bool K2Node_DynamicCast_bSuccess_1, float CallFunc_FMax_ReturnValue_1, float CallFunc_GetScaledCapsuleRadius_ReturnValue, class UAbilityTask_ApplyRootMotionMoveToActorForce* CallFunc_ApplyRootMotionMoveToActorForce_ReturnValue, float CallFunc_GetValueAtLevel_ReturnValue_4, bool CallFunc_IsValid_ReturnValue, float CallFunc_GetValueAtLevel_ReturnValue_5, float CallFunc_GetValueAtLevel_ReturnValue_6, const struct FGameplayTag& K2Node_CustomEvent_NotifyTag_5, class UFortAbilityTask_WaitTargetSelection* CallFunc_WaitTargetSelection_ReturnValue, class UFortAbilityTask_WaitTargetSelection* CallFunc_WaitTargetSelection_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_2, bool CallFunc_EqualEqual_GameplayTag_ReturnValue, bool CallFunc_EqualEqual_GameplayTag_ReturnValue_1, TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate_13, float CallFunc_GetValueAtLevel_ReturnValue_7, float CallFunc_Multiply_FloatFloat_ReturnValue, class AActor* CallFunc_GetClosestActorFromArray_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_1, float CallFunc_DistanceBetweenTwoVectors_Distance, float CallFunc_GetScaledCapsuleRadius_ReturnValue_1, float CallFunc_Add_FloatFloat_ReturnValue, const struct FVector& CallFunc_GetActorEyesViewPoint_OutLocation, const struct FRotator& CallFunc_GetActorEyesViewPoint_OutRotation, const struct FVector& CallFunc_GetActorForwardVector_ReturnValue, const struct FVector& CallFunc_GetForwardVector_ReturnValue, const struct FVector& CallFunc_SelectVector_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_2, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue_1, float CallFunc_BreakVector_X, float CallFunc_BreakVector_Y, float CallFunc_BreakVector_Z, const struct FVector& CallFunc_Add_VectorVector_ReturnValue, float CallFunc_FClamp_ReturnValue_1, const struct FVector& CallFunc_MakeVector_ReturnValue_1, class UAbilityTask_ApplyRootMotionMoveToForce* CallFunc_ApplyRootMotionMoveToForce_ReturnValue, bool CallFunc_IsValid_ReturnValue_3, class AB_Rifle_Sniper_Cosmos_C* K2Node_DynamicCast_AsB_Rifle_Sniper_Cosmos_1, bool K2Node_DynamicCast_bSuccess_2, class UAnimMontage* Temp_object_Variable_1, class AFortPlayerPawn* CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue, class UAnimMontage* K2Node_Select_Default, class UFortAbilityTask_PlayMontageWaitNotify* CallFunc_PlayMontageAndWaitNotify_ReturnValue, struct FGameplayEventData& K2Node_Event_EventData, bool CallFunc_IsValid_ReturnValue_4, class AFortPlayerController* CallFunc_GetFortPlayerControllerFromActor_ReturnValue, bool K2Node_Event_bWasCancelled, class AFortPlayerController* CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1, bool CallFunc_K2_CommitAbility_ReturnValue, bool CallFunc_IsDedicatedServer_ReturnValue, bool CallFunc_Less_FloatFloat_ReturnValue);
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_ActivateAbilityFromEvent(struct FGameplayEventData& EventData);
	void FinishedMoving();
	void Fail_Safe_Timer();
	void Finish_Ability();
	void Targeted_DB6139E54974E4A27C34B3B144B01901(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Cancelled_DB6139E54974E4A27C34B3B144B01901(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void OnTimedOut_55988410466F4B811603C39FBDEDB75B();
	void OnTimedOutAndDestinationReached_55988410466F4B811603C39FBDEDB75B();
	void OnFinished_09748868457E0AA8857B9F89F6E42535(bool DestinationReached, bool TimedOut, const struct FVector& FinalTargetLocation);
	void Targeted_453821FA48EC0BD4FC67B885836EB33D(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Cancelled_453821FA48EC0BD4FC67B885836EB33D(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void OnCompleted_13586125407F7E08A005C1A7CFF0EAC6(const struct FGameplayTag& NotifyTag);
	void OnBlendOut_13586125407F7E08A005C1A7CFF0EAC6(const struct FGameplayTag& NotifyTag);
	void OnInterrupted_13586125407F7E08A005C1A7CFF0EAC6(const struct FGameplayTag& NotifyTag);
	void OnCancelled_13586125407F7E08A005C1A7CFF0EAC6(const struct FGameplayTag& NotifyTag);
	void OnNotifyBegin_13586125407F7E08A005C1A7CFF0EAC6(const struct FGameplayTag& NotifyTag);
	void OnNotifyEnd_13586125407F7E08A005C1A7CFF0EAC6(const struct FGameplayTag& NotifyTag);

	bool ShouldPlayFailedMontage(struct FGameplayTagContainer& FailedReason) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Cosmos_MeleeAttack_C">();
	}
	static class UGA_Cosmos_MeleeAttack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Cosmos_MeleeAttack_C>();
	}
};
static_assert(alignof(UGA_Cosmos_MeleeAttack_C) == 0x000008, "Wrong alinment on UGA_Cosmos_MeleeAttack_C");
static_assert(sizeof(UGA_Cosmos_MeleeAttack_C) == 0x000C50, "Wrong size on UGA_Cosmos_MeleeAttack_C");
static_assert(offsetof(UGA_Cosmos_MeleeAttack_C, UberGraphFrame) == 0x000AB8, "Member 'UGA_Cosmos_MeleeAttack_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Cosmos_MeleeAttack_C, PlayerPawn) == 0x000AC0, "Member 'UGA_Cosmos_MeleeAttack_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(UGA_Cosmos_MeleeAttack_C, T_HudElementToHide) == 0x000AC8, "Member 'UGA_Cosmos_MeleeAttack_C::T_HudElementToHide' has a wrong offset!");
static_assert(offsetof(UGA_Cosmos_MeleeAttack_C, SuccessfulHit) == 0x000AE8, "Member 'UGA_Cosmos_MeleeAttack_C::SuccessfulHit' has a wrong offset!");
static_assert(offsetof(UGA_Cosmos_MeleeAttack_C, MeleeMissCue) == 0x000AEC, "Member 'UGA_Cosmos_MeleeAttack_C::MeleeMissCue' has a wrong offset!");
static_assert(offsetof(UGA_Cosmos_MeleeAttack_C, Tag_FindTarget) == 0x000AF4, "Member 'UGA_Cosmos_MeleeAttack_C::Tag_FindTarget' has a wrong offset!");
static_assert(offsetof(UGA_Cosmos_MeleeAttack_C, FailsafeAbilityDuration) == 0x000AFC, "Member 'UGA_Cosmos_MeleeAttack_C::FailsafeAbilityDuration' has a wrong offset!");
static_assert(offsetof(UGA_Cosmos_MeleeAttack_C, Fail_Safe_Timer_Handle) == 0x000B00, "Member 'UGA_Cosmos_MeleeAttack_C::Fail_Safe_Timer_Handle' has a wrong offset!");
static_assert(offsetof(UGA_Cosmos_MeleeAttack_C, TargetActor) == 0x000B08, "Member 'UGA_Cosmos_MeleeAttack_C::TargetActor' has a wrong offset!");
static_assert(offsetof(UGA_Cosmos_MeleeAttack_C, DistanceToTarget) == 0x000B10, "Member 'UGA_Cosmos_MeleeAttack_C::DistanceToTarget' has a wrong offset!");
static_assert(offsetof(UGA_Cosmos_MeleeAttack_C, ActorsCombinedScaledRadiusSize) == 0x000B14, "Member 'UGA_Cosmos_MeleeAttack_C::ActorsCombinedScaledRadiusSize' has a wrong offset!");
static_assert(offsetof(UGA_Cosmos_MeleeAttack_C, DesiredLandingDistanceFromTarget) == 0x000B18, "Member 'UGA_Cosmos_MeleeAttack_C::DesiredLandingDistanceFromTarget' has a wrong offset!");
static_assert(offsetof(UGA_Cosmos_MeleeAttack_C, MinTravelDuration) == 0x000B40, "Member 'UGA_Cosmos_MeleeAttack_C::MinTravelDuration' has a wrong offset!");
static_assert(offsetof(UGA_Cosmos_MeleeAttack_C, MaxTravelDuration) == 0x000B68, "Member 'UGA_Cosmos_MeleeAttack_C::MaxTravelDuration' has a wrong offset!");
static_assert(offsetof(UGA_Cosmos_MeleeAttack_C, PathOffsetCurve) == 0x000B90, "Member 'UGA_Cosmos_MeleeAttack_C::PathOffsetCurve' has a wrong offset!");
static_assert(offsetof(UGA_Cosmos_MeleeAttack_C, TravelDistanceNoTarget) == 0x000B98, "Member 'UGA_Cosmos_MeleeAttack_C::TravelDistanceNoTarget' has a wrong offset!");
static_assert(offsetof(UGA_Cosmos_MeleeAttack_C, Tag_DamageContainer) == 0x000BC0, "Member 'UGA_Cosmos_MeleeAttack_C::Tag_DamageContainer' has a wrong offset!");
static_assert(offsetof(UGA_Cosmos_MeleeAttack_C, Tag_EndAbility) == 0x000BC8, "Member 'UGA_Cosmos_MeleeAttack_C::Tag_EndAbility' has a wrong offset!");
static_assert(offsetof(UGA_Cosmos_MeleeAttack_C, ConstrainNoTargetMovementToHorizontalOnly) == 0x000BD0, "Member 'UGA_Cosmos_MeleeAttack_C::ConstrainNoTargetMovementToHorizontalOnly' has a wrong offset!");
static_assert(offsetof(UGA_Cosmos_MeleeAttack_C, SpeedAfterTravelNoTarget) == 0x000BD8, "Member 'UGA_Cosmos_MeleeAttack_C::SpeedAfterTravelNoTarget' has a wrong offset!");
static_assert(offsetof(UGA_Cosmos_MeleeAttack_C, ZVelocityClampAfterTravelNoTarget) == 0x000C00, "Member 'UGA_Cosmos_MeleeAttack_C::ZVelocityClampAfterTravelNoTarget' has a wrong offset!");
static_assert(offsetof(UGA_Cosmos_MeleeAttack_C, Root_Motion_Move_To_Actor_Task) == 0x000C28, "Member 'UGA_Cosmos_MeleeAttack_C::Root_Motion_Move_To_Actor_Task' has a wrong offset!");
static_assert(offsetof(UGA_Cosmos_MeleeAttack_C, Root_Motion_Move_To_Force_Task) == 0x000C30, "Member 'UGA_Cosmos_MeleeAttack_C::Root_Motion_Move_To_Force_Task' has a wrong offset!");
static_assert(offsetof(UGA_Cosmos_MeleeAttack_C, StartSection) == 0x000C38, "Member 'UGA_Cosmos_MeleeAttack_C::StartSection' has a wrong offset!");
static_assert(offsetof(UGA_Cosmos_MeleeAttack_C, MontageSkipDistance) == 0x000C40, "Member 'UGA_Cosmos_MeleeAttack_C::MontageSkipDistance' has a wrong offset!");
static_assert(offsetof(UGA_Cosmos_MeleeAttack_C, MontageSkipSwingCue) == 0x000C44, "Member 'UGA_Cosmos_MeleeAttack_C::MontageSkipSwingCue' has a wrong offset!");

}

