#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Coconut_ShieldHealth

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Coconut_ShieldHealth.GA_Coconut_ShieldHealth_C
// 0x0058 (0x0B10 - 0x0AB8)
class UGA_Coconut_ShieldHealth_C : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AB8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0AC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         TimeInterval;                                      // 0x0AC8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTimerHandle                           Timer_Interval;                                    // 0x0AF0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_Heals;                                          // 0x0AF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_Shields;                                        // 0x0B00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GC_Activate;                                       // 0x0B08(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Coconut_ShieldHealth(int32 EntryPoint, bool CallFunc_Athena_CheckActorHasTags_bDidActorHaveTags, float CallFunc_GetValueAtLevel_ReturnValue, class AFortPlayerController* CallFunc_GetFortPlayerControllerFromActor_ReturnValue, bool K2Node_Event_bWasCancelled, bool CallFunc_Athena_PartyAssistCheck_bIsAssistingObjective, bool CallFunc_Athena_PartyAssistCheck_bIsValidPlayerController, class UFortQuestManager* CallFunc_GetQuestManager_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_SendComplexCustomStatEvent_QuestActive, bool CallFunc_SendComplexCustomStatEvent_QuestCompleted, bool CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid, bool CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted, bool CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue_2, bool CallFunc_IsValid_ReturnValue, bool CallFunc_BooleanOR_ReturnValue, float CallFunc_GetMaxShield_ReturnValue, float CallFunc_GetShield_ReturnValue, float CallFunc_GetMaxHealth_ReturnValue, bool CallFunc_EqualEqual_FloatFloat_ReturnValue, float CallFunc_GetHealth_ReturnValue, bool CallFunc_EqualEqual_FloatFloat_ReturnValue_1, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, const struct FActiveGameplayEffectHandle& CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue, class AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue, const struct FActiveGameplayEffectHandle& CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1, class AFortPlayerPawn* K2Node_DynamicCast_AsFort_Player_Pawn, bool K2Node_DynamicCast_bSuccess, bool CallFunc_IsValid_ReturnValue_1);
	void ApplyEffect();
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_ActivateAbility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Coconut_ShieldHealth_C">();
	}
	static class UGA_Coconut_ShieldHealth_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Coconut_ShieldHealth_C>();
	}
};
static_assert(alignof(UGA_Coconut_ShieldHealth_C) == 0x000008, "Wrong alinment on UGA_Coconut_ShieldHealth_C");
static_assert(sizeof(UGA_Coconut_ShieldHealth_C) == 0x000B10, "Wrong size on UGA_Coconut_ShieldHealth_C");
static_assert(offsetof(UGA_Coconut_ShieldHealth_C, UberGraphFrame) == 0x000AB8, "Member 'UGA_Coconut_ShieldHealth_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Coconut_ShieldHealth_C, PlayerPawn) == 0x000AC0, "Member 'UGA_Coconut_ShieldHealth_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(UGA_Coconut_ShieldHealth_C, TimeInterval) == 0x000AC8, "Member 'UGA_Coconut_ShieldHealth_C::TimeInterval' has a wrong offset!");
static_assert(offsetof(UGA_Coconut_ShieldHealth_C, Timer_Interval) == 0x000AF0, "Member 'UGA_Coconut_ShieldHealth_C::Timer_Interval' has a wrong offset!");
static_assert(offsetof(UGA_Coconut_ShieldHealth_C, GE_Heals) == 0x000AF8, "Member 'UGA_Coconut_ShieldHealth_C::GE_Heals' has a wrong offset!");
static_assert(offsetof(UGA_Coconut_ShieldHealth_C, GE_Shields) == 0x000B00, "Member 'UGA_Coconut_ShieldHealth_C::GE_Shields' has a wrong offset!");
static_assert(offsetof(UGA_Coconut_ShieldHealth_C, GC_Activate) == 0x000B08, "Member 'UGA_Coconut_ShieldHealth_C::GC_Activate' has a wrong offset!");

}

