#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_HeldObject_Place_Component

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_HeldObject_Place_Component.GA_HeldObject_Place_Component_C
// 0x0018 (0x0AD0 - 0x0AB8)
class UGA_HeldObject_Place_Component_C final  : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AB8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAnimMontage*                           Montage;                                           // 0x0AC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPlayMontage;                                      // 0x0AC8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_GA_HeldObject_Place_Component(int32 EntryPoint, struct FGameplayAbilityTargetDataHandle& K2Node_CustomEvent_TargetData_1, const struct FGameplayTag& K2Node_CustomEvent_ApplicationTag_1, struct FGameplayAbilityTargetDataHandle& K2Node_CustomEvent_TargetData, const struct FGameplayTag& K2Node_CustomEvent_ApplicationTag, TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate, const struct FGameplayTag& Temp_struct_Variable, const struct FGameplayAbilityTargetDataHandle& Temp_struct_Variable_1, struct FGameplayEventData& K2Node_Event_EventData, class AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue, bool CallFunc_K2_CommitAbility_ReturnValue, class AFortPlayerPawn* K2Node_DynamicCast_AsFort_Player_Pawn, bool K2Node_DynamicCast_bSuccess, bool CallFunc_IsServer_ReturnValue, class UFortHeldObjectComponent* CallFunc_GetHeldObjectComponentAttachedToPlayer_ReturnValue, bool CallFunc_IsHeld_ReturnValue, bool CallFunc_IsValid_ReturnValue, struct FGameplayAbilityTargetDataHandle& K2Node_CustomEvent_TargetData_2, const struct FGameplayTag& K2Node_CustomEvent_ApplicationTag_2, TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_1, class UFortAbilityTask_PlayMontageWaitTarget* CallFunc_PlayMontageWaitTarget_ReturnValue, TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_2, bool CallFunc_IsValid_ReturnValue_1);
	void K2_ActivateAbilityFromEvent(struct FGameplayEventData& EventData);
	void Triggered_FB73B2F540131A6D5CEF3FB7287803D4(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Cancelled_FB73B2F540131A6D5CEF3FB7287803D4(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Completed_FB73B2F540131A6D5CEF3FB7287803D4(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_HeldObject_Place_Component_C">();
	}
	static class UGA_HeldObject_Place_Component_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_HeldObject_Place_Component_C>();
	}
};
static_assert(alignof(UGA_HeldObject_Place_Component_C) == 0x000008, "Wrong alinment on UGA_HeldObject_Place_Component_C");
static_assert(sizeof(UGA_HeldObject_Place_Component_C) == 0x000AD0, "Wrong size on UGA_HeldObject_Place_Component_C");
static_assert(offsetof(UGA_HeldObject_Place_Component_C, UberGraphFrame) == 0x000AB8, "Member 'UGA_HeldObject_Place_Component_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_HeldObject_Place_Component_C, Montage) == 0x000AC0, "Member 'UGA_HeldObject_Place_Component_C::Montage' has a wrong offset!");
static_assert(offsetof(UGA_HeldObject_Place_Component_C, bPlayMontage) == 0x000AC8, "Member 'UGA_HeldObject_Place_Component_C::bPlayMontage' has a wrong offset!");

}

