#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Ranged_GenericProjectileImpact_HookGun

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GA_Ranged_GenericDamage_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Ranged_GenericProjectileImpact_HookGun.GA_Ranged_GenericProjectileImpact_HookGun_C
// 0x0038 (0x0B38 - 0x0B00)
class UGA_Ranged_GenericProjectileImpact_HookGun_C final  : public UGA_Ranged_GenericDamage_C
{
public:
	struct FGameplayTagContainer                  ChangeEquipmentTag;                                // 0x0B00(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           RopeActiveTag;                                     // 0x0B20(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UFortQuestItemDefinition*               QuestItem;                                         // 0x0B28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ObjBackendName;                                    // 0x0B30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void K2_CommitExecute(class AGameStateBase* CallFunc_GetGameState_ReturnValue, TDelegate<void(class UFortWorldItem* ItemDropped)> K2Node_CreateDelegate_OutputDelegate, class AFortGameStateAthena* K2Node_DynamicCast_AsFort_Game_State_Athena, bool K2Node_DynamicCast_bSuccess, bool CallFunc_HasAuthority_ReturnValue, const struct FGameplayTagContainer& CallFunc_GetAthenaPlaylistContextTags_ReturnValue, bool CallFunc_HasTag_ReturnValue, const struct FGameplayAbilityActorInfo& CallFunc_GetActorInfo_ReturnValue, class UAbilitySystemComponent* CallFunc_GetAbilitySystemComponent_ReturnValue, class AFortPlayerController* CallFunc_GetFortPlayerControllerFromActor_ReturnValue, class UFortAbilitySystemComponent* K2Node_DynamicCast_AsFort_Ability_System_Component, bool K2Node_DynamicCast_bSuccess_1, bool CallFunc_IsValid_ReturnValue, TArray<class AFortPlayerController*>& K2Node_MakeArray_Array, const class FString& CallFunc_GetDisplayName_ReturnValue, class AFortPawn* K2Node_DynamicCast_AsFort_Pawn, bool K2Node_DynamicCast_bSuccess_2, bool CallFunc_IsValid_ReturnValue_1, class AFortPlayerController* CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1, class AFortPlayerControllerAthena* K2Node_DynamicCast_AsFort_Player_Controller_Athena, bool K2Node_DynamicCast_bSuccess_3);
	void K2_OnEndAbility(bool bWasCancelled, const struct FGameplayAbilityActorInfo& CallFunc_GetActorInfo_ReturnValue, class UAbilitySystemComponent* CallFunc_GetAbilitySystemComponent_ReturnValue, bool CallFunc_IsValid_ReturnValue, class UFortAbilitySystemComponent* K2Node_DynamicCast_AsFort_Ability_System_Component, bool K2Node_DynamicCast_bSuccess);
	void Overflow(class UFortWorldItem* Item_Dropped);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Ranged_GenericProjectileImpact_HookGun_C">();
	}
	static class UGA_Ranged_GenericProjectileImpact_HookGun_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Ranged_GenericProjectileImpact_HookGun_C>();
	}
};
static_assert(alignof(UGA_Ranged_GenericProjectileImpact_HookGun_C) == 0x000008, "Wrong alinment on UGA_Ranged_GenericProjectileImpact_HookGun_C");
static_assert(sizeof(UGA_Ranged_GenericProjectileImpact_HookGun_C) == 0x000B38, "Wrong size on UGA_Ranged_GenericProjectileImpact_HookGun_C");
static_assert(offsetof(UGA_Ranged_GenericProjectileImpact_HookGun_C, ChangeEquipmentTag) == 0x000B00, "Member 'UGA_Ranged_GenericProjectileImpact_HookGun_C::ChangeEquipmentTag' has a wrong offset!");
static_assert(offsetof(UGA_Ranged_GenericProjectileImpact_HookGun_C, RopeActiveTag) == 0x000B20, "Member 'UGA_Ranged_GenericProjectileImpact_HookGun_C::RopeActiveTag' has a wrong offset!");
static_assert(offsetof(UGA_Ranged_GenericProjectileImpact_HookGun_C, QuestItem) == 0x000B28, "Member 'UGA_Ranged_GenericProjectileImpact_HookGun_C::QuestItem' has a wrong offset!");
static_assert(offsetof(UGA_Ranged_GenericProjectileImpact_HookGun_C, ObjBackendName) == 0x000B30, "Member 'UGA_Ranged_GenericProjectileImpact_HookGun_C::ObjBackendName' has a wrong offset!");

}

