#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_SurfaceChange_Ice_IceCheckOnTimer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_SurfaceChange_Ice_IceCheckOnTimer.GA_SurfaceChange_Ice_IceCheckOnTimer_C
// 0x0020 (0x0AD8 - 0x0AB8)
class UGA_SurfaceChange_Ice_IceCheckOnTimer_C final  : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AB8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortPlayerPawn*                        FortPlayerPawn;                                    // 0x0AC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           TraceTimer;                                        // 0x0AC8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           OffIceTimer;                                       // 0x0AD0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_SurfaceChange_Ice_IceCheckOnTimer(int32 EntryPoint, TArray<class AActor*>& Temp_object_Variable, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_1, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue_1, const struct FHitResult& CallFunc_LineTraceSingle_OutHit, bool CallFunc_LineTraceSingle_ReturnValue, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, EPhysicalSurface CallFunc_GetFortPhysicalSurface_ReturnValue, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_1, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue_1, bool K2Node_Event_bWasCancelled, class AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue, class AFortPlayerPawn* K2Node_DynamicCast_AsFort_Player_Pawn, bool K2Node_DynamicCast_bSuccess, bool CallFunc_K2_IsTimerActiveHandle_ReturnValue, TArray<class AActor*>& Temp_object_Variable_1, const struct FHitResult& CallFunc_LineTraceSingle_OutHit_1, bool CallFunc_LineTraceSingle_ReturnValue_1, EPhysicalSurface CallFunc_GetFortPhysicalSurface_ReturnValue_1, bool K2Node_SwitchEnum_CmpSuccess_1);
	void RemoveIceGE();
	void TraceForTerrain();
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_ActivateAbility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_SurfaceChange_Ice_IceCheckOnTimer_C">();
	}
	static class UGA_SurfaceChange_Ice_IceCheckOnTimer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_SurfaceChange_Ice_IceCheckOnTimer_C>();
	}
};
static_assert(alignof(UGA_SurfaceChange_Ice_IceCheckOnTimer_C) == 0x000008, "Wrong alinment on UGA_SurfaceChange_Ice_IceCheckOnTimer_C");
static_assert(sizeof(UGA_SurfaceChange_Ice_IceCheckOnTimer_C) == 0x000AD8, "Wrong size on UGA_SurfaceChange_Ice_IceCheckOnTimer_C");
static_assert(offsetof(UGA_SurfaceChange_Ice_IceCheckOnTimer_C, UberGraphFrame) == 0x000AB8, "Member 'UGA_SurfaceChange_Ice_IceCheckOnTimer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_SurfaceChange_Ice_IceCheckOnTimer_C, FortPlayerPawn) == 0x000AC0, "Member 'UGA_SurfaceChange_Ice_IceCheckOnTimer_C::FortPlayerPawn' has a wrong offset!");
static_assert(offsetof(UGA_SurfaceChange_Ice_IceCheckOnTimer_C, TraceTimer) == 0x000AC8, "Member 'UGA_SurfaceChange_Ice_IceCheckOnTimer_C::TraceTimer' has a wrong offset!");
static_assert(offsetof(UGA_SurfaceChange_Ice_IceCheckOnTimer_C, OffIceTimer) == 0x000AD0, "Member 'UGA_SurfaceChange_Ice_IceCheckOnTimer_C::OffIceTimer' has a wrong offset!");

}

