#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_SurfaceChange_Sand_Burrowed

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_SurfaceChange_Sand_Burrowed.GA_SurfaceChange_Sand_Burrowed_C
// 0x0120 (0x0BD8 - 0x0AB8)
class UGA_SurfaceChange_Sand_Burrowed_C final  : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AB8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         CapsuleCachedHalfHeight;                           // 0x0AC0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CapsuleCachedRadius;                               // 0x0AC4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CapsuleScalar;                                     // 0x0AC8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63D4[0x4];                                     // 0x0ACC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0AD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 BGAToSpawn;                                        // 0x0AD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABuildingGameplayActor*                 SpawnedBGA;                                        // 0x0AE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  Tag_Burrowed;                                      // 0x0AE8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 CameraMode_Sand_Burrowed;                          // 0x0B08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundMix*                              SilentFootsteps;                                   // 0x0B10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Tag_ElementalInteractionsToDisable;                // 0x0B18(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Handle_CheckForBuildingsTimer;                     // 0x0B20(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         MinVelocityToDamageBuildings;                      // 0x0B28(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         CheckForBuildingsTickTime;                         // 0x0B50(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           Tag_TargetingApplicationGEC;                       // 0x0B78(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_RecentlyHitBuilding;                            // 0x0B80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0B88(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UAbilityTask_WaitGameplayTagRemoved*    Task_WaitTagRemove_RecentlyHitBuilding;            // 0x0BB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Tag_RecentlyHitBuilding;                           // 0x0BB8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         PrevTargettingZOffset;                             // 0x0BC0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Tag_GC_HitBuilding;                                // 0x0BC4(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bCheckForHitOnClient;                              // 0x0BCC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_63D5[0x3];                                     // 0x0BCD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Tag_GameplayEvent_Unburrow;                        // 0x0BD0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_SurfaceChange_Sand_Burrowed(int32 EntryPoint, bool CallFunc_IsServer_ReturnValue, bool CallFunc_IsServer_ReturnValue_1, bool K2Node_Event_bWasCancelled, class AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue, class AFortPlayerPawn* K2Node_DynamicCast_AsFort_Player_Pawn, bool K2Node_DynamicCast_bSuccess, bool CallFunc_IsValid_ReturnValue, bool Temp_bool_Has_Been_Initd_Variable, class AActor* K2Node_CustomEvent_DamagedActor, float K2Node_CustomEvent_Damage, class AController* K2Node_CustomEvent_InstigatedBy, class AActor* K2Node_CustomEvent_DamageCauser, const struct FVector& K2Node_CustomEvent_HitLocation, class UPrimitiveComponent* K2Node_CustomEvent_FHitComponent, class FName K2Node_CustomEvent_BoneName, const struct FVector& K2Node_CustomEvent_Momentum, TDelegate<void(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum)> K2Node_CreateDelegate_OutputDelegate, bool CallFunc_IsValid_ReturnValue_1, struct FTransform& CallFunc_GetTransform_ReturnValue, class ABuildingGameplayActor* CallFunc_SpawnBuildingGameplayActorFromWorldContext_ReturnValue, bool Temp_bool_IsClosed_Variable, bool CallFunc_IsValid_ReturnValue_2, bool CallFunc_IsValid_ReturnValue_3, bool CallFunc_IsValid_ReturnValue_4, bool CallFunc_IsValid_ReturnValue_5, TDelegate<void(class AActor* DetectedActor, const struct FGameplayAbilityTargetDataHandle& TargetData)> K2Node_CreateDelegate_OutputDelegate_1, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, class AB_SurfaceChange_Sand_BurrowedMound_C* K2Node_DynamicCast_AsB_Surface_Change_Sand_Burrowed_Mound, bool K2Node_DynamicCast_bSuccess_1, bool CallFunc_IsValid_ReturnValue_6, TDelegate<void(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum)> K2Node_CreateDelegate_OutputDelegate_2, bool CallFunc_IsServer_ReturnValue_2, class AFortPlayerController* CallFunc_GetFortPlayerControllerFromActor_ReturnValue, bool CallFunc_IsValid_ReturnValue_7, bool CallFunc_IsServer_ReturnValue_3, float CallFunc_GetUnscaledCapsuleHalfHeight_ReturnValue, float CallFunc_Multiply_FloatFloat_ReturnValue, const struct FVector& CallFunc_MakeVector_ReturnValue, const struct FHitResult& CallFunc_K2_SetActorRelativeLocation_SweepHitResult, bool CallFunc_K2_HasAuthority_ReturnValue, class AActor* K2Node_CustomEvent_DetectedActor, const struct FGameplayAbilityTargetDataHandle& K2Node_CustomEvent_TargetData, class AB_SurfaceChange_Sand_BurrowedMound_C* K2Node_DynamicCast_AsB_Surface_Change_Sand_Burrowed_Mound_1, bool K2Node_DynamicCast_bSuccess_2, const struct FActiveGameplayEffectHandle& CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue, const struct FVector& CallFunc_MakeVector_ReturnValue_1, const struct FHitResult& CallFunc_K2_AddActorWorldOffset_SweepHitResult);
	void FailedToActivatePassiveAbility();
	void DetectedActor(class AActor* Param_DetectedActor, const struct FGameplayAbilityTargetDataHandle& Param_TargetData);
	void BGADied(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void DestroyBGA();
	void SpawnAndAttachBGA_ServerOnly_();
	void UnShrinkPawn();
	void ShrinkPawn();
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_ActivateAbility();
	void Hit_A_Building(class AActor* HitBuilding, const struct FGameplayAbilityTargetDataHandle& HitTargetData, const struct FActiveGameplayEffectHandle& CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue, TArray<struct FActiveGameplayEffectHandle>& CallFunc_ApplyGameplayEffectContainer_ReturnValue);

	struct FTransform GetCustomAbilitySourceTransform(const struct FVector& CallFunc_GetVelocity_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, const struct FRotator& CallFunc_MakeRotFromX_ReturnValue, const struct FTransform& CallFunc_MakeTransform_ReturnValue) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_SurfaceChange_Sand_Burrowed_C">();
	}
	static class UGA_SurfaceChange_Sand_Burrowed_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_SurfaceChange_Sand_Burrowed_C>();
	}
};
static_assert(alignof(UGA_SurfaceChange_Sand_Burrowed_C) == 0x000008, "Wrong alinment on UGA_SurfaceChange_Sand_Burrowed_C");
static_assert(sizeof(UGA_SurfaceChange_Sand_Burrowed_C) == 0x000BD8, "Wrong size on UGA_SurfaceChange_Sand_Burrowed_C");
static_assert(offsetof(UGA_SurfaceChange_Sand_Burrowed_C, UberGraphFrame) == 0x000AB8, "Member 'UGA_SurfaceChange_Sand_Burrowed_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_SurfaceChange_Sand_Burrowed_C, CapsuleCachedHalfHeight) == 0x000AC0, "Member 'UGA_SurfaceChange_Sand_Burrowed_C::CapsuleCachedHalfHeight' has a wrong offset!");
static_assert(offsetof(UGA_SurfaceChange_Sand_Burrowed_C, CapsuleCachedRadius) == 0x000AC4, "Member 'UGA_SurfaceChange_Sand_Burrowed_C::CapsuleCachedRadius' has a wrong offset!");
static_assert(offsetof(UGA_SurfaceChange_Sand_Burrowed_C, CapsuleScalar) == 0x000AC8, "Member 'UGA_SurfaceChange_Sand_Burrowed_C::CapsuleScalar' has a wrong offset!");
static_assert(offsetof(UGA_SurfaceChange_Sand_Burrowed_C, PlayerPawn) == 0x000AD0, "Member 'UGA_SurfaceChange_Sand_Burrowed_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(UGA_SurfaceChange_Sand_Burrowed_C, BGAToSpawn) == 0x000AD8, "Member 'UGA_SurfaceChange_Sand_Burrowed_C::BGAToSpawn' has a wrong offset!");
static_assert(offsetof(UGA_SurfaceChange_Sand_Burrowed_C, SpawnedBGA) == 0x000AE0, "Member 'UGA_SurfaceChange_Sand_Burrowed_C::SpawnedBGA' has a wrong offset!");
static_assert(offsetof(UGA_SurfaceChange_Sand_Burrowed_C, Tag_Burrowed) == 0x000AE8, "Member 'UGA_SurfaceChange_Sand_Burrowed_C::Tag_Burrowed' has a wrong offset!");
static_assert(offsetof(UGA_SurfaceChange_Sand_Burrowed_C, CameraMode_Sand_Burrowed) == 0x000B08, "Member 'UGA_SurfaceChange_Sand_Burrowed_C::CameraMode_Sand_Burrowed' has a wrong offset!");
static_assert(offsetof(UGA_SurfaceChange_Sand_Burrowed_C, SilentFootsteps) == 0x000B10, "Member 'UGA_SurfaceChange_Sand_Burrowed_C::SilentFootsteps' has a wrong offset!");
static_assert(offsetof(UGA_SurfaceChange_Sand_Burrowed_C, Tag_ElementalInteractionsToDisable) == 0x000B18, "Member 'UGA_SurfaceChange_Sand_Burrowed_C::Tag_ElementalInteractionsToDisable' has a wrong offset!");
static_assert(offsetof(UGA_SurfaceChange_Sand_Burrowed_C, Handle_CheckForBuildingsTimer) == 0x000B20, "Member 'UGA_SurfaceChange_Sand_Burrowed_C::Handle_CheckForBuildingsTimer' has a wrong offset!");
static_assert(offsetof(UGA_SurfaceChange_Sand_Burrowed_C, MinVelocityToDamageBuildings) == 0x000B28, "Member 'UGA_SurfaceChange_Sand_Burrowed_C::MinVelocityToDamageBuildings' has a wrong offset!");
static_assert(offsetof(UGA_SurfaceChange_Sand_Burrowed_C, CheckForBuildingsTickTime) == 0x000B50, "Member 'UGA_SurfaceChange_Sand_Burrowed_C::CheckForBuildingsTickTime' has a wrong offset!");
static_assert(offsetof(UGA_SurfaceChange_Sand_Burrowed_C, Tag_TargetingApplicationGEC) == 0x000B78, "Member 'UGA_SurfaceChange_Sand_Burrowed_C::Tag_TargetingApplicationGEC' has a wrong offset!");
static_assert(offsetof(UGA_SurfaceChange_Sand_Burrowed_C, GE_RecentlyHitBuilding) == 0x000B80, "Member 'UGA_SurfaceChange_Sand_Burrowed_C::GE_RecentlyHitBuilding' has a wrong offset!");
static_assert(offsetof(UGA_SurfaceChange_Sand_Burrowed_C, TargetData) == 0x000B88, "Member 'UGA_SurfaceChange_Sand_Burrowed_C::TargetData' has a wrong offset!");
static_assert(offsetof(UGA_SurfaceChange_Sand_Burrowed_C, Task_WaitTagRemove_RecentlyHitBuilding) == 0x000BB0, "Member 'UGA_SurfaceChange_Sand_Burrowed_C::Task_WaitTagRemove_RecentlyHitBuilding' has a wrong offset!");
static_assert(offsetof(UGA_SurfaceChange_Sand_Burrowed_C, Tag_RecentlyHitBuilding) == 0x000BB8, "Member 'UGA_SurfaceChange_Sand_Burrowed_C::Tag_RecentlyHitBuilding' has a wrong offset!");
static_assert(offsetof(UGA_SurfaceChange_Sand_Burrowed_C, PrevTargettingZOffset) == 0x000BC0, "Member 'UGA_SurfaceChange_Sand_Burrowed_C::PrevTargettingZOffset' has a wrong offset!");
static_assert(offsetof(UGA_SurfaceChange_Sand_Burrowed_C, Tag_GC_HitBuilding) == 0x000BC4, "Member 'UGA_SurfaceChange_Sand_Burrowed_C::Tag_GC_HitBuilding' has a wrong offset!");
static_assert(offsetof(UGA_SurfaceChange_Sand_Burrowed_C, bCheckForHitOnClient) == 0x000BCC, "Member 'UGA_SurfaceChange_Sand_Burrowed_C::bCheckForHitOnClient' has a wrong offset!");
static_assert(offsetof(UGA_SurfaceChange_Sand_Burrowed_C, Tag_GameplayEvent_Unburrow) == 0x000BD0, "Member 'UGA_SurfaceChange_Sand_Burrowed_C::Tag_GameplayEvent_Unburrow' has a wrong offset!");

}

