#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_SurfaceChange_Sand_UnBurrow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_SurfaceChange_Sand_UnBurrow.GA_SurfaceChange_Sand_UnBurrow_C
// 0x00D8 (0x0B90 - 0x0AB8)
class UGA_SurfaceChange_Sand_UnBurrow_C final  : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AB8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0AC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         Row_JumpDistance;                                  // 0x0AC8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_JumpHeight;                                    // 0x0AF0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_JumpDuration;                                  // 0x0B18(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_JumpDistance_Moving;                           // 0x0B40(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_JumpHeight_Moving;                             // 0x0B68(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GA_SurfaceChange_Sand_UnBurrow(int32 EntryPoint, float CallFunc_GetValueAtLevel_ReturnValue, TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate, struct FGameplayAbilityTargetDataHandle& K2Node_CustomEvent_TargetData_2, const struct FGameplayTag& K2Node_CustomEvent_ApplicationTag_2, struct FGameplayAbilityTargetDataHandle& K2Node_CustomEvent_TargetData_1, const struct FGameplayTag& K2Node_CustomEvent_ApplicationTag_1, TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_1, struct FGameplayAbilityTargetDataHandle& K2Node_CustomEvent_TargetData, const struct FGameplayTag& K2Node_CustomEvent_ApplicationTag, TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_2, const struct FGameplayTag& Temp_struct_Variable, const struct FGameplayAbilityTargetDataHandle& Temp_struct_Variable_1, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_3, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_4, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_5, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_6, class UFortAbilityTask_PlayMontageWaitTarget* CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue, bool CallFunc_IsValid_ReturnValue, EFortGetPlayerPawnExecutions CallFunc_GetAvatarAsValidFortPlayerPawn_OutExec, class AFortPlayerPawn* CallFunc_GetAvatarAsValidFortPlayerPawn_OutFortPlayerPawn, bool K2Node_SwitchEnum_CmpSuccess, const struct FRotator& CallFunc_K2_GetActorRotation_ReturnValue, float CallFunc_GetValueAtLevel_ReturnValue_1, float CallFunc_GetValueAtLevel_ReturnValue_2, float CallFunc_GetValueAtLevel_ReturnValue_3, class UAbilityTask_ApplyRootMotionJumpForce* CallFunc_ApplyRootMotionJumpForce_ReturnValue, const struct FVector& CallFunc_GetCurrentAcceleration_ReturnValue, float CallFunc_VSize_ReturnValue, bool CallFunc_LessEqual_FloatFloat_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, float CallFunc_GetValueAtLevel_ReturnValue_4, const struct FVector& CallFunc_GetCurrentAcceleration_ReturnValue_1, float CallFunc_GetValueAtLevel_ReturnValue_5, const struct FRotator& CallFunc_MakeRotFromX_ReturnValue, class UAbilityTask_ApplyRootMotionJumpForce* CallFunc_ApplyRootMotionJumpForce_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_2);
	void K2_ActivateAbility();
	void OnFinish_34617E064B818795F096FC87EC40A44F();
	void OnLanded_34617E064B818795F096FC87EC40A44F();
	void OnFinish_9F73196A430415907FCA97839684BB73();
	void OnLanded_9F73196A430415907FCA97839684BB73();
	void Triggered_F0FD0FE6496D4E4986C2E4B5C6FA8CFB(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Cancelled_F0FD0FE6496D4E4986C2E4B5C6FA8CFB(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Completed_F0FD0FE6496D4E4986C2E4B5C6FA8CFB(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_SurfaceChange_Sand_UnBurrow_C">();
	}
	static class UGA_SurfaceChange_Sand_UnBurrow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_SurfaceChange_Sand_UnBurrow_C>();
	}
};
static_assert(alignof(UGA_SurfaceChange_Sand_UnBurrow_C) == 0x000008, "Wrong alinment on UGA_SurfaceChange_Sand_UnBurrow_C");
static_assert(sizeof(UGA_SurfaceChange_Sand_UnBurrow_C) == 0x000B90, "Wrong size on UGA_SurfaceChange_Sand_UnBurrow_C");
static_assert(offsetof(UGA_SurfaceChange_Sand_UnBurrow_C, UberGraphFrame) == 0x000AB8, "Member 'UGA_SurfaceChange_Sand_UnBurrow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_SurfaceChange_Sand_UnBurrow_C, PlayerPawn) == 0x000AC0, "Member 'UGA_SurfaceChange_Sand_UnBurrow_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(UGA_SurfaceChange_Sand_UnBurrow_C, Row_JumpDistance) == 0x000AC8, "Member 'UGA_SurfaceChange_Sand_UnBurrow_C::Row_JumpDistance' has a wrong offset!");
static_assert(offsetof(UGA_SurfaceChange_Sand_UnBurrow_C, Row_JumpHeight) == 0x000AF0, "Member 'UGA_SurfaceChange_Sand_UnBurrow_C::Row_JumpHeight' has a wrong offset!");
static_assert(offsetof(UGA_SurfaceChange_Sand_UnBurrow_C, Row_JumpDuration) == 0x000B18, "Member 'UGA_SurfaceChange_Sand_UnBurrow_C::Row_JumpDuration' has a wrong offset!");
static_assert(offsetof(UGA_SurfaceChange_Sand_UnBurrow_C, Row_JumpDistance_Moving) == 0x000B40, "Member 'UGA_SurfaceChange_Sand_UnBurrow_C::Row_JumpDistance_Moving' has a wrong offset!");
static_assert(offsetof(UGA_SurfaceChange_Sand_UnBurrow_C, Row_JumpHeight_Moving) == 0x000B68, "Member 'UGA_SurfaceChange_Sand_UnBurrow_C::Row_JumpHeight_Moving' has a wrong offset!");

}

