#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_SlamDoorOpen_Victim

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_SlamDoorOpen_Victim.GA_SlamDoorOpen_Victim_C
// 0x0018 (0x0AD0 - 0x0AB8)
class UGA_SlamDoorOpen_Victim_C final  : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AB8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABuildingWall*                          BuildingWall;                                      // 0x0AC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0AC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_SlamDoorOpen_Victim(int32 EntryPoint, struct FGameplayEventData& K2Node_Event_EventData, class AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue, class AFortPlayerPawn* K2Node_DynamicCast_AsFort_Player_Pawn, bool K2Node_DynamicCast_bSuccess, class ABuildingWall* K2Node_DynamicCast_AsBuilding_Wall, bool K2Node_DynamicCast_bSuccess_1, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_1, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue, const struct FVector& CallFunc_Normal_ReturnValue, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue, float CallFunc_BreakVector_X, float CallFunc_BreakVector_Y, float CallFunc_BreakVector_Z, const struct FVector& CallFunc_MakeVector_ReturnValue);
	void K2_ActivateAbilityFromEvent(struct FGameplayEventData& EventData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_SlamDoorOpen_Victim_C">();
	}
	static class UGA_SlamDoorOpen_Victim_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_SlamDoorOpen_Victim_C>();
	}
};
static_assert(alignof(UGA_SlamDoorOpen_Victim_C) == 0x000008, "Wrong alinment on UGA_SlamDoorOpen_Victim_C");
static_assert(sizeof(UGA_SlamDoorOpen_Victim_C) == 0x000AD0, "Wrong size on UGA_SlamDoorOpen_Victim_C");
static_assert(offsetof(UGA_SlamDoorOpen_Victim_C, UberGraphFrame) == 0x000AB8, "Member 'UGA_SlamDoorOpen_Victim_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_SlamDoorOpen_Victim_C, BuildingWall) == 0x000AC0, "Member 'UGA_SlamDoorOpen_Victim_C::BuildingWall' has a wrong offset!");
static_assert(offsetof(UGA_SlamDoorOpen_Victim_C, PlayerPawn) == 0x000AC8, "Member 'UGA_SlamDoorOpen_Victim_C::PlayerPawn' has a wrong offset!");

}

