#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Vehicle_ExitHoldEvent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Vehicle_ExitHoldEvent.GA_Vehicle_ExitHoldEvent_C
// 0x0018 (0x0AD0 - 0x0AB8)
class UGA_Vehicle_ExitHoldEvent_C final  : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AB8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0AC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           EquippingCue;                                      // 0x0AC8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Vehicle_ExitHoldEvent(int32 EntryPoint, const struct FGameplayEventData& Temp_struct_Variable, class UAbilityTask_WaitGameplayEvent* CallFunc_WaitGameplayEvent_ReturnValue, const struct FGameplayCueParameters& CallFunc_MakeGameplayCueParameters_ReturnValue, bool CallFunc_IsValid_ReturnValue, const struct FGameplayEventData& K2Node_CustomEvent_Payload, TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate, const struct FGameplayEventData& Temp_struct_Variable_1, class UAbilityTask_WaitGameplayEvent* CallFunc_WaitGameplayEvent_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_1, const struct FGameplayAbilityActorInfo& CallFunc_GetActorInfo_ReturnValue, class AFortPlayerPawn* K2Node_DynamicCast_AsFort_Player_Pawn, bool K2Node_DynamicCast_bSuccess, bool CallFunc_K2_CommitAbility_ReturnValue, const struct FGameplayAbilityTargetDataHandle& CallFunc_AbilityTargetDataFromActor_ReturnValue, TArray<struct FActiveGameplayEffectHandle>& CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue, const struct FGameplayEventData& K2Node_CustomEvent_Payload_1, TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_1, bool K2Node_Event_bWasCancelled, const struct FGameplayCueParameters& CallFunc_MakeGameplayCueParameters_ReturnValue_1);
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_ActivateAbility();
	void EventReceived_209BF560404B83EBEAA8DD8090C443AC(const struct FGameplayEventData& Payload);
	void EventReceived_7AE1D485464AEC7EB429C3877D33AF69(const struct FGameplayEventData& Payload);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Vehicle_ExitHoldEvent_C">();
	}
	static class UGA_Vehicle_ExitHoldEvent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Vehicle_ExitHoldEvent_C>();
	}
};
static_assert(alignof(UGA_Vehicle_ExitHoldEvent_C) == 0x000008, "Wrong alinment on UGA_Vehicle_ExitHoldEvent_C");
static_assert(sizeof(UGA_Vehicle_ExitHoldEvent_C) == 0x000AD0, "Wrong size on UGA_Vehicle_ExitHoldEvent_C");
static_assert(offsetof(UGA_Vehicle_ExitHoldEvent_C, UberGraphFrame) == 0x000AB8, "Member 'UGA_Vehicle_ExitHoldEvent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Vehicle_ExitHoldEvent_C, PlayerPawn) == 0x000AC0, "Member 'UGA_Vehicle_ExitHoldEvent_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(UGA_Vehicle_ExitHoldEvent_C, EquippingCue) == 0x000AC8, "Member 'UGA_Vehicle_ExitHoldEvent_C::EquippingCue' has a wrong offset!");

}

