#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GamepadCustomActionSelectorPanel_v3

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass GamepadCustomActionSelectorPanel_v3.GamepadCustomActionSelectorPanel_v3_C
// 0x00B8 (0x0548 - 0x0490)
class UGamepadCustomActionSelectorPanel_v3_C final  : public UFortGamePadCustomActionSelectorPanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0490(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_Clear;                                      // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_Clear;                                // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonListView*                        CommonListView_GamepadActions;                     // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortRichTextBlockLegacy*               FortRichTextBlock_Clear1;                          // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortRichTextBlockLegacy*               FortRichTextBlock_Clear2;                          // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidget_C*                       KeybindWidget_Clear;                               // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOptionsMenuHeader_C*                   OptionsMenuHeader;                                 // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FDataTableRowHandle                    Back;                                              // 0x04D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	FMulticastInlineDelegateProperty_             CustomActionSelected;                              // 0x04E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class UFortOptionsMenuInputData*>      CurrentInputData;                                  // 0x04F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             CustomClosedUsingBack;                             // 0x0500(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             CustomClearButton;                                 // 0x0510(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FKey                                   KeyNone;                                           // 0x0520(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FDataTableRowHandle                    Clear;                                             // 0x0538(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void HandleClear(bool* PassThrough);
	void CreateCustomListItem(class FName ActionName, EFortInputActionGroup InputActionGroup, class UGamepadKeyTextButton_C** ReturnItem, class FName ActionName_Local, EFortInputActionGroup InputActionGroup_Local, class FName CustomPresetName_Local, class UGamepadKeyTextButton_C* ReturnItem_Local, bool K2Node_SwitchEnum_CmpSuccess, class UFortGlobalUIContext* CallFunc_GetContext_ReturnValue, const class FString& CallFunc_GetCustomGamepadInputPresetName_ReturnValue, class FName CallFunc_Conv_StringToName_ReturnValue, class UFortGlobalUIContext* CallFunc_GetContext_ReturnValue_1, class UFortInputData* CallFunc_GetFortInputDataForBlueprint_ReturnValue, bool CallFunc_IsValid_ReturnValue, class FText CallFunc_GetScreenLabel_ReturnValue, class UGamepadKeyTextButton_C* CallFunc_Create_ReturnValue, class UFortGlobalUIContext* CallFunc_GetContext_ReturnValue_2, const struct FKey& CallFunc_GetKeyForAction_ReturnValue);
	void HandleBack(bool* PassThrough);
	void Construct();
	void UpdatePanel(TArray<class UFortOptionsMenuInputData*>& InputData);
	void BP_OnItemClicked_Bind(class UObject* Item);
	void BP_OnActivated();
	void BP_OnDeactivated();
	void BndEvt__Button_Clear_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_GamepadCustomActionSelectorPanel_v3(int32 EntryPoint, int32 CallFunc_Array_Length_ReturnValue, TArray<class UFortOptionsMenuInputData*>& K2Node_CustomEvent_InputData, class UObject* K2Node_CustomEvent_Item, TDelegate<void(class UObject* Item)> K2Node_CreateDelegate_OutputDelegate, class UGamepadKeyTextButton_C* K2Node_DynamicCast_AsGamepad_Key_Text_Button, bool K2Node_DynamicCast_bSuccess, int32 Temp_int_Loop_Counter_Variable, TDelegate<void(bool* bPassThrough)> K2Node_CreateDelegate_OutputDelegate_1, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable, class UObject* CallFunc_BP_GetSelectedItem_ReturnValue, class UFortOptionsMenuInputData* CallFunc_Array_Get_Item, int32 CallFunc_GetIndexForItem_ReturnValue, EFortInputActionGroup CallFunc_GetInputActionGroup_ReturnValue, class UGamepadKeyTextButton_C* CallFunc_CreateCustomListItem_ReturnItem, bool CallFunc_IsValid_ReturnValue, TDelegate<void(bool* bPassThrough)> K2Node_CreateDelegate_OutputDelegate_2);
	void CustomClearButton__DelegateSignature();
	void CustomClosedUsingBack__DelegateSignature();
	void CustomActionSelected__DelegateSignature(int32 SelectedIndex, class FName ActionName);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GamepadCustomActionSelectorPanel_v3_C">();
	}
	static class UGamepadCustomActionSelectorPanel_v3_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGamepadCustomActionSelectorPanel_v3_C>();
	}
};
static_assert(alignof(UGamepadCustomActionSelectorPanel_v3_C) == 0x000008, "Wrong alinment on UGamepadCustomActionSelectorPanel_v3_C");
static_assert(sizeof(UGamepadCustomActionSelectorPanel_v3_C) == 0x000548, "Wrong size on UGamepadCustomActionSelectorPanel_v3_C");
static_assert(offsetof(UGamepadCustomActionSelectorPanel_v3_C, UberGraphFrame) == 0x000490, "Member 'UGamepadCustomActionSelectorPanel_v3_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGamepadCustomActionSelectorPanel_v3_C, Button_Clear) == 0x000498, "Member 'UGamepadCustomActionSelectorPanel_v3_C::Button_Clear' has a wrong offset!");
static_assert(offsetof(UGamepadCustomActionSelectorPanel_v3_C, CommonBorder_Clear) == 0x0004A0, "Member 'UGamepadCustomActionSelectorPanel_v3_C::CommonBorder_Clear' has a wrong offset!");
static_assert(offsetof(UGamepadCustomActionSelectorPanel_v3_C, CommonListView_GamepadActions) == 0x0004A8, "Member 'UGamepadCustomActionSelectorPanel_v3_C::CommonListView_GamepadActions' has a wrong offset!");
static_assert(offsetof(UGamepadCustomActionSelectorPanel_v3_C, FortRichTextBlock_Clear1) == 0x0004B0, "Member 'UGamepadCustomActionSelectorPanel_v3_C::FortRichTextBlock_Clear1' has a wrong offset!");
static_assert(offsetof(UGamepadCustomActionSelectorPanel_v3_C, FortRichTextBlock_Clear2) == 0x0004B8, "Member 'UGamepadCustomActionSelectorPanel_v3_C::FortRichTextBlock_Clear2' has a wrong offset!");
static_assert(offsetof(UGamepadCustomActionSelectorPanel_v3_C, KeybindWidget_Clear) == 0x0004C0, "Member 'UGamepadCustomActionSelectorPanel_v3_C::KeybindWidget_Clear' has a wrong offset!");
static_assert(offsetof(UGamepadCustomActionSelectorPanel_v3_C, OptionsMenuHeader) == 0x0004C8, "Member 'UGamepadCustomActionSelectorPanel_v3_C::OptionsMenuHeader' has a wrong offset!");
static_assert(offsetof(UGamepadCustomActionSelectorPanel_v3_C, Back) == 0x0004D0, "Member 'UGamepadCustomActionSelectorPanel_v3_C::Back' has a wrong offset!");
static_assert(offsetof(UGamepadCustomActionSelectorPanel_v3_C, CustomActionSelected) == 0x0004E0, "Member 'UGamepadCustomActionSelectorPanel_v3_C::CustomActionSelected' has a wrong offset!");
static_assert(offsetof(UGamepadCustomActionSelectorPanel_v3_C, CurrentInputData) == 0x0004F0, "Member 'UGamepadCustomActionSelectorPanel_v3_C::CurrentInputData' has a wrong offset!");
static_assert(offsetof(UGamepadCustomActionSelectorPanel_v3_C, CustomClosedUsingBack) == 0x000500, "Member 'UGamepadCustomActionSelectorPanel_v3_C::CustomClosedUsingBack' has a wrong offset!");
static_assert(offsetof(UGamepadCustomActionSelectorPanel_v3_C, CustomClearButton) == 0x000510, "Member 'UGamepadCustomActionSelectorPanel_v3_C::CustomClearButton' has a wrong offset!");
static_assert(offsetof(UGamepadCustomActionSelectorPanel_v3_C, KeyNone) == 0x000520, "Member 'UGamepadCustomActionSelectorPanel_v3_C::KeyNone' has a wrong offset!");
static_assert(offsetof(UGamepadCustomActionSelectorPanel_v3_C, Clear) == 0x000538, "Member 'UGamepadCustomActionSelectorPanel_v3_C::Clear' has a wrong offset!");

}

