#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_Athena_LowGravity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCN_Athena_LowGravity.GCN_Athena_LowGravity_C
// 0x0038 (0x03A0 - 0x0368)
class AGCN_Athena_LowGravity_C : public AFortGameplayCueNotifyLoop_LowGravity
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0368(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AActor*                                 MyTargetCached;                                    // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               LowGravityPSComponent;                             // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           ExpireTellDelayTimer;                              // 0x0380(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         ExpirationSoundPeriod;                             // 0x0388(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D1B[0x4];                                     // 0x038C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           ExpirationSoundTimer;                              // 0x0390(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         MaxDrawDistance;                                   // 0x0398(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GCN_Athena_LowGravity(int32 EntryPoint, class USceneComponent* CallFunc_K2_GetRootComponent_ReturnValue, class UAudioComponent* CallFunc_SpawnSoundAttached_ReturnValue, class AActor* K2Node_Event_MyTarget, EGameplayCueEvent K2Node_Event_EventType, struct FGameplayCueParameters& K2Node_Event_Parameters, bool K2Node_SwitchEnum_CmpSuccess);
	void ClearExpireTell();
	void ReceiveBeginPlay();
	void K2_HandleGameplayCue(class AActor* MyTarget, EGameplayCueEvent EventType, struct FGameplayCueParameters& Parameters);
	void PlayExpirationSound();
	void ExpireTell();
	bool WhileActive(class AActor* MyTarget, struct FGameplayCueParameters& Parameters, class UParticleSystemComponent* CallFunc_SpawnEmitterAttached_ReturnValue);
	void Activated(class AActor* Param_PlayerPawn, class AFortPlayerPawnAthena* K2Node_DynamicCast_AsFort_Player_Pawn_Athena, bool K2Node_DynamicCast_bSuccess, float CallFunc_GetTimeSeconds_ReturnValue, float CallFunc_Subtract_FloatFloat_ReturnValue, EEvaluateCurveTableResult CallFunc_EvaluateCurveTableRow_OutResult, float CallFunc_EvaluateCurveTableRow_OutXY, EEvaluateCurveTableResult CallFunc_EvaluateCurveTableRow_OutResult_1, float CallFunc_EvaluateCurveTableRow_OutXY_1, bool K2Node_SwitchEnum_CmpSuccess, bool K2Node_SwitchEnum_CmpSuccess_1, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue);
	bool OnRemove(class AActor* MyTarget, struct FGameplayCueParameters& Parameters, bool CallFunc_IsValid_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCN_Athena_LowGravity_C">();
	}
	static class AGCN_Athena_LowGravity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCN_Athena_LowGravity_C>();
	}
};
static_assert(alignof(AGCN_Athena_LowGravity_C) == 0x000008, "Wrong alinment on AGCN_Athena_LowGravity_C");
static_assert(sizeof(AGCN_Athena_LowGravity_C) == 0x0003A0, "Wrong size on AGCN_Athena_LowGravity_C");
static_assert(offsetof(AGCN_Athena_LowGravity_C, UberGraphFrame) == 0x000368, "Member 'AGCN_Athena_LowGravity_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCN_Athena_LowGravity_C, MyTargetCached) == 0x000370, "Member 'AGCN_Athena_LowGravity_C::MyTargetCached' has a wrong offset!");
static_assert(offsetof(AGCN_Athena_LowGravity_C, LowGravityPSComponent) == 0x000378, "Member 'AGCN_Athena_LowGravity_C::LowGravityPSComponent' has a wrong offset!");
static_assert(offsetof(AGCN_Athena_LowGravity_C, ExpireTellDelayTimer) == 0x000380, "Member 'AGCN_Athena_LowGravity_C::ExpireTellDelayTimer' has a wrong offset!");
static_assert(offsetof(AGCN_Athena_LowGravity_C, ExpirationSoundPeriod) == 0x000388, "Member 'AGCN_Athena_LowGravity_C::ExpirationSoundPeriod' has a wrong offset!");
static_assert(offsetof(AGCN_Athena_LowGravity_C, ExpirationSoundTimer) == 0x000390, "Member 'AGCN_Athena_LowGravity_C::ExpirationSoundTimer' has a wrong offset!");
static_assert(offsetof(AGCN_Athena_LowGravity_C, MaxDrawDistance) == 0x000398, "Member 'AGCN_Athena_LowGravity_C::MaxDrawDistance' has a wrong offset!");

}

