#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_RezIn

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCN_RezIn.GCN_RezIn_C
// 0x0170 (0x05D0 - 0x0460)
class AGCN_RezIn_C final  : public AFortGameplayCueNotify_BurstLatent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         TFX_ResOutCharacterMesh_LightIntensity_81C5527F43A6972D94623590BA582E8C; // 0x0468(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TFX_ResOutCharacterMesh_ZHeightParam_81C5527F43A6972D94623590BA582E8C; // 0x046C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TFX_ResOutCharacterMesh_TransitionParam_81C5527F43A6972D94623590BA582E8C; // 0x0470(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TFX_ResOutCharacterMesh__Direction_81C5527F43A6972D94623590BA582E8C; // 0x0474(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59C2[0x3];                                     // 0x0475(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TFX_ResOutCharacterMesh;                           // 0x0478(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TFX_GlowCharacterMesh_EmissiveWarp_9EA15145493A8F1A5915938D5529A028; // 0x0480(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TFX_GlowCharacterMesh__Direction_9EA15145493A8F1A5915938D5529A028; // 0x0484(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59C3[0x3];                                     // 0x0485(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TFX_GlowCharacterMesh;                             // 0x0488(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DEBUG_ANIMATION;                                   // 0x0490(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          SpawnDrone;                                        // 0x0491(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_59C4[0x6];                                     // 0x0492(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Teleportation_Drone;                               // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Teleport_Bot_AnimPlayRate;                         // 0x04A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Teleport_Bot_Lifespan;                             // 0x04A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   Teleportation_Point_Light;                         // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	struct FVector                                Teleportation_Light_Offset;                        // 0x04B0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Teleportation_Light_Color;                         // 0x04BC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59C5[0x4];                                     // 0x04CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInstanceDynamic*>       DissolveMIDs;                                      // 0x04D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, AdvancedDisplay, HasGetValueTypeHash)
	class UMaterialInterface*                     Mat_Chracter_Dissolve;                             // 0x04E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerPawn_Athena_C*                   Pawn;                                              // 0x04E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	TSet<class USkeletalMeshComponent*>           Dissolve;                                          // 0x04F0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, AdvancedDisplay)
	class FName                                   Socket_Mesh_Top;                                   // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	float                                         Max_Light_Intensity;                               // 0x0548(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Socket_Mesh_Bottom;                                // 0x054C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_59C6[0x4];                                     // 0x0554(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         Meshes_to_Dissolve;                                // 0x0558(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, AdvancedDisplay, HasGetValueTypeHash)
	class ABP_TeleportationDrone_C*               Drone;                                             // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	bool                                          DEBUG_CHILDCOMPONENTS;                             // 0x0570(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59C7[0x7];                                     // 0x0571(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFXSystemComponent*>             Particle_Components;                               // 0x0578(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, AdvancedDisplay, HasGetValueTypeHash)
	class UNiagaraComponent*                      Spawned_Teleport_VFX;                              // 0x0588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class UNiagaraSystem*                         Teleport_In_Visual_Effect;                         // 0x0590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Teleport_In_VFX_Attach_Point_Name;                 // 0x0598(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Cur_Dissolve_Setup_Attempt;                        // 0x05A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	int32                                         AmountOfTimesToAttemptRestoreMats;                 // 0x05A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	bool                                          Spawn_VFX_Attached;                                // 0x05A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59C8[0x3];                                     // 0x05A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Dissolve_Timeline_Playrate;                        // 0x05AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Glow_Timeline_Playrate;                            // 0x05B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59C9[0x4];                                     // 0x05B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         Drone_Visual_Effect;                               // 0x05B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DEBUG_TESTJANUSFX;                                 // 0x05C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59CA[0x3];                                     // 0x05C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Drone_VFX_Attach_Point;                            // 0x05C4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GCN_RezIn(int32 EntryPoint, bool CallFunc_IsValid_ReturnValue, class AActor* K2Node_Event_MyTarget, struct FGameplayCueParameters& K2Node_Event_Parameters, TArray<class UFXSystemComponent*>& K2Node_Event_ParticleComponents, TArray<class UAudioComponent*>& K2Node_Event_AudioComponents, class UMatineeCameraShake* K2Node_Event_BurstCameraShakeInstance, class ADecalActor* K2Node_Event_BurstDecalInstance, class APlayerPawn_Athena_C* K2Node_DynamicCast_AsPlayer_Pawn_Athena, bool K2Node_DynamicCast_bSuccess, bool CallFunc_SetupDissolveFx_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, bool CallFunc_BooleanOR_ReturnValue, int32 Temp_int_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Variable_1, bool CallFunc_EqualEqual_IntInt_ReturnValue, class UNiagaraComponent* K2Node_CustomEvent_Spawned_Teleport_In_FX, class UNiagaraComponent* K2Node_CustomEvent_Drone_FX, bool CallFunc_Restore_Character_Materials_Fully_Completed, bool CallFunc_BooleanOR_ReturnValue_1, int32 CallFunc_Subtract_IntInt_ReturnValue);
	void Set_Additional_Niagara_Parameter_on_Drone_FX(class UNiagaraComponent* Drone_FX);
	void Set_Additional_Niagara_Parameters_on_Spawned_FX(class UNiagaraComponent* Spawned_Teleport_In_FX);
	void PreMinusSequence_Change();
	void TFX_ResOutCharacterMesh__UpdateFunc();
	void TFX_ResOutCharacterMesh__FinishedFunc();
	void TFX_GlowCharacterMesh__UpdateFunc();
	void TFX_GlowCharacterMesh__FinishedFunc();
	void Stop_Looping_Audio(bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsValid_ReturnValue_1);
	void Spawn_Teleportation_Drone(const struct FTransform& CallFunc_K2_GetComponentToWorld_ReturnValue, class UFortGlobalUIContext* CallFunc_GetContext_ReturnValue, class AActor* CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue, bool CallFunc_IsInZone_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, class ABP_TeleportationDrone_C* CallFunc_FinishSpawningActor_ReturnValue);
	void Spawn_Teleportation_Light(const struct FVector& CallFunc_GetSocketLocation_ReturnValue, bool CallFunc_IsValid_ReturnValue, const struct FVector& CallFunc_Add_VectorVector_ReturnValue, const struct FTransform& CallFunc_Conv_VectorToTransform_ReturnValue, bool CallFunc_IsMobilePlatform_ReturnValue, class UPointLightComponent* CallFunc_AddComponent_ReturnValue);
	void CleanMinusUp_Teleportation_Light(bool CallFunc_IsValid_ReturnValue);
	void Restore_Character_Materials(bool* Fully_Completed, int32 CurrentReplacementIndex, int32 Itr, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Array_Index_Variable_1, class UMaterialInstanceDynamic* Temp_object_Variable, bool Temp_bool_Variable, class UMaterialInstanceDynamic* CallFunc_Array_Get_Item, bool CallFunc_Array_IsValidIndex_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_1, class UMaterialInstanceDynamic* K2Node_Select_Default, int32 Temp_int_Loop_Counter_Variable_1, int32 CallFunc_Add_IntInt_ReturnValue_2, int32 CallFunc_Array_Length_ReturnValue, class USkeletalMeshComponent* CallFunc_Array_Get_Item_1, bool CallFunc_Less_IntInt_ReturnValue, TArray<class UMaterialInterface*>& CallFunc_GetMaterials_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_1, int32 CallFunc_Array_Length_ReturnValue_2, int32 CallFunc_Add_IntInt_ReturnValue_3, bool CallFunc_Less_IntInt_ReturnValue_1);
	void Spawn_Teleport_In_VFX(const struct FVector& CallFunc_GetSocketLocation_ReturnValue, class UNiagaraComponent* CallFunc_SpawnSystemAtLocation_ReturnValue, class UNiagaraComponent* CallFunc_SpawnSystemAttached_ReturnValue);
	void Set_Timelines__Playrates();
	void Spawn_Drone_VFX(class UNiagaraComponent* CallFunc_SpawnSystemAttached_ReturnValue);

	void OnBurstGeneric(class AActor* MyTarget, struct FGameplayCueParameters& Parameters, TArray<class UFXSystemComponent*>& ParticleComponents, TArray<class UAudioComponent*>& AudioComponents, class UMatineeCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCN_RezIn_C">();
	}
	static class AGCN_RezIn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCN_RezIn_C>();
	}
};
static_assert(alignof(AGCN_RezIn_C) == 0x000008, "Wrong alinment on AGCN_RezIn_C");
static_assert(sizeof(AGCN_RezIn_C) == 0x0005D0, "Wrong size on AGCN_RezIn_C");
static_assert(offsetof(AGCN_RezIn_C, UberGraphFrame) == 0x000460, "Member 'AGCN_RezIn_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, TFX_ResOutCharacterMesh_LightIntensity_81C5527F43A6972D94623590BA582E8C) == 0x000468, "Member 'AGCN_RezIn_C::TFX_ResOutCharacterMesh_LightIntensity_81C5527F43A6972D94623590BA582E8C' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, TFX_ResOutCharacterMesh_ZHeightParam_81C5527F43A6972D94623590BA582E8C) == 0x00046C, "Member 'AGCN_RezIn_C::TFX_ResOutCharacterMesh_ZHeightParam_81C5527F43A6972D94623590BA582E8C' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, TFX_ResOutCharacterMesh_TransitionParam_81C5527F43A6972D94623590BA582E8C) == 0x000470, "Member 'AGCN_RezIn_C::TFX_ResOutCharacterMesh_TransitionParam_81C5527F43A6972D94623590BA582E8C' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, TFX_ResOutCharacterMesh__Direction_81C5527F43A6972D94623590BA582E8C) == 0x000474, "Member 'AGCN_RezIn_C::TFX_ResOutCharacterMesh__Direction_81C5527F43A6972D94623590BA582E8C' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, TFX_ResOutCharacterMesh) == 0x000478, "Member 'AGCN_RezIn_C::TFX_ResOutCharacterMesh' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, TFX_GlowCharacterMesh_EmissiveWarp_9EA15145493A8F1A5915938D5529A028) == 0x000480, "Member 'AGCN_RezIn_C::TFX_GlowCharacterMesh_EmissiveWarp_9EA15145493A8F1A5915938D5529A028' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, TFX_GlowCharacterMesh__Direction_9EA15145493A8F1A5915938D5529A028) == 0x000484, "Member 'AGCN_RezIn_C::TFX_GlowCharacterMesh__Direction_9EA15145493A8F1A5915938D5529A028' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, TFX_GlowCharacterMesh) == 0x000488, "Member 'AGCN_RezIn_C::TFX_GlowCharacterMesh' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, DEBUG_ANIMATION) == 0x000490, "Member 'AGCN_RezIn_C::DEBUG_ANIMATION' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, SpawnDrone) == 0x000491, "Member 'AGCN_RezIn_C::SpawnDrone' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, Teleportation_Drone) == 0x000498, "Member 'AGCN_RezIn_C::Teleportation_Drone' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, Teleport_Bot_AnimPlayRate) == 0x0004A0, "Member 'AGCN_RezIn_C::Teleport_Bot_AnimPlayRate' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, Teleport_Bot_Lifespan) == 0x0004A4, "Member 'AGCN_RezIn_C::Teleport_Bot_Lifespan' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, Teleportation_Point_Light) == 0x0004A8, "Member 'AGCN_RezIn_C::Teleportation_Point_Light' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, Teleportation_Light_Offset) == 0x0004B0, "Member 'AGCN_RezIn_C::Teleportation_Light_Offset' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, Teleportation_Light_Color) == 0x0004BC, "Member 'AGCN_RezIn_C::Teleportation_Light_Color' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, DissolveMIDs) == 0x0004D0, "Member 'AGCN_RezIn_C::DissolveMIDs' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, Mat_Chracter_Dissolve) == 0x0004E0, "Member 'AGCN_RezIn_C::Mat_Chracter_Dissolve' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, Pawn) == 0x0004E8, "Member 'AGCN_RezIn_C::Pawn' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, Dissolve) == 0x0004F0, "Member 'AGCN_RezIn_C::Dissolve' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, Socket_Mesh_Top) == 0x000540, "Member 'AGCN_RezIn_C::Socket_Mesh_Top' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, Max_Light_Intensity) == 0x000548, "Member 'AGCN_RezIn_C::Max_Light_Intensity' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, Socket_Mesh_Bottom) == 0x00054C, "Member 'AGCN_RezIn_C::Socket_Mesh_Bottom' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, Meshes_to_Dissolve) == 0x000558, "Member 'AGCN_RezIn_C::Meshes_to_Dissolve' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, Drone) == 0x000568, "Member 'AGCN_RezIn_C::Drone' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, DEBUG_CHILDCOMPONENTS) == 0x000570, "Member 'AGCN_RezIn_C::DEBUG_CHILDCOMPONENTS' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, Particle_Components) == 0x000578, "Member 'AGCN_RezIn_C::Particle_Components' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, Spawned_Teleport_VFX) == 0x000588, "Member 'AGCN_RezIn_C::Spawned_Teleport_VFX' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, Teleport_In_Visual_Effect) == 0x000590, "Member 'AGCN_RezIn_C::Teleport_In_Visual_Effect' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, Teleport_In_VFX_Attach_Point_Name) == 0x000598, "Member 'AGCN_RezIn_C::Teleport_In_VFX_Attach_Point_Name' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, Cur_Dissolve_Setup_Attempt) == 0x0005A0, "Member 'AGCN_RezIn_C::Cur_Dissolve_Setup_Attempt' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, AmountOfTimesToAttemptRestoreMats) == 0x0005A4, "Member 'AGCN_RezIn_C::AmountOfTimesToAttemptRestoreMats' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, Spawn_VFX_Attached) == 0x0005A8, "Member 'AGCN_RezIn_C::Spawn_VFX_Attached' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, Dissolve_Timeline_Playrate) == 0x0005AC, "Member 'AGCN_RezIn_C::Dissolve_Timeline_Playrate' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, Glow_Timeline_Playrate) == 0x0005B0, "Member 'AGCN_RezIn_C::Glow_Timeline_Playrate' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, Drone_Visual_Effect) == 0x0005B8, "Member 'AGCN_RezIn_C::Drone_Visual_Effect' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, DEBUG_TESTJANUSFX) == 0x0005C0, "Member 'AGCN_RezIn_C::DEBUG_TESTJANUSFX' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, Drone_VFX_Attach_Point) == 0x0005C4, "Member 'AGCN_RezIn_C::Drone_VFX_Attach_Point' has a wrong offset!");

}

