#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_ReviveGrenade_Trail

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GCNL_ReviveGrenade_Trail.GCNL_ReviveGrenade_Trail_C.ExecuteUbergraph_GCNL_ReviveGrenade_Trail
// 0x02C0 (0x02C0 - 0x0000)
struct GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail final 
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0010(0x00B8)(ConstParm, ContainsInstancedReference)
	TArray<class UFXSystemComponent*>             K2Node_Event_ParticleComponents;                   // 0x00C8(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents;                      // 0x00D8(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class UMatineeCameraShake*                    K2Node_Event_BurstCameraShakeInstance;             // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            K2Node_Event_BurstDecalInstance;                   // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_MyTarget_1;                           // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             K2Node_Event_EventType;                            // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D15[0x7];                                     // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_Event_Parameters_1;                         // 0x0108(0x00B8)(ConstParm, ContainsInstancedReference)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x01C8(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x01E0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x01E8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x01F0(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0210(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0230(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x023C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x0270(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABodyguard_Prj_ReviveGrenade_C*         K2Node_DynamicCast_AsBodyguard_Prj_Revive_Grenade; // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetTeamAffiliation_Friendly_;             // 0x0282(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0283(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetTeamAffiliation_Friendly__1;           // 0x0284(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0285(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D16[0x2];                                     // 0x0286(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D17[0x7];                                     // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D18[0x2];                                     // 0x02A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x02A4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D19[0x4];                                     // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         K2Node_Select_Default_1;                           // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail) == 0x000008, "Wrong alinment on GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail");
static_assert(sizeof(GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail) == 0x0002C0, "Wrong size on GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail");
static_assert(offsetof(GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail, EntryPoint) == 0x000000, "Member 'GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail, CallFunc_IsValid_ReturnValue_1) == 0x000005, "Member 'GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail, CallFunc_IsValid_ReturnValue_2) == 0x000006, "Member 'GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail, CallFunc_IsValid_ReturnValue_3) == 0x000007, "Member 'GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail, K2Node_Event_MyTarget) == 0x000008, "Member 'GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail, K2Node_Event_Parameters) == 0x000010, "Member 'GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail, K2Node_Event_ParticleComponents) == 0x0000C8, "Member 'GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail::K2Node_Event_ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail, K2Node_Event_AudioComponents) == 0x0000D8, "Member 'GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail::K2Node_Event_AudioComponents' has a wrong offset!");
static_assert(offsetof(GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail, K2Node_Event_BurstCameraShakeInstance) == 0x0000E8, "Member 'GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail::K2Node_Event_BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail, K2Node_Event_BurstDecalInstance) == 0x0000F0, "Member 'GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail::K2Node_Event_BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail, K2Node_Event_MyTarget_1) == 0x0000F8, "Member 'GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail::K2Node_Event_MyTarget_1' has a wrong offset!");
static_assert(offsetof(GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail, K2Node_Event_EventType) == 0x000100, "Member 'GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail::K2Node_Event_EventType' has a wrong offset!");
static_assert(offsetof(GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail, K2Node_Event_Parameters_1) == 0x000108, "Member 'GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail::K2Node_Event_Parameters_1' has a wrong offset!");
static_assert(offsetof(GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x0001C0, "Member 'GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x0001C4, "Member 'GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x0001C8, "Member 'GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x0001E0, "Member 'GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x0001E8, "Member 'GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x0001F0, "Member 'GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000210, "Member 'GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail, CallFunc_BreakGameplayCueParameters_Location) == 0x000230, "Member 'GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail, CallFunc_BreakGameplayCueParameters_Normal) == 0x00023C, "Member 'GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail, CallFunc_BreakGameplayCueParameters_Instigator) == 0x000248, "Member 'GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x000250, "Member 'GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x000258, "Member 'GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x000260, "Member 'GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x000268, "Member 'GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x00026C, "Member 'GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x000270, "Member 'GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail, K2Node_DynamicCast_AsBodyguard_Prj_Revive_Grenade) == 0x000278, "Member 'GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail::K2Node_DynamicCast_AsBodyguard_Prj_Revive_Grenade' has a wrong offset!");
static_assert(offsetof(GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail, K2Node_DynamicCast_bSuccess) == 0x000280, "Member 'GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail, Temp_bool_Variable) == 0x000281, "Member 'GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail, CallFunc_GetTeamAffiliation_Friendly_) == 0x000282, "Member 'GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail::CallFunc_GetTeamAffiliation_Friendly_' has a wrong offset!");
static_assert(offsetof(GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail, CallFunc_IsValid_ReturnValue_4) == 0x000283, "Member 'GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail, CallFunc_GetTeamAffiliation_Friendly__1) == 0x000284, "Member 'GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail::CallFunc_GetTeamAffiliation_Friendly__1' has a wrong offset!");
static_assert(offsetof(GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail, CallFunc_IsValid_ReturnValue_5) == 0x000285, "Member 'GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail, CallFunc_GetMaterial_ReturnValue) == 0x000288, "Member 'GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail, CallFunc_IsValid_ReturnValue_6) == 0x000290, "Member 'GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000298, "Member 'GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail, CallFunc_IsValid_ReturnValue_7) == 0x0002A0, "Member 'GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail, Temp_bool_Variable_1) == 0x0002A1, "Member 'GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail, K2Node_Select_Default) == 0x0002A4, "Member 'GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail, K2Node_Select_Default_1) == 0x0002B8, "Member 'GCNL_ReviveGrenade_Trail_C_ExecuteUbergraph_GCNL_ReviveGrenade_Trail::K2Node_Select_Default_1' has a wrong offset!");

// Function GCNL_ReviveGrenade_Trail.GCNL_ReviveGrenade_Trail_C.OnRemovalGeneric
// 0x00F0 (0x00F0 - 0x0000)
struct GCNL_ReviveGrenade_Trail_C_OnRemovalGeneric final 
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UFXSystemComponent*>             ParticleComponents;                                // 0x00C0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class UMatineeCameraShake*                    BurstCameraShakeInstance;                          // 0x00E0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_ReviveGrenade_Trail_C_OnRemovalGeneric) == 0x000008, "Wrong alinment on GCNL_ReviveGrenade_Trail_C_OnRemovalGeneric");
static_assert(sizeof(GCNL_ReviveGrenade_Trail_C_OnRemovalGeneric) == 0x0000F0, "Wrong size on GCNL_ReviveGrenade_Trail_C_OnRemovalGeneric");
static_assert(offsetof(GCNL_ReviveGrenade_Trail_C_OnRemovalGeneric, MyTarget) == 0x000000, "Member 'GCNL_ReviveGrenade_Trail_C_OnRemovalGeneric::MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_ReviveGrenade_Trail_C_OnRemovalGeneric, Parameters) == 0x000008, "Member 'GCNL_ReviveGrenade_Trail_C_OnRemovalGeneric::Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_ReviveGrenade_Trail_C_OnRemovalGeneric, ParticleComponents) == 0x0000C0, "Member 'GCNL_ReviveGrenade_Trail_C_OnRemovalGeneric::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_ReviveGrenade_Trail_C_OnRemovalGeneric, AudioComponents) == 0x0000D0, "Member 'GCNL_ReviveGrenade_Trail_C_OnRemovalGeneric::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCNL_ReviveGrenade_Trail_C_OnRemovalGeneric, BurstCameraShakeInstance) == 0x0000E0, "Member 'GCNL_ReviveGrenade_Trail_C_OnRemovalGeneric::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCNL_ReviveGrenade_Trail_C_OnRemovalGeneric, BurstDecalInstance) == 0x0000E8, "Member 'GCNL_ReviveGrenade_Trail_C_OnRemovalGeneric::BurstDecalInstance' has a wrong offset!");

// Function GCNL_ReviveGrenade_Trail.GCNL_ReviveGrenade_Trail_C.K2_HandleGameplayCue
// 0x00C8 (0x00C8 - 0x0000)
struct GCNL_ReviveGrenade_Trail_C_K2_HandleGameplayCue final 
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             EventType;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D1A[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0010(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GCNL_ReviveGrenade_Trail_C_K2_HandleGameplayCue) == 0x000008, "Wrong alinment on GCNL_ReviveGrenade_Trail_C_K2_HandleGameplayCue");
static_assert(sizeof(GCNL_ReviveGrenade_Trail_C_K2_HandleGameplayCue) == 0x0000C8, "Wrong size on GCNL_ReviveGrenade_Trail_C_K2_HandleGameplayCue");
static_assert(offsetof(GCNL_ReviveGrenade_Trail_C_K2_HandleGameplayCue, MyTarget) == 0x000000, "Member 'GCNL_ReviveGrenade_Trail_C_K2_HandleGameplayCue::MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_ReviveGrenade_Trail_C_K2_HandleGameplayCue, EventType) == 0x000008, "Member 'GCNL_ReviveGrenade_Trail_C_K2_HandleGameplayCue::EventType' has a wrong offset!");
static_assert(offsetof(GCNL_ReviveGrenade_Trail_C_K2_HandleGameplayCue, Parameters) == 0x000010, "Member 'GCNL_ReviveGrenade_Trail_C_K2_HandleGameplayCue::Parameters' has a wrong offset!");

// Function GCNL_ReviveGrenade_Trail.GCNL_ReviveGrenade_Trail_C.GetTeamAffiliation
// 0x0005 (0x0005 - 0x0000)
struct GCNL_ReviveGrenade_Trail_C_GetTeamAffiliation final 
{
public:
	bool                                          Friendly_;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_GetActorTeam_ReturnValue;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortTeamAffiliation                          CallFunc_GetTeamAffiliationToLocalPlayer_ReturnValue; // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GCNL_ReviveGrenade_Trail_C_GetTeamAffiliation) == 0x000001, "Wrong alinment on GCNL_ReviveGrenade_Trail_C_GetTeamAffiliation");
static_assert(sizeof(GCNL_ReviveGrenade_Trail_C_GetTeamAffiliation) == 0x000005, "Wrong size on GCNL_ReviveGrenade_Trail_C_GetTeamAffiliation");
static_assert(offsetof(GCNL_ReviveGrenade_Trail_C_GetTeamAffiliation, Friendly_) == 0x000000, "Member 'GCNL_ReviveGrenade_Trail_C_GetTeamAffiliation::Friendly_' has a wrong offset!");
static_assert(offsetof(GCNL_ReviveGrenade_Trail_C_GetTeamAffiliation, CallFunc_GetActorTeam_ReturnValue) == 0x000001, "Member 'GCNL_ReviveGrenade_Trail_C_GetTeamAffiliation::CallFunc_GetActorTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_ReviveGrenade_Trail_C_GetTeamAffiliation, CallFunc_IsValid_ReturnValue) == 0x000002, "Member 'GCNL_ReviveGrenade_Trail_C_GetTeamAffiliation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_ReviveGrenade_Trail_C_GetTeamAffiliation, CallFunc_GetTeamAffiliationToLocalPlayer_ReturnValue) == 0x000003, "Member 'GCNL_ReviveGrenade_Trail_C_GetTeamAffiliation::CallFunc_GetTeamAffiliationToLocalPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_ReviveGrenade_Trail_C_GetTeamAffiliation, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000004, "Member 'GCNL_ReviveGrenade_Trail_C_GetTeamAffiliation::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

}

