#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_CurieState_ElementAttached_Electricity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCNL_CurieState_ElementAttached_Electricity.GCNL_CurieState_ElementAttached_Electricity_C
// 0x0100 (0x08C0 - 0x07C0)
class AGCNL_CurieState_ElementAttached_Electricity_C final  : public AFortGameplayCueNotify_Loop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   PropagationSpline;                                 // 0x07C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OwningActor;                                       // 0x07D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABuildingSMActor*                       PropagationParentSMActor;                          // 0x07D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class ABuildingSMActor*                       OwningSMActor;                                     // 0x07E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         PropagationArcLength;                              // 0x07E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxLengthToDrawPropagationArc;                     // 0x07EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PropagationArcLifetime;                            // 0x07F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PropagationArcTilingDivisorMin;                    // 0x07F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PropagationArcTilingDivisorMax;                    // 0x07F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PropagationArcJumpDuration;                        // 0x07FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DelayBeforeActivatingMaterialTransition;           // 0x0800(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PropagationArcFadeoutTime;                         // 0x0804(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PropagationArcWorldScaleMin;                       // 0x0808(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PropagationArcWorldScaleMax;                       // 0x080C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PropagationArcNoiseScaleMin;                       // 0x0810(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PropagationArcNoiseScaleMax;                       // 0x0814(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PropagationArcZScaleMin;                           // 0x0818(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PropagationArcZScaleMax;                           // 0x081C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           RetriggerPropagationSplineTimer;                   // 0x0820(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         DelayBeforeRetriggeringPropagationSpline;          // 0x0828(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CurieColor;                                        // 0x082C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A74[0x4];                                     // 0x083C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMeshComponent*>           OwningActorStaticMeshComponents;                   // 0x0840(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	struct FVector                                OwningActorOrientation;                            // 0x0850(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RelativeRotationAmount;                            // 0x085C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Clamped;                                           // 0x0860(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A75[0x3];                                     // 0x0861(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                PropagationParentSMActorCentroid;                  // 0x0864(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                OwningSMActorCentroid;                             // 0x0870(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CentroidRandomBias;                                // 0x087C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMesh*>                    ArcMeshes;                                         // 0x0888(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	float                                         PropagationArcYScaleMin;                           // 0x0898(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PropagationArcYScaleMax;                           // 0x089C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFirstLoop;                                       // 0x08A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A76[0x3];                                     // 0x08A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PropagationArcSplineWidthFirstLoop;                // 0x08A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PropagationArcSplineWidth;                         // 0x08A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PropagationArcColorScale;                          // 0x08AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                VectorFromOwningActorToParent;                     // 0x08B0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GCNL_CurieState_ElementAttached_Electricity(int32 EntryPoint, int32 Temp_int_Array_Index_Variable, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, class AActor* K2Node_Event_MyTarget_1, struct FGameplayCueParameters& K2Node_Event_Parameters_1, TArray<class UParticleSystemComponent*>& K2Node_Event_ParticleComponents_1, TArray<class UAudioComponent*>& K2Node_Event_AudioComponents_1, EEndPlayReason K2Node_Event_EndPlayReason, bool CallFunc_IsValid_ReturnValue, class AActor* K2Node_Event_MyTarget, struct FGameplayCueParameters& K2Node_Event_Parameters, TArray<class UParticleSystemComponent*>& K2Node_Event_ParticleComponents, TArray<class UAudioComponent*>& K2Node_Event_AudioComponents, class UMatineeCameraShake* K2Node_Event_BurstCameraShakeInstance, class ADecalActor* K2Node_Event_BurstDecalInstance, bool CallFunc_IsDedicatedServer_ReturnValue, int32 Temp_int_Loop_Counter_Variable, int32 Temp_int_Array_Index_Variable_1, int32 CallFunc_Add_IntInt_ReturnValue, bool CallFunc_FindPropagationParent_Found, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, const struct FVector& CallFunc_GetLocalBounds_Min, const struct FVector& CallFunc_GetLocalBounds_Max, float CallFunc_BreakVector_X, float CallFunc_BreakVector_Y, float CallFunc_BreakVector_Z, float CallFunc_Divide_FloatFloat_ReturnValue, float CallFunc_RandomFloatInRange_ReturnValue, float CallFunc_Multiply_FloatFloat_ReturnValue, const struct FVector4& K2Node_MakeStruct_Vector4, TArray<class UStaticMeshComponent*>& CallFunc_K2_GetComponentsByClass_ReturnValue, class UStaticMeshComponent* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, int32 CallFunc_Array_AddUnique_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, class UStaticMeshComponent* CallFunc_Array_Get_Item_1, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_IsValid_ReturnValue_2, float CallFunc_GetSplineRelativeRotationXOffset_X, const struct FRotator& CallFunc_MakeRotator_ReturnValue, const struct FHitResult& CallFunc_K2_AddRelativeRotation_SweepHitResult, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue, float CallFunc_VSize_ReturnValue, const struct FHitResult& CallFunc_K2_SetWorldLocation_SweepHitResult, const struct FVector& CallFunc_GetNiagaraFlippedAxes_VectorOut, const struct FRotator& CallFunc_MakeRotFromX_ReturnValue, class UNiagaraComponent* CallFunc_SpawnSystemAtLocation_ReturnValue, int32 Temp_int_Loop_Counter_Variable_1, bool CallFunc_Less_IntInt_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue_1, class UStaticMesh* CallFunc_GetRandomPropagationArcSpline_Output, bool CallFunc_SetStaticMesh_ReturnValue, float CallFunc_RandomFloatInRange_ReturnValue_1, float CallFunc_Multiply_FloatFloat_ReturnValue_1, const struct FVector& CallFunc_MakeVector_ReturnValue, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_1, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue_1, bool CallFunc_Greater_FloatFloat_ReturnValue, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue_1, const struct FRotator& CallFunc_MakeRotFromX_ReturnValue_1, const struct FHitResult& CallFunc_K2_SetWorldRotation_SweepHitResult);
	void RetriggerPropagationSpline();
	void HideSplineMesh();
	void DrawPropagationSpline();
	void OnRemoval(class AActor* MyTarget, struct FGameplayCueParameters& Parameters, TArray<class UParticleSystemComponent*>& ParticleComponents, TArray<class UAudioComponent*>& AudioComponents, class UMatineeCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void OnLoopingStart(class AActor* MyTarget, struct FGameplayCueParameters& Parameters, TArray<class UParticleSystemComponent*>& ParticleComponents, TArray<class UAudioComponent*>& AudioComponents);
	void FindPropagationParent(bool* Found, const struct FVector& CallFunc_GetCentroid_ReturnValue, float CallFunc_BreakVector_X, float CallFunc_BreakVector_Y, float CallFunc_BreakVector_Z, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue, float CallFunc_BreakVector_X_1, float CallFunc_BreakVector_Y_1, float CallFunc_BreakVector_Z_1, float CallFunc_BreakVector_X_2, float CallFunc_BreakVector_Y_2, float CallFunc_BreakVector_Z_2, float CallFunc_RandomFloatInRange_ReturnValue, float CallFunc_RandomFloatInRange_ReturnValue_1, float CallFunc_RandomFloatInRange_ReturnValue_2, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue_1, const struct FVector& CallFunc_MakeVector_ReturnValue, float CallFunc_BreakVector_X_3, float CallFunc_BreakVector_Y_3, float CallFunc_BreakVector_Z_3, float CallFunc_RandomFloatInRange_ReturnValue_3, class ABuildingSMActor* K2Node_DynamicCast_AsBuilding_SMActor, bool K2Node_DynamicCast_bSuccess, float CallFunc_RandomFloatInRange_ReturnValue_4, float CallFunc_RandomFloatInRange_ReturnValue_5, const struct FVector& CallFunc_MakeVector_ReturnValue_1, bool CallFunc_IsValid_ReturnValue, const struct FVector& CallFunc_Add_VectorVector_ReturnValue, const struct FVector& CallFunc_GetCentroid_ReturnValue_1, class UFortCurieComponent* CallFunc_GetCurieComponentFromActor_ReturnValue, const struct FVector& CallFunc_Add_VectorVector_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_1, class AActor* CallFunc_GetLastElectricalPropagationParent_ReturnValue, bool CallFunc_IsValid_ReturnValue_2, class ABuildingSMActor* K2Node_DynamicCast_AsBuilding_SMActor_1, bool K2Node_DynamicCast_bSuccess_1);
	void SetPropagationSplineHiddenInGame(bool NewHidden);
	void SetPropagationSplineCustomPrimitiveData(bool Temp_bool_Variable, float Temp_float_Variable, bool Temp_bool_Variable_1, float K2Node_Select_Default, float K2Node_Select_Default_1, float CallFunc_RandomFloatInRange_ReturnValue, float CallFunc_BreakVector_X, float CallFunc_BreakVector_Y, float CallFunc_BreakVector_Z, float CallFunc_RandomFloatInRange_ReturnValue_1, float CallFunc_BreakVector_X_1, float CallFunc_BreakVector_Y_1, float CallFunc_BreakVector_Z_1, float CallFunc_RandomFloatInRange_ReturnValue_2, float CallFunc_RandomFloatInRange_ReturnValue_3, float CallFunc_RandomFloatInRange_ReturnValue_4, const struct FVector& CallFunc_MakeVector_ReturnValue, float CallFunc_GetGameTimeInSeconds_ReturnValue, float CallFunc_Add_FloatFloat_ReturnValue, float CallFunc_Subtract_FloatFloat_ReturnValue, float CallFunc_GetGameTimeInSeconds_ReturnValue_1, float CallFunc_RandomFloatInRange_ReturnValue_5, float CallFunc_Divide_FloatFloat_ReturnValue);
	void GetActorPlaneOrientation(const struct FVector& ActorBoxExtent, bool CallFunc_IsValid_ReturnValue, const struct FVector& CallFunc_GetActorBounds_Origin, const struct FVector& CallFunc_GetActorBounds_BoxExtent, const struct FVector& CallFunc_Vector_GetAbs_ReturnValue, float CallFunc_BreakVector_X, float CallFunc_BreakVector_Y, float CallFunc_BreakVector_Z, bool CallFunc_Less_FloatFloat_ReturnValue, bool CallFunc_Less_FloatFloat_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue, const struct FVector& CallFunc_Vector_GetAbs_ReturnValue_1, float CallFunc_BreakVector_X_1, float CallFunc_BreakVector_Y_1, float CallFunc_BreakVector_Z_1, bool CallFunc_Less_FloatFloat_ReturnValue_2, bool CallFunc_Less_FloatFloat_ReturnValue_3, bool CallFunc_BooleanAND_ReturnValue_1);
	void GetSplineRelativeRotationXOffset(float* X, bool Temp_bool_Variable, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, const struct FVector& CallFunc_Vector_GetSignVector_ReturnValue, float CallFunc_BreakVector_X, float CallFunc_BreakVector_Y, float CallFunc_BreakVector_Z, class APlayerCameraManager* CallFunc_GetPlayerCameraManager_ReturnValue, const struct FVector& CallFunc_MakeVector_ReturnValue, bool CallFunc_IsValid_ReturnValue, class APlayerCameraManager* CallFunc_GetPlayerCameraManager_ReturnValue_1, const struct FVector& CallFunc_GetCameraLocation_ReturnValue, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue, const struct FVector& CallFunc_Vector_GetSignVector_ReturnValue_1, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue, const struct FVector& CallFunc_Multiply_VectorVector_ReturnValue, float CallFunc_Dot_VectorVector_ReturnValue, float CallFunc_FClamp_ReturnValue, float K2Node_Select_Default);
	void GetNiagaraFlippedAxes(const struct FVector& VectorIn, struct FVector* VectorOut, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, class APlayerCameraManager* CallFunc_GetPlayerCameraManager_ReturnValue, class APlayerCameraManager* CallFunc_GetPlayerCameraManager_ReturnValue_1, bool CallFunc_IsValid_ReturnValue, const struct FVector& CallFunc_GetCameraLocation_ReturnValue, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue, const struct FVector& CallFunc_Vector_GetSignVector_ReturnValue, const struct FVector& CallFunc_Multiply_VectorVector_ReturnValue);
	void GetRandomPropagationArcSpline(class UStaticMesh** Output, int32 CallFunc_Array_LastIndex_ReturnValue, int32 CallFunc_RandomIntegerInRange_ReturnValue, class UStaticMesh* CallFunc_Array_Get_Item);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCNL_CurieState_ElementAttached_Electricity_C">();
	}
	static class AGCNL_CurieState_ElementAttached_Electricity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCNL_CurieState_ElementAttached_Electricity_C>();
	}
};
static_assert(alignof(AGCNL_CurieState_ElementAttached_Electricity_C) == 0x000008, "Wrong alinment on AGCNL_CurieState_ElementAttached_Electricity_C");
static_assert(sizeof(AGCNL_CurieState_ElementAttached_Electricity_C) == 0x0008C0, "Wrong size on AGCNL_CurieState_ElementAttached_Electricity_C");
static_assert(offsetof(AGCNL_CurieState_ElementAttached_Electricity_C, UberGraphFrame) == 0x0007C0, "Member 'AGCNL_CurieState_ElementAttached_Electricity_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCNL_CurieState_ElementAttached_Electricity_C, PropagationSpline) == 0x0007C8, "Member 'AGCNL_CurieState_ElementAttached_Electricity_C::PropagationSpline' has a wrong offset!");
static_assert(offsetof(AGCNL_CurieState_ElementAttached_Electricity_C, OwningActor) == 0x0007D0, "Member 'AGCNL_CurieState_ElementAttached_Electricity_C::OwningActor' has a wrong offset!");
static_assert(offsetof(AGCNL_CurieState_ElementAttached_Electricity_C, PropagationParentSMActor) == 0x0007D8, "Member 'AGCNL_CurieState_ElementAttached_Electricity_C::PropagationParentSMActor' has a wrong offset!");
static_assert(offsetof(AGCNL_CurieState_ElementAttached_Electricity_C, OwningSMActor) == 0x0007E0, "Member 'AGCNL_CurieState_ElementAttached_Electricity_C::OwningSMActor' has a wrong offset!");
static_assert(offsetof(AGCNL_CurieState_ElementAttached_Electricity_C, PropagationArcLength) == 0x0007E8, "Member 'AGCNL_CurieState_ElementAttached_Electricity_C::PropagationArcLength' has a wrong offset!");
static_assert(offsetof(AGCNL_CurieState_ElementAttached_Electricity_C, MaxLengthToDrawPropagationArc) == 0x0007EC, "Member 'AGCNL_CurieState_ElementAttached_Electricity_C::MaxLengthToDrawPropagationArc' has a wrong offset!");
static_assert(offsetof(AGCNL_CurieState_ElementAttached_Electricity_C, PropagationArcLifetime) == 0x0007F0, "Member 'AGCNL_CurieState_ElementAttached_Electricity_C::PropagationArcLifetime' has a wrong offset!");
static_assert(offsetof(AGCNL_CurieState_ElementAttached_Electricity_C, PropagationArcTilingDivisorMin) == 0x0007F4, "Member 'AGCNL_CurieState_ElementAttached_Electricity_C::PropagationArcTilingDivisorMin' has a wrong offset!");
static_assert(offsetof(AGCNL_CurieState_ElementAttached_Electricity_C, PropagationArcTilingDivisorMax) == 0x0007F8, "Member 'AGCNL_CurieState_ElementAttached_Electricity_C::PropagationArcTilingDivisorMax' has a wrong offset!");
static_assert(offsetof(AGCNL_CurieState_ElementAttached_Electricity_C, PropagationArcJumpDuration) == 0x0007FC, "Member 'AGCNL_CurieState_ElementAttached_Electricity_C::PropagationArcJumpDuration' has a wrong offset!");
static_assert(offsetof(AGCNL_CurieState_ElementAttached_Electricity_C, DelayBeforeActivatingMaterialTransition) == 0x000800, "Member 'AGCNL_CurieState_ElementAttached_Electricity_C::DelayBeforeActivatingMaterialTransition' has a wrong offset!");
static_assert(offsetof(AGCNL_CurieState_ElementAttached_Electricity_C, PropagationArcFadeoutTime) == 0x000804, "Member 'AGCNL_CurieState_ElementAttached_Electricity_C::PropagationArcFadeoutTime' has a wrong offset!");
static_assert(offsetof(AGCNL_CurieState_ElementAttached_Electricity_C, PropagationArcWorldScaleMin) == 0x000808, "Member 'AGCNL_CurieState_ElementAttached_Electricity_C::PropagationArcWorldScaleMin' has a wrong offset!");
static_assert(offsetof(AGCNL_CurieState_ElementAttached_Electricity_C, PropagationArcWorldScaleMax) == 0x00080C, "Member 'AGCNL_CurieState_ElementAttached_Electricity_C::PropagationArcWorldScaleMax' has a wrong offset!");
static_assert(offsetof(AGCNL_CurieState_ElementAttached_Electricity_C, PropagationArcNoiseScaleMin) == 0x000810, "Member 'AGCNL_CurieState_ElementAttached_Electricity_C::PropagationArcNoiseScaleMin' has a wrong offset!");
static_assert(offsetof(AGCNL_CurieState_ElementAttached_Electricity_C, PropagationArcNoiseScaleMax) == 0x000814, "Member 'AGCNL_CurieState_ElementAttached_Electricity_C::PropagationArcNoiseScaleMax' has a wrong offset!");
static_assert(offsetof(AGCNL_CurieState_ElementAttached_Electricity_C, PropagationArcZScaleMin) == 0x000818, "Member 'AGCNL_CurieState_ElementAttached_Electricity_C::PropagationArcZScaleMin' has a wrong offset!");
static_assert(offsetof(AGCNL_CurieState_ElementAttached_Electricity_C, PropagationArcZScaleMax) == 0x00081C, "Member 'AGCNL_CurieState_ElementAttached_Electricity_C::PropagationArcZScaleMax' has a wrong offset!");
static_assert(offsetof(AGCNL_CurieState_ElementAttached_Electricity_C, RetriggerPropagationSplineTimer) == 0x000820, "Member 'AGCNL_CurieState_ElementAttached_Electricity_C::RetriggerPropagationSplineTimer' has a wrong offset!");
static_assert(offsetof(AGCNL_CurieState_ElementAttached_Electricity_C, DelayBeforeRetriggeringPropagationSpline) == 0x000828, "Member 'AGCNL_CurieState_ElementAttached_Electricity_C::DelayBeforeRetriggeringPropagationSpline' has a wrong offset!");
static_assert(offsetof(AGCNL_CurieState_ElementAttached_Electricity_C, CurieColor) == 0x00082C, "Member 'AGCNL_CurieState_ElementAttached_Electricity_C::CurieColor' has a wrong offset!");
static_assert(offsetof(AGCNL_CurieState_ElementAttached_Electricity_C, OwningActorStaticMeshComponents) == 0x000840, "Member 'AGCNL_CurieState_ElementAttached_Electricity_C::OwningActorStaticMeshComponents' has a wrong offset!");
static_assert(offsetof(AGCNL_CurieState_ElementAttached_Electricity_C, OwningActorOrientation) == 0x000850, "Member 'AGCNL_CurieState_ElementAttached_Electricity_C::OwningActorOrientation' has a wrong offset!");
static_assert(offsetof(AGCNL_CurieState_ElementAttached_Electricity_C, RelativeRotationAmount) == 0x00085C, "Member 'AGCNL_CurieState_ElementAttached_Electricity_C::RelativeRotationAmount' has a wrong offset!");
static_assert(offsetof(AGCNL_CurieState_ElementAttached_Electricity_C, Clamped) == 0x000860, "Member 'AGCNL_CurieState_ElementAttached_Electricity_C::Clamped' has a wrong offset!");
static_assert(offsetof(AGCNL_CurieState_ElementAttached_Electricity_C, PropagationParentSMActorCentroid) == 0x000864, "Member 'AGCNL_CurieState_ElementAttached_Electricity_C::PropagationParentSMActorCentroid' has a wrong offset!");
static_assert(offsetof(AGCNL_CurieState_ElementAttached_Electricity_C, OwningSMActorCentroid) == 0x000870, "Member 'AGCNL_CurieState_ElementAttached_Electricity_C::OwningSMActorCentroid' has a wrong offset!");
static_assert(offsetof(AGCNL_CurieState_ElementAttached_Electricity_C, CentroidRandomBias) == 0x00087C, "Member 'AGCNL_CurieState_ElementAttached_Electricity_C::CentroidRandomBias' has a wrong offset!");
static_assert(offsetof(AGCNL_CurieState_ElementAttached_Electricity_C, ArcMeshes) == 0x000888, "Member 'AGCNL_CurieState_ElementAttached_Electricity_C::ArcMeshes' has a wrong offset!");
static_assert(offsetof(AGCNL_CurieState_ElementAttached_Electricity_C, PropagationArcYScaleMin) == 0x000898, "Member 'AGCNL_CurieState_ElementAttached_Electricity_C::PropagationArcYScaleMin' has a wrong offset!");
static_assert(offsetof(AGCNL_CurieState_ElementAttached_Electricity_C, PropagationArcYScaleMax) == 0x00089C, "Member 'AGCNL_CurieState_ElementAttached_Electricity_C::PropagationArcYScaleMax' has a wrong offset!");
static_assert(offsetof(AGCNL_CurieState_ElementAttached_Electricity_C, IsFirstLoop) == 0x0008A0, "Member 'AGCNL_CurieState_ElementAttached_Electricity_C::IsFirstLoop' has a wrong offset!");
static_assert(offsetof(AGCNL_CurieState_ElementAttached_Electricity_C, PropagationArcSplineWidthFirstLoop) == 0x0008A4, "Member 'AGCNL_CurieState_ElementAttached_Electricity_C::PropagationArcSplineWidthFirstLoop' has a wrong offset!");
static_assert(offsetof(AGCNL_CurieState_ElementAttached_Electricity_C, PropagationArcSplineWidth) == 0x0008A8, "Member 'AGCNL_CurieState_ElementAttached_Electricity_C::PropagationArcSplineWidth' has a wrong offset!");
static_assert(offsetof(AGCNL_CurieState_ElementAttached_Electricity_C, PropagationArcColorScale) == 0x0008AC, "Member 'AGCNL_CurieState_ElementAttached_Electricity_C::PropagationArcColorScale' has a wrong offset!");
static_assert(offsetof(AGCNL_CurieState_ElementAttached_Electricity_C, VectorFromOwningActorToParent) == 0x0008B0, "Member 'AGCNL_CurieState_ElementAttached_Electricity_C::VectorFromOwningActorToParent' has a wrong offset!");

}

