#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_ReviveGrenade_Explosion

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCNL_ReviveGrenade_Explosion.GCNL_ReviveGrenade_Explosion_C
// 0x0018 (0x07D8 - 0x07C0)
class AGCNL_ReviveGrenade_Explosion_C final  : public AFortGameplayCueNotify_Loop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFXSystemAsset*                         FriendlyExplosionVFX;                              // 0x07C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemAsset*                         EnemyExplosionVFX;                                 // 0x07D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GCNL_ReviveGrenade_Explosion(int32 EntryPoint, bool Temp_bool_Variable, class AActor* K2Node_Event_MyTarget, EGameplayCueEvent K2Node_Event_EventType, struct FGameplayCueParameters& K2Node_Event_Parameters, float CallFunc_BreakGameplayCueParameters_NormalizedMagnitude, float CallFunc_BreakGameplayCueParameters_RawMagnitude, const struct FGameplayEffectContextHandle& CallFunc_BreakGameplayCueParameters_EffectContext, const struct FGameplayTag& CallFunc_BreakGameplayCueParameters_MatchedTagName, const struct FGameplayTag& CallFunc_BreakGameplayCueParameters_OriginalTag, const struct FGameplayTagContainer& CallFunc_BreakGameplayCueParameters_AggregatedSourceTags, const struct FGameplayTagContainer& CallFunc_BreakGameplayCueParameters_AggregatedTargetTags, const struct FVector& CallFunc_BreakGameplayCueParameters_Location, const struct FVector& CallFunc_BreakGameplayCueParameters_Normal, class AActor* CallFunc_BreakGameplayCueParameters_Instigator, class AActor* CallFunc_BreakGameplayCueParameters_EffectCauser, class UObject* CallFunc_BreakGameplayCueParameters_SourceObject, class UPhysicalMaterial* CallFunc_BreakGameplayCueParameters_PhysicalMaterial, int32 CallFunc_BreakGameplayCueParameters_GameplayEffectLevel, int32 CallFunc_BreakGameplayCueParameters_AbilityLevel, class USceneComponent* CallFunc_BreakGameplayCueParameters_TargetAttachComponent, bool CallFunc_IsValid_ReturnValue, uint8 CallFunc_GetActorTeam_ReturnValue, EFortTeamAffiliation CallFunc_GetTeamAffiliationToLocalPlayer_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue, class UFXSystemAsset* K2Node_Select_Default, class UFXSystemComponent* CallFunc_SpawnFXAtLocation_ReturnValue);
	void K2_HandleGameplayCue(class AActor* MyTarget, EGameplayCueEvent EventType, struct FGameplayCueParameters& Parameters);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCNL_ReviveGrenade_Explosion_C">();
	}
	static class AGCNL_ReviveGrenade_Explosion_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCNL_ReviveGrenade_Explosion_C>();
	}
};
static_assert(alignof(AGCNL_ReviveGrenade_Explosion_C) == 0x000008, "Wrong alinment on AGCNL_ReviveGrenade_Explosion_C");
static_assert(sizeof(AGCNL_ReviveGrenade_Explosion_C) == 0x0007D8, "Wrong size on AGCNL_ReviveGrenade_Explosion_C");
static_assert(offsetof(AGCNL_ReviveGrenade_Explosion_C, UberGraphFrame) == 0x0007C0, "Member 'AGCNL_ReviveGrenade_Explosion_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCNL_ReviveGrenade_Explosion_C, FriendlyExplosionVFX) == 0x0007C8, "Member 'AGCNL_ReviveGrenade_Explosion_C::FriendlyExplosionVFX' has a wrong offset!");
static_assert(offsetof(AGCNL_ReviveGrenade_Explosion_C, EnemyExplosionVFX) == 0x0007D0, "Member 'AGCNL_ReviveGrenade_Explosion_C::EnemyExplosionVFX' has a wrong offset!");

}

