#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HeldObjectLayerAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass HeldObjectLayerAnimBP.HeldObjectLayerAnimBP_C
// 0x1A00 (0x1D80 - 0x0380)
class UHeldObjectLayerAnimBP_C final  : public UFortItemLayerAnimInstance
{
public:
	uint8                                         Pad_6E7C[0x8];                                     // 0x0378(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0380(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimInstanceSubsystemData             AnimBlueprintClassSubsystem_PropertyAccess;        // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E7D[0x7];                                     // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_Root                         AnimGraphNode_Root_34;                             // 0x0390(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_18;                  // 0x03C0(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_33;                             // 0x0448(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_17;                  // 0x0478(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_32;                             // 0x0500(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_16;                  // 0x0530(0x0088)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace;            // 0x05B8(0x0188)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_15;                  // 0x0740(0x0088)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x07C8(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0890(0x0028)()
	struct FAnimNode_Root                         AnimGraphNode_Root_31;                             // 0x08B8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_14;                  // 0x08E8(0x0088)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_12;                   // 0x0970(0x0078)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x09E8(0x00A0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_30;                             // 0x0A88(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_13;                  // 0x0AB8(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_29;                             // 0x0B40(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_12;                  // 0x0B70(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_28;                             // 0x0BF8(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_27;                             // 0x0C28(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_26;                             // 0x0C58(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_11;                   // 0x0C88(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_25;                             // 0x0D00(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_10;                   // 0x0D30(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_24;                             // 0x0DA8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9;                    // 0x0DD8(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_23;                             // 0x0E50(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8;                    // 0x0E80(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_22;                             // 0x0EF8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0x0F28(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_21;                             // 0x0FA0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x0FD0(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_20;                             // 0x1048(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x1078(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_19;                             // 0x10F0(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_18;                             // 0x1120(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_17;                             // 0x1150(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_11;                  // 0x1180(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_16;                             // 0x1208(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_10;                  // 0x1238(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_15;                             // 0x12C0(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_9;                   // 0x12F0(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_14;                             // 0x1378(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_8;                   // 0x13A8(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_13;                             // 0x1430(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_7;                   // 0x1460(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_12;                             // 0x14E8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_6;                   // 0x1518(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_11;                             // 0x15A0(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_5;                   // 0x15D0(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_10;                             // 0x1658(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_4;                   // 0x1688(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_9;                              // 0x1710(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_3;                   // 0x1740(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_8;                              // 0x17C8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x17F8(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_7;                              // 0x1880(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x18B0(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_6;                              // 0x1938(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x1968(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_5;                              // 0x19E0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x1A10(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_4;                              // 0x1A88(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x1AB8(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x1B30(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x1B60(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x1BD8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x1C08(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x1C80(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x1CB0(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1D38(0x0030)()
	float                                         Pitch;                                             // 0x1D68(0x0004)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Yaw;                                               // 0x1D6C(0x0004)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AimOffsetAlpha;                                    // 0x1D70(0x0004)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsHeldObjectDropped;                               // 0x1D74(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_HeldObjectLayerAnimBP(int32 EntryPoint);
	void BlueprintInitializeAnimation();
	void AnimNotify_HeldObjectPickUp();
	void AnimNotify_HeldObjectPlace();
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void ItemSkeletalControl(const struct FPoseLink& InPose, struct FPoseLink* Param_ItemSkeletalControl);
	void ItemSwimJumpSurfaceEnd(struct FPoseLink* Param_ItemSwimJumpSurfaceEnd);
	void ItemSwimJumpSurfaceLoop(struct FPoseLink* Param_ItemSwimJumpSurfaceLoop);
	void ItemSwimJumpFallLoop(struct FPoseLink* Param_ItemSwimJumpFallLoop);
	void ItemSwimJumpStartLoop(struct FPoseLink* Param_ItemSwimJumpStartLoop);
	void ItemSwimJumpStart(struct FPoseLink* Param_ItemSwimJumpStart);
	void ItemRelaxedEntry(const struct FPoseLink& InPoseRelaxedEntry, struct FPoseLink* Param_ItemRelaxedEntry);
	void ItemLowerBodyJogPostPivot(const struct FPoseLink& InPoseLowerBodyJogPostPivot, struct FPoseLink* Param_ItemLowerBodyJogPostPivot);
	void ItemLowerBodyJogPrePivot(const struct FPoseLink& InPoseLowerBodyJogPrePivot, struct FPoseLink* Param_ItemLowerBodyJogPrePivot);
	void ItemLowerBodyJogStop(const struct FPoseLink& InPoseLowerBodyJogStop, struct FPoseLink* Param_ItemLowerBodyJogStop);
	void ItemLowerBodyJogStart(const struct FPoseLink& InPoseLowerBodyJogStart, struct FPoseLink* Param_ItemLowerBodyJogStart);
	void ItemLowerBodyLeanAdditive(const struct FPoseLink& InPoseLowerBodyLeanAdditive, struct FPoseLink* Param_ItemLowerBodyLeanAdditive);
	void ItemLowerBodyMovement(const struct FPoseLink& InPoseLowerBodyMovement, struct FPoseLink* Param_ItemLowerBodyMovement);
	void ItemJogPostPivotAdditive(const struct FPoseLink& InPosePostPivotAdditive, struct FPoseLink* Param_ItemJogPostPivotAdditive);
	void ItemJogPrePivotAdditive(const struct FPoseLink& InPosePrePivotAdditive, struct FPoseLink* Param_ItemJogPrePivotAdditive);
	void ItemJogStopAdditive(const struct FPoseLink& InPoseJogStopAdditive, struct FPoseLink* Param_ItemJogStopAdditive);
	void ItemJogStartAdditive(const struct FPoseLink& InPoseJogStartAdditive, struct FPoseLink* Param_ItemJogStartAdditive);
	void ItemFlyModeLoopAdditive(struct FPoseLink* Param_ItemFlyModeLoopAdditive);
	void ItemFlyModeStartAdditive(struct FPoseLink* Param_ItemFlyModeStartAdditive);
	void ItemZipLineStartAdditive(struct FPoseLink* Param_ItemZipLineStartAdditive);
	void ItemJetPackJumpAdditive(struct FPoseLink* Param_ItemJetPackJumpAdditive);
	void ItemJetPackStartAdditive(struct FPoseLink* Param_ItemJetPackStartAdditive);
	void ItemFallLandAdditive(struct FPoseLink* Param_ItemFallLandAdditive);
	void ItemFallAdditive(struct FPoseLink* Param_ItemFallAdditive);
	void ItemJumpLoopAdditive(struct FPoseLink* Param_ItemJumpLoopAdditive);
	void ItemJumpUpAdditive(struct FPoseLink* Param_ItemJumpUpAdditive);
	void ItemSlopeSliding(struct FPoseLink* Param_ItemSlopeSliding);
	void ItemCrouchTurningAdditive(struct FPoseLink* Param_ItemCrouchTurningAdditive);
	void ItemIdleAdditive(const struct FPoseLink& InPoseIdleAdditive, struct FPoseLink* Param_ItemIdleAdditive);
	void ItemFullBodySprint(const struct FPoseLink& InPoseSprint, struct FPoseLink* Param_ItemFullBodySprint);
	void ItemUpperBody(const struct FPoseLink& InPoseUpperBody, const struct FFortAnimInput_AdjustedAim& InputParam, struct FPoseLink* Param_ItemUpperBody);
	void ItemAimOffset(const struct FPoseLink& InPose_AimOffset, float Param_AimOffsetAlpha, float Param_Yaw, float Param_Pitch, const struct FPoseLink& InPose_UpperLowerPreMeleeAO, struct FPoseLink* Param_ItemAimOffset);
	void ItemFullBodyOverride(const struct FPoseLink& InPoseFullBody, struct FPoseLink* Param_ItemFullBodyOverride);
	void ItemPreIK(const struct FPoseLink& InPose_PreIK, struct FPoseLink* Param_ItemPreIK);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HeldObjectLayerAnimBP_C">();
	}
	static class UHeldObjectLayerAnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHeldObjectLayerAnimBP_C>();
	}
};
static_assert(alignof(UHeldObjectLayerAnimBP_C) == 0x000010, "Wrong alinment on UHeldObjectLayerAnimBP_C");
static_assert(sizeof(UHeldObjectLayerAnimBP_C) == 0x001D80, "Wrong size on UHeldObjectLayerAnimBP_C");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, UberGraphFrame) == 0x000380, "Member 'UHeldObjectLayerAnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimBlueprintClassSubsystem_PropertyAccess) == 0x000388, "Member 'UHeldObjectLayerAnimBP_C::AnimBlueprintClassSubsystem_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_34) == 0x000390, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_34' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_LinkedInputPose_18) == 0x0003C0, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_LinkedInputPose_18' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_33) == 0x000448, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_33' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_LinkedInputPose_17) == 0x000478, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_LinkedInputPose_17' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_32) == 0x000500, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_32' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_LinkedInputPose_16) == 0x000530, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_LinkedInputPose_16' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_RotationOffsetBlendSpace) == 0x0005B8, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_RotationOffsetBlendSpace' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_LinkedInputPose_15) == 0x000740, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_LinkedInputPose_15' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_SaveCachedPose) == 0x0007C8, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_UseCachedPose) == 0x000890, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_31) == 0x0008B8, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_31' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_LinkedInputPose_14) == 0x0008E8, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_LinkedInputPose_14' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_SequencePlayer_12) == 0x000970, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_SequencePlayer_12' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_BlendListByBool) == 0x0009E8, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_30) == 0x000A88, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_30' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_LinkedInputPose_13) == 0x000AB8, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_LinkedInputPose_13' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_29) == 0x000B40, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_29' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_LinkedInputPose_12) == 0x000B70, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_LinkedInputPose_12' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_28) == 0x000BF8, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_28' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_27) == 0x000C28, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_27' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_26) == 0x000C58, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_26' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_SequencePlayer_11) == 0x000C88, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_SequencePlayer_11' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_25) == 0x000D00, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_25' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_SequencePlayer_10) == 0x000D30, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_SequencePlayer_10' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_24) == 0x000DA8, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_24' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_SequencePlayer_9) == 0x000DD8, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_SequencePlayer_9' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_23) == 0x000E50, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_23' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_SequencePlayer_8) == 0x000E80, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_SequencePlayer_8' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_22) == 0x000EF8, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_22' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_SequencePlayer_7) == 0x000F28, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_SequencePlayer_7' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_21) == 0x000FA0, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_21' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_SequencePlayer_6) == 0x000FD0, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_SequencePlayer_6' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_20) == 0x001048, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_20' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_SequencePlayer_5) == 0x001078, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_19) == 0x0010F0, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_19' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_18) == 0x001120, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_18' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_17) == 0x001150, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_17' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_LinkedInputPose_11) == 0x001180, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_LinkedInputPose_11' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_16) == 0x001208, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_16' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_LinkedInputPose_10) == 0x001238, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_LinkedInputPose_10' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_15) == 0x0012C0, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_15' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_LinkedInputPose_9) == 0x0012F0, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_LinkedInputPose_9' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_14) == 0x001378, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_14' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_LinkedInputPose_8) == 0x0013A8, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_LinkedInputPose_8' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_13) == 0x001430, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_13' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_LinkedInputPose_7) == 0x001460, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_LinkedInputPose_7' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_12) == 0x0014E8, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_12' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_LinkedInputPose_6) == 0x001518, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_LinkedInputPose_6' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_11) == 0x0015A0, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_11' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_LinkedInputPose_5) == 0x0015D0, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_LinkedInputPose_5' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_10) == 0x001658, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_10' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_LinkedInputPose_4) == 0x001688, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_LinkedInputPose_4' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_9) == 0x001710, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_9' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_LinkedInputPose_3) == 0x001740, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_LinkedInputPose_3' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_8) == 0x0017C8, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_8' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_LinkedInputPose_2) == 0x0017F8, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_LinkedInputPose_2' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_7) == 0x001880, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_7' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_LinkedInputPose_1) == 0x0018B0, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_LinkedInputPose_1' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_6) == 0x001938, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_6' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_SequencePlayer_4) == 0x001968, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_5) == 0x0019E0, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_5' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_SequencePlayer_3) == 0x001A10, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_4) == 0x001A88, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_4' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_SequencePlayer_2) == 0x001AB8, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_3) == 0x001B30, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_3' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_SequencePlayer_1) == 0x001B60, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_2) == 0x001BD8, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_2' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_SequencePlayer) == 0x001C08, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_1) == 0x001C80, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_LinkedInputPose) == 0x001CB0, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root) == 0x001D38, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, Pitch) == 0x001D68, "Member 'UHeldObjectLayerAnimBP_C::Pitch' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, Yaw) == 0x001D6C, "Member 'UHeldObjectLayerAnimBP_C::Yaw' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AimOffsetAlpha) == 0x001D70, "Member 'UHeldObjectLayerAnimBP_C::AimOffsetAlpha' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, IsHeldObjectDropped) == 0x001D74, "Member 'UHeldObjectLayerAnimBP_C::IsHeldObjectDropped' has a wrong offset!");

}

