#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HeroLoadoutPerkDetailRow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass HeroLoadoutPerkDetailRow.HeroLoadoutPerkDetailRow_C
// 0x01E8 (0x0470 - 0x0288)
class UHeroLoadoutPerkDetailRow_C final  : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0288(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_PerkIcon;                                   // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageLockPerk;                                     // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImagePerkIcon;                                     // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageTier;                                         // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  InfoSwitcher;                                      // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               LargeInfo;                                         // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       LargeName;                                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       LevelTextNew;                                      // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlayLockPerk;                                   // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               PerkIconSizeBox;                                   // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RichText_SmallDescription;                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Shadow;                                            // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           SmallInfo;                                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SmallName;                                         // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IncludeName;                                       // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IncludeDescription;                                // 0x0309(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ShouldDisplayAsIgnored;                            // 0x030A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57F1[0x5];                                     // 0x030B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 UnlockedDisplayNameTextStyle;                      // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 LockedDisplayNameTextStyle;                        // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 IgnoredDisplayNameTextStyle;                       // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortBrushSize                                Icon_Size;                                         // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57F2[0x7];                                     // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHero*                              Host_Hero;                                         // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortHeroLoadoutPerkType                      Perk_Type_To_Represent;                            // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_57F3[0x3];                                     // 0x0339(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         HoverAlphaValue;                                   // 0x033C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	float                                         HoverHorizontalOffset;                             // 0x0340(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57F4[0x4];                                     // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            LockedIcon;                                        // 0x0348(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateBrush                            WarningIcon;                                       // 0x03D0(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          ShouldDisplayWarning;                              // 0x0458(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57F5[0x7];                                     // 0x0459(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortTeamPerkItem*                      Team_Perk;                                         // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAbilityKit*                        Raw_Ability_Kit;                                   // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetRawAbilityKit(class UFortAbilityKit* Ability_Kit);
	void SetTeamPerk(class UFortTeamPerkItem* Param_Team_Perk);
	void PlayUnHover(class UUMGSequencePlayer* CallFunc_PlayAnimationReverse_ReturnValue);
	void PlayHover(class UUMGSequencePlayer* CallFunc_PlayAnimationForward_ReturnValue);
	void SetShouldDisplayWarning(bool InShouldDisplayWarning, bool CallFunc_NotEqual_BoolBool_ReturnValue);
	void UpdateLockedImage(bool Temp_bool_Variable, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, bool Temp_bool_Variable_1, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_IsPerkUnlocked_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, struct FSlateBrush& K2Node_Select_Default, ESlateVisibility K2Node_Select_Default_1);
	void PlayUnhoverCue(class UUMGSequencePlayer* CallFunc_PlayAnimationReverse_ReturnValue);
	void PlayHoverCue(class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue);
	void SetShouldDisplayAsIgnored(bool InShouldDisplayAsIgnored, bool CallFunc_NotEqual_BoolBool_ReturnValue);
	void SetPerkTypeToRepresent(EFortHeroLoadoutPerkType Perk_Type);
	bool IsPerkUnlocked(bool Temp_bool_Variable, EFortHeroLoadoutPerkType Temp_byte_Variable, bool CallFunc_IsCommanderPerkUnlockedForHero_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool K2Node_Select_Default);
	class UFortAbilityKit* GetPerkAbilityKit(class UFortItemDefinition* CallFunc_GetItemDefinitionBP_ReturnValue, bool CallFunc_IsValid_ReturnValue, class UFortTeamPerkItemDefinition* K2Node_DynamicCast_AsFort_Team_Perk_Item_Definition, bool K2Node_DynamicCast_bSuccess, class UFortAbilityKit* CallFunc_GetAbilityKitBP_ReturnValue, EFortHeroLoadoutPerkType Temp_byte_Variable, class UFortItemDefinition* CallFunc_GetItemDefinitionBP_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_1, class UFortHeroType* K2Node_DynamicCast_AsFort_Hero_Type, bool K2Node_DynamicCast_bSuccess_1, class UFortAbilityKit* CallFunc_GetAbilityKitForHeroPerk_ReturnValue, class UFortAbilityKit* CallFunc_GetAbilityKitForCommanderPerk_ReturnValue, class UFortAbilityKit* K2Node_Select_Default);
	void SetHero(class UFortHero* Hero);
	void UpdateTextStyles(float Temp_float_Variable, float Temp_float_Variable_1, bool Temp_bool_Variable, float Temp_float_Variable_2, float Temp_float_Variable_3, bool Temp_bool_Variable_1, float Temp_float_Variable_4, bool Temp_bool_Variable_2, float Temp_float_Variable_5, float Temp_float_Variable_6, bool Temp_bool_Variable_3, bool Temp_bool_Variable_4, bool CallFunc_IsPerkUnlocked_ReturnValue, bool CallFunc_IsPerkUnlocked_ReturnValue_1, float K2Node_Select_Default, float K2Node_Select_Default_1, bool Temp_bool_Variable_5, float K2Node_Select_Default_2, bool CallFunc_IsPerkUnlocked_ReturnValue_2, float K2Node_Select_Default_3, float CallFunc_Multiply_FloatFloat_ReturnValue, class UClass* K2Node_Select_Default_4, class UClass* K2Node_Select_Default_5);
	void UpdateFromState(bool CallFunc_IsValid_ReturnValue, class UFortItemDefinition* CallFunc_GetItemDefinitionBP_ReturnValue, class UFortTeamPerkItemDefinition* K2Node_DynamicCast_AsFort_Team_Perk_Item_Definition, bool K2Node_DynamicCast_bSuccess, bool CallFunc_HasProgressiveBonus_ReturnValue, class UFortAbilityKit* CallFunc_GetAbilityKitBP_ReturnValue, class FText CallFunc_MakeLiteralText_ReturnValue, class UFortAbilityKit* CallFunc_GetPerkAbilityKit_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, class UFortAbilityKit* CallFunc_GetPerkAbilityKit_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_2, class UFortAbilityKit* CallFunc_GetPerkAbilityKit_ReturnValue_2, bool CallFunc_IsValid_ReturnValue_3, class FText CallFunc_TextToUpper_ReturnValue, const struct FSlateBrush& CallFunc_NoResourceBrush_ReturnValue, const struct FSlateBrush& CallFunc_ResizeBrush_ResizedBrush, const struct FSlateBrush& CallFunc_ResizeBrush_ResizedBrush_1, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class UFortTooltipContext* CallFunc_SpawnTooltipContextWithSource_ReturnValue, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue_1, class UFortTooltipContext* CallFunc_SpawnTooltipContextWithSource_ReturnValue_1, bool Temp_bool_Variable, class UFortTooltipUIContext* CallFunc_GetContext_ReturnValue, class FText CallFunc_GetCombinedDescription_OutDescription, bool CallFunc_GetCombinedDescription_ReturnValue, class UObject* K2Node_Select_Default, bool Temp_bool_Variable_1, class UFortTooltipUIContext* CallFunc_GetContext_ReturnValue_1, class FText K2Node_Select_Default_1, class FText CallFunc_GetCombinedDescription_OutDescription_1, bool CallFunc_GetCombinedDescription_ReturnValue_1);
	void UpdateFromStyle(ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, bool Temp_bool_Variable, bool Temp_bool_Variable_1, class UWidget* K2Node_Select_Default, ESlateVisibility K2Node_Select_Default_1);
	void PreConstruct(bool IsDesignTime);
	void SetHoverAlphaValue(float NewValue);
	void SetHoverHorizontalOffset(float NewValue);
	void ExecuteUbergraph_HeroLoadoutPerkDetailRow(int32 EntryPoint, bool K2Node_Event_IsDesignTime, float K2Node_CustomEvent_NewValue_1, const class FString& CallFunc_GetEnumeratorUserFriendlyName_ReturnValue, class FText CallFunc_Conv_StringToText_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData, float K2Node_CustomEvent_NewValue, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array, class FText CallFunc_Format_ReturnValue, class FText CallFunc_TextToUpper_ReturnValue, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HeroLoadoutPerkDetailRow_C">();
	}
	static class UHeroLoadoutPerkDetailRow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHeroLoadoutPerkDetailRow_C>();
	}
};
static_assert(alignof(UHeroLoadoutPerkDetailRow_C) == 0x000008, "Wrong alinment on UHeroLoadoutPerkDetailRow_C");
static_assert(sizeof(UHeroLoadoutPerkDetailRow_C) == 0x000470, "Wrong size on UHeroLoadoutPerkDetailRow_C");
static_assert(offsetof(UHeroLoadoutPerkDetailRow_C, UberGraphFrame) == 0x000288, "Member 'UHeroLoadoutPerkDetailRow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UHeroLoadoutPerkDetailRow_C, Hover) == 0x000290, "Member 'UHeroLoadoutPerkDetailRow_C::Hover' has a wrong offset!");
static_assert(offsetof(UHeroLoadoutPerkDetailRow_C, Border_PerkIcon) == 0x000298, "Member 'UHeroLoadoutPerkDetailRow_C::Border_PerkIcon' has a wrong offset!");
static_assert(offsetof(UHeroLoadoutPerkDetailRow_C, ImageLockPerk) == 0x0002A0, "Member 'UHeroLoadoutPerkDetailRow_C::ImageLockPerk' has a wrong offset!");
static_assert(offsetof(UHeroLoadoutPerkDetailRow_C, ImagePerkIcon) == 0x0002A8, "Member 'UHeroLoadoutPerkDetailRow_C::ImagePerkIcon' has a wrong offset!");
static_assert(offsetof(UHeroLoadoutPerkDetailRow_C, ImageTier) == 0x0002B0, "Member 'UHeroLoadoutPerkDetailRow_C::ImageTier' has a wrong offset!");
static_assert(offsetof(UHeroLoadoutPerkDetailRow_C, InfoSwitcher) == 0x0002B8, "Member 'UHeroLoadoutPerkDetailRow_C::InfoSwitcher' has a wrong offset!");
static_assert(offsetof(UHeroLoadoutPerkDetailRow_C, LargeInfo) == 0x0002C0, "Member 'UHeroLoadoutPerkDetailRow_C::LargeInfo' has a wrong offset!");
static_assert(offsetof(UHeroLoadoutPerkDetailRow_C, LargeName) == 0x0002C8, "Member 'UHeroLoadoutPerkDetailRow_C::LargeName' has a wrong offset!");
static_assert(offsetof(UHeroLoadoutPerkDetailRow_C, LevelTextNew) == 0x0002D0, "Member 'UHeroLoadoutPerkDetailRow_C::LevelTextNew' has a wrong offset!");
static_assert(offsetof(UHeroLoadoutPerkDetailRow_C, OverlayLockPerk) == 0x0002D8, "Member 'UHeroLoadoutPerkDetailRow_C::OverlayLockPerk' has a wrong offset!");
static_assert(offsetof(UHeroLoadoutPerkDetailRow_C, PerkIconSizeBox) == 0x0002E0, "Member 'UHeroLoadoutPerkDetailRow_C::PerkIconSizeBox' has a wrong offset!");
static_assert(offsetof(UHeroLoadoutPerkDetailRow_C, RichText_SmallDescription) == 0x0002E8, "Member 'UHeroLoadoutPerkDetailRow_C::RichText_SmallDescription' has a wrong offset!");
static_assert(offsetof(UHeroLoadoutPerkDetailRow_C, Shadow) == 0x0002F0, "Member 'UHeroLoadoutPerkDetailRow_C::Shadow' has a wrong offset!");
static_assert(offsetof(UHeroLoadoutPerkDetailRow_C, SmallInfo) == 0x0002F8, "Member 'UHeroLoadoutPerkDetailRow_C::SmallInfo' has a wrong offset!");
static_assert(offsetof(UHeroLoadoutPerkDetailRow_C, SmallName) == 0x000300, "Member 'UHeroLoadoutPerkDetailRow_C::SmallName' has a wrong offset!");
static_assert(offsetof(UHeroLoadoutPerkDetailRow_C, IncludeName) == 0x000308, "Member 'UHeroLoadoutPerkDetailRow_C::IncludeName' has a wrong offset!");
static_assert(offsetof(UHeroLoadoutPerkDetailRow_C, IncludeDescription) == 0x000309, "Member 'UHeroLoadoutPerkDetailRow_C::IncludeDescription' has a wrong offset!");
static_assert(offsetof(UHeroLoadoutPerkDetailRow_C, ShouldDisplayAsIgnored) == 0x00030A, "Member 'UHeroLoadoutPerkDetailRow_C::ShouldDisplayAsIgnored' has a wrong offset!");
static_assert(offsetof(UHeroLoadoutPerkDetailRow_C, UnlockedDisplayNameTextStyle) == 0x000310, "Member 'UHeroLoadoutPerkDetailRow_C::UnlockedDisplayNameTextStyle' has a wrong offset!");
static_assert(offsetof(UHeroLoadoutPerkDetailRow_C, LockedDisplayNameTextStyle) == 0x000318, "Member 'UHeroLoadoutPerkDetailRow_C::LockedDisplayNameTextStyle' has a wrong offset!");
static_assert(offsetof(UHeroLoadoutPerkDetailRow_C, IgnoredDisplayNameTextStyle) == 0x000320, "Member 'UHeroLoadoutPerkDetailRow_C::IgnoredDisplayNameTextStyle' has a wrong offset!");
static_assert(offsetof(UHeroLoadoutPerkDetailRow_C, Icon_Size) == 0x000328, "Member 'UHeroLoadoutPerkDetailRow_C::Icon_Size' has a wrong offset!");
static_assert(offsetof(UHeroLoadoutPerkDetailRow_C, Host_Hero) == 0x000330, "Member 'UHeroLoadoutPerkDetailRow_C::Host_Hero' has a wrong offset!");
static_assert(offsetof(UHeroLoadoutPerkDetailRow_C, Perk_Type_To_Represent) == 0x000338, "Member 'UHeroLoadoutPerkDetailRow_C::Perk_Type_To_Represent' has a wrong offset!");
static_assert(offsetof(UHeroLoadoutPerkDetailRow_C, HoverAlphaValue) == 0x00033C, "Member 'UHeroLoadoutPerkDetailRow_C::HoverAlphaValue' has a wrong offset!");
static_assert(offsetof(UHeroLoadoutPerkDetailRow_C, HoverHorizontalOffset) == 0x000340, "Member 'UHeroLoadoutPerkDetailRow_C::HoverHorizontalOffset' has a wrong offset!");
static_assert(offsetof(UHeroLoadoutPerkDetailRow_C, LockedIcon) == 0x000348, "Member 'UHeroLoadoutPerkDetailRow_C::LockedIcon' has a wrong offset!");
static_assert(offsetof(UHeroLoadoutPerkDetailRow_C, WarningIcon) == 0x0003D0, "Member 'UHeroLoadoutPerkDetailRow_C::WarningIcon' has a wrong offset!");
static_assert(offsetof(UHeroLoadoutPerkDetailRow_C, ShouldDisplayWarning) == 0x000458, "Member 'UHeroLoadoutPerkDetailRow_C::ShouldDisplayWarning' has a wrong offset!");
static_assert(offsetof(UHeroLoadoutPerkDetailRow_C, Team_Perk) == 0x000460, "Member 'UHeroLoadoutPerkDetailRow_C::Team_Perk' has a wrong offset!");
static_assert(offsetof(UHeroLoadoutPerkDetailRow_C, Raw_Ability_Kit) == 0x000468, "Member 'UHeroLoadoutPerkDetailRow_C::Raw_Ability_Kit' has a wrong offset!");

}

