#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HUDLayoutToolFireModePanel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass HUDLayoutToolFireModePanel.HUDLayoutToolFireModePanel_C
// 0x00F0 (0x0598 - 0x04A8)
class UHUDLayoutToolFireModePanel_C final  : public UHUDLayoutToolFireModePanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ScreenTutorial;                                    // 0x04B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnOpen;                                            // 0x04B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         AutofireBox;                                       // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortCheckbox_C*                        AutofireCheckbox;                                  // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          ClickBlocker;                                      // 0x04D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  CommonWidgetSwitcher_0;                            // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      CustomButton;                                      // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               CustomOverlay;                                     // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         DedicatedButtonBox;                                // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortCheckbox_C*                        DedicatedButtonCheckbox;                           // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      DismissDialogue;                                   // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFireModeSelectTile_C*                  FireMode_AutoFire;                                 // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFireModeSelectTile_C*                  FireMode_FireButton;                               // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFireModeSelectTile_C*                  FireMode_TapToShoot;                               // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       FireModeOptionTutorialMessage;                     // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        ModeButtonSwitcher;                                // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               PresetOverlay;                                     // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      PresetsButton;                                     // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       PreviewDescriptionText;                            // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        SelectionTypeSwitcher;                             // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         TapAnywhereBox;                                    // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortCheckbox_C*                        TapAnywhereCheckbox;                               // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextDescription;                                   // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      TutorialConfirm;                                   // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UFireModeSelectTile_C*>          FireOptionTiles;                                   // 0x0570(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	class UFireModeSelectTile_C*                  CurSelectedTile;                                   // 0x0580(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           MoviePlayTimer;                                    // 0x0588(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UFireModeSelectTile_C*                  NextPanelToPlay;                                   // 0x0590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_HUDLayoutToolFireModePanel(int32 EntryPoint, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, class UFireModeSelectTile_C* K2Node_CustomEvent_Tile_2, class FText CallFunc_GetFireModeDescription_ReturnValue, bool Temp_bool_Variable, class UFireModeSelectTile_C* K2Node_CustomEvent_Tile_1, bool K2Node_Event_bNewOpenState, TArray<class UHUDLayoutToolFireModeButton*>& K2Node_MakeArray_Array, bool CallFunc_IsValid_ReturnValue, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue, class UCommonButton* K2Node_ComponentBoundEvent_Button_3, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue_1, class UCommonButton* K2Node_ComponentBoundEvent_Button_2, TDelegate<void(EFireModeType NewFireMode)> K2Node_CreateDelegate_OutputDelegate, class UHUDLayoutToolContext* CallFunc_GetContext_ReturnValue, ESlateVisibility Temp_byte_Variable_2, class UHUDLayoutToolContext* CallFunc_GetContext_ReturnValue_1, class UCommonButton* K2Node_ComponentBoundEvent_Button_1, class UCommonButton* K2Node_ComponentBoundEvent_Button, bool CallFunc_IsInCustomMode_IsCustom, bool CallFunc_IsInCustomMode_IsCustom_1, ESlateVisibility Temp_byte_Variable_3, EFireModeType K2Node_CustomEvent_NewFireMode, bool CallFunc_IsInCustomMode_IsCustom_2, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue, bool CallFunc_HasSelectedCustomMode_Value, ESlateVisibility K2Node_Select_Default, bool CallFunc_BooleanOR_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue_2, class UFireModeSelectTile_C* K2Node_CustomEvent_Tile, bool CallFunc_EqualEqual_ObjectObject_ReturnValue, bool Temp_bool_Variable_1, ESlateVisibility K2Node_Select_Default_1, class UFortRuntimeOptions* CallFunc_GetRuntimeOptions_ReturnValue);
	void Destruct();
	void DeselectTile(class UFireModeSelectTile_C* Tile);
	void UpdateSelectButtonVisibility();
	void BndEvt__3DTouchCheckbox_K2Node_ComponentBoundEvent_9_OnClicked__DelegateSignature();
	void BndEvt__DedicatedButtonCheckbox_K2Node_ComponentBoundEvent_8_OnClicked__DelegateSignature();
	void BndEvt__TapAnywhereCheckbox_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature();
	void BndEvt__AutofireCheckbox_K2Node_ComponentBoundEvent_6_OnClicked__DelegateSignature();
	void OnFire_Mode_Changed(EFireModeType NewFireMode);
	void BndEvt__PresetsButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__CustomButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void Construct();
	void BndEvt__TutorialConfirm_K2Node_ComponentBoundEvent_185_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__IconTextButton_K2Node_ComponentBoundEvent_84_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void SetOpenState(bool bNewOpenState);
	void NewTileSelected(class UFireModeSelectTile_C* Tile);
	void HandleTileButtonFocused(class UFireModeSelectTile_C* Tile);
	void PlayCurFocusedTileMovie(class UFireModeSelectTile_C* CurFocusedTile, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, bool CallFunc_K2_IsValidTimerHandle_ReturnValue, class UHUDLayoutToolFireModeButton* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, class UFireModeSelectTile_C* K2Node_DynamicCast_AsFire_Mode_Select_Tile, bool K2Node_DynamicCast_bSuccess, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_EqualEqual_ObjectObject_ReturnValue);
	void InitializeSelection();
	void HandleCurSelectedTile(class UFireModeSelectTile_C* Tile, bool CallFunc_EqualEqual_ObjectObject_ReturnValue, bool CallFunc_IsValid_ReturnValue);
	void InitButtonBindings(TArray<class UHUDLayoutToolFireModeButton*>& ArrayOfFireModeButtons, int32 CallFunc_Array_Length_ReturnValue, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, class UHUDLayoutToolFireModeButton* CallFunc_Array_Get_Item, class UFireModeSelectTile_C* K2Node_DynamicCast_AsFire_Mode_Select_Tile, bool K2Node_DynamicCast_bSuccess, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, TDelegate<void(class UFireModeSelectTile_C* Tile)> K2Node_CreateDelegate_OutputDelegate, TDelegate<void(class UFireModeSelectTile_C* Tile)> K2Node_CreateDelegate_OutputDelegate_1, TDelegate<void(class UFireModeSelectTile_C* Tile)> K2Node_CreateDelegate_OutputDelegate_2);
	struct FEventReply OnMouseButtonDown_0(const struct FGeometry& MyGeometry, struct FPointerEvent& MouseEvent, const struct FEventReply& CallFunc_Handled_ReturnValue);
	void SetCustomModeVisibilities(ESlateVisibility Temp_byte_Variable, class UHUDLayoutToolContext* CallFunc_GetContext_ReturnValue, bool CallFunc_IsFireModeAvailable_ReturnValue, bool Temp_bool_Variable, ESlateVisibility Temp_byte_Variable_1, ESlateVisibility Temp_byte_Variable_2, class UHUDLayoutToolContext* CallFunc_GetContext_ReturnValue_1, bool CallFunc_IsFireModeAvailable_ReturnValue_1, ESlateVisibility K2Node_Select_Default, bool Temp_bool_Variable_1, ESlateVisibility Temp_byte_Variable_3, ESlateVisibility Temp_byte_Variable_4, bool CallFunc_HasSelectedCustomMode_Value, ESlateVisibility K2Node_Select_Default_1, ESlateVisibility Temp_byte_Variable_5, bool Temp_bool_Variable_2, class UHUDLayoutToolContext* CallFunc_GetContext_ReturnValue_2, class UHUDLayoutToolContext* CallFunc_GetContext_ReturnValue_3, bool CallFunc_IsFireModeAvailable_ReturnValue_2, EFireModeType CallFunc_GetFireMode_FireMode, bool CallFunc_GetFireMode_bAutofireEnabled, bool CallFunc_GetFireMode_bTapToShootEnabled, bool CallFunc_GetFireMode_bAlwaysShowDedicatedButton, ESlateVisibility K2Node_Select_Default_2);
	void SetCustomFireMode(class UHUDLayoutToolContext* CallFunc_GetContext_ReturnValue, bool CallFunc_BooleanOR_ReturnValue, bool CallFunc_BooleanOR_ReturnValue_1);
	void HasSelectedCustomMode(bool* Value, class UHUDLayoutToolContext* CallFunc_GetContext_ReturnValue, EFireModeType CallFunc_GetFireMode_FireMode, bool CallFunc_GetFireMode_bAutofireEnabled, bool CallFunc_GetFireMode_bTapToShootEnabled, bool CallFunc_GetFireMode_bAlwaysShowDedicatedButton, bool CallFunc_BooleanOR_ReturnValue, bool CallFunc_BooleanOR_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue_2);
	void PlayTileMovie();

	void IsInCustomMode(bool* IsCustom, class UWidget* CallFunc_GetActiveWidget_ReturnValue, bool CallFunc_EqualEqual_ObjectObject_ReturnValue) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HUDLayoutToolFireModePanel_C">();
	}
	static class UHUDLayoutToolFireModePanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHUDLayoutToolFireModePanel_C>();
	}
};
static_assert(alignof(UHUDLayoutToolFireModePanel_C) == 0x000008, "Wrong alinment on UHUDLayoutToolFireModePanel_C");
static_assert(sizeof(UHUDLayoutToolFireModePanel_C) == 0x000598, "Wrong size on UHUDLayoutToolFireModePanel_C");
static_assert(offsetof(UHUDLayoutToolFireModePanel_C, UberGraphFrame) == 0x0004A8, "Member 'UHUDLayoutToolFireModePanel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolFireModePanel_C, ScreenTutorial) == 0x0004B0, "Member 'UHUDLayoutToolFireModePanel_C::ScreenTutorial' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolFireModePanel_C, OnOpen) == 0x0004B8, "Member 'UHUDLayoutToolFireModePanel_C::OnOpen' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolFireModePanel_C, AutofireBox) == 0x0004C0, "Member 'UHUDLayoutToolFireModePanel_C::AutofireBox' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolFireModePanel_C, AutofireCheckbox) == 0x0004C8, "Member 'UHUDLayoutToolFireModePanel_C::AutofireCheckbox' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolFireModePanel_C, ClickBlocker) == 0x0004D0, "Member 'UHUDLayoutToolFireModePanel_C::ClickBlocker' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolFireModePanel_C, CommonWidgetSwitcher_0) == 0x0004D8, "Member 'UHUDLayoutToolFireModePanel_C::CommonWidgetSwitcher_0' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolFireModePanel_C, CustomButton) == 0x0004E0, "Member 'UHUDLayoutToolFireModePanel_C::CustomButton' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolFireModePanel_C, CustomOverlay) == 0x0004E8, "Member 'UHUDLayoutToolFireModePanel_C::CustomOverlay' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolFireModePanel_C, DedicatedButtonBox) == 0x0004F0, "Member 'UHUDLayoutToolFireModePanel_C::DedicatedButtonBox' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolFireModePanel_C, DedicatedButtonCheckbox) == 0x0004F8, "Member 'UHUDLayoutToolFireModePanel_C::DedicatedButtonCheckbox' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolFireModePanel_C, DismissDialogue) == 0x000500, "Member 'UHUDLayoutToolFireModePanel_C::DismissDialogue' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolFireModePanel_C, FireMode_AutoFire) == 0x000508, "Member 'UHUDLayoutToolFireModePanel_C::FireMode_AutoFire' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolFireModePanel_C, FireMode_FireButton) == 0x000510, "Member 'UHUDLayoutToolFireModePanel_C::FireMode_FireButton' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolFireModePanel_C, FireMode_TapToShoot) == 0x000518, "Member 'UHUDLayoutToolFireModePanel_C::FireMode_TapToShoot' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolFireModePanel_C, FireModeOptionTutorialMessage) == 0x000520, "Member 'UHUDLayoutToolFireModePanel_C::FireModeOptionTutorialMessage' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolFireModePanel_C, ModeButtonSwitcher) == 0x000528, "Member 'UHUDLayoutToolFireModePanel_C::ModeButtonSwitcher' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolFireModePanel_C, PresetOverlay) == 0x000530, "Member 'UHUDLayoutToolFireModePanel_C::PresetOverlay' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolFireModePanel_C, PresetsButton) == 0x000538, "Member 'UHUDLayoutToolFireModePanel_C::PresetsButton' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolFireModePanel_C, PreviewDescriptionText) == 0x000540, "Member 'UHUDLayoutToolFireModePanel_C::PreviewDescriptionText' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolFireModePanel_C, SelectionTypeSwitcher) == 0x000548, "Member 'UHUDLayoutToolFireModePanel_C::SelectionTypeSwitcher' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolFireModePanel_C, TapAnywhereBox) == 0x000550, "Member 'UHUDLayoutToolFireModePanel_C::TapAnywhereBox' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolFireModePanel_C, TapAnywhereCheckbox) == 0x000558, "Member 'UHUDLayoutToolFireModePanel_C::TapAnywhereCheckbox' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolFireModePanel_C, TextDescription) == 0x000560, "Member 'UHUDLayoutToolFireModePanel_C::TextDescription' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolFireModePanel_C, TutorialConfirm) == 0x000568, "Member 'UHUDLayoutToolFireModePanel_C::TutorialConfirm' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolFireModePanel_C, FireOptionTiles) == 0x000570, "Member 'UHUDLayoutToolFireModePanel_C::FireOptionTiles' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolFireModePanel_C, CurSelectedTile) == 0x000580, "Member 'UHUDLayoutToolFireModePanel_C::CurSelectedTile' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolFireModePanel_C, MoviePlayTimer) == 0x000588, "Member 'UHUDLayoutToolFireModePanel_C::MoviePlayTimer' has a wrong offset!");
static_assert(offsetof(UHUDLayoutToolFireModePanel_C, NextPanelToPlay) == 0x000590, "Member 'UHUDLayoutToolFireModePanel_C::NextPanelToPlay' has a wrong offset!");

}

