#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemShopPipButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ItemShopPipButton.ItemShopPipButton_C
// 0x0028 (0x0BF0 - 0x0BC8)
class UItemShopPipButton_C final  : public UFortTextButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BC8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x0BD0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Selected;                                          // 0x0BD8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BacchusMobileShadow;                               // 0x0BE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PIP;                                               // 0x0BE8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void BP_OnSelected();
	void BP_OnDeselected();
	void ExecuteUbergraph_ItemShopPipButton(int32 EntryPoint, bool Temp_bool_Variable, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, bool K2Node_Event_IsDesignTime, class UUMGSequencePlayer* CallFunc_PlayAnimationReverse_ReturnValue, class UUMGSequencePlayer* CallFunc_PlayAnimationForward_ReturnValue, class UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue, bool CallFunc_IsMobileGame_ReturnValue, class UFortRuntimeOptions* CallFunc_GetRuntimeOptions_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, ESlateVisibility K2Node_Select_Default);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ItemShopPipButton_C">();
	}
	static class UItemShopPipButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemShopPipButton_C>();
	}
};
static_assert(alignof(UItemShopPipButton_C) == 0x000008, "Wrong alinment on UItemShopPipButton_C");
static_assert(sizeof(UItemShopPipButton_C) == 0x000BF0, "Wrong size on UItemShopPipButton_C");
static_assert(offsetof(UItemShopPipButton_C, UberGraphFrame) == 0x000BC8, "Member 'UItemShopPipButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UItemShopPipButton_C, Hover) == 0x000BD0, "Member 'UItemShopPipButton_C::Hover' has a wrong offset!");
static_assert(offsetof(UItemShopPipButton_C, Selected) == 0x000BD8, "Member 'UItemShopPipButton_C::Selected' has a wrong offset!");
static_assert(offsetof(UItemShopPipButton_C, BacchusMobileShadow) == 0x000BE0, "Member 'UItemShopPipButton_C::BacchusMobileShadow' has a wrong offset!");
static_assert(offsetof(UItemShopPipButton_C, PIP) == 0x000BE8, "Member 'UItemShopPipButton_C::PIP' has a wrong offset!");

}

