#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemDetailsHeaderRarityTypeText

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ItemDetailsHeaderRarityTypeText.ItemDetailsHeaderRarityTypeText_C
// 0x0018 (0x02F8 - 0x02E0)
class UItemDetailsHeaderRarityTypeText_C final  : public UFortItemDetailElementWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       RarityTextBlock;                                   // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TypeTextBlock;                                     // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void HandlePostDifferentItemToDetailSet();
	void HandlePostDifferentItemToCompareWithSet();
	void HandleItemToDetailChangedBP();
	void ExecuteUbergraph_ItemDetailsHeaderRarityTypeText(int32 EntryPoint, class UFortItemDefinition* CallFunc_GetSchematicCraftingResultBP_ReturnValue, class UFortWeaponItemDefinition* K2Node_DynamicCast_AsFort_Weapon_Item_Definition, bool K2Node_DynamicCast_bSuccess, bool CallFunc_IsValid_ReturnValue, EFortRarity CallFunc_GetRarityCosmeticForItem_ReturnValue, const struct FFortRarityItemData& CallFunc_BPGetRarityData_ReturnValue, class FText CallFunc_GetItemTypeName_ReturnValue, const struct FSlateColor& K2Node_MakeStruct_SlateColor, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array, const struct FSlateColor& K2Node_MakeStruct_SlateColor_1, class FText CallFunc_Format_ReturnValue, const struct FSlateColor& K2Node_MakeStruct_SlateColor_2);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ItemDetailsHeaderRarityTypeText_C">();
	}
	static class UItemDetailsHeaderRarityTypeText_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemDetailsHeaderRarityTypeText_C>();
	}
};
static_assert(alignof(UItemDetailsHeaderRarityTypeText_C) == 0x000008, "Wrong alinment on UItemDetailsHeaderRarityTypeText_C");
static_assert(sizeof(UItemDetailsHeaderRarityTypeText_C) == 0x0002F8, "Wrong size on UItemDetailsHeaderRarityTypeText_C");
static_assert(offsetof(UItemDetailsHeaderRarityTypeText_C, UberGraphFrame) == 0x0002E0, "Member 'UItemDetailsHeaderRarityTypeText_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UItemDetailsHeaderRarityTypeText_C, RarityTextBlock) == 0x0002E8, "Member 'UItemDetailsHeaderRarityTypeText_C::RarityTextBlock' has a wrong offset!");
static_assert(offsetof(UItemDetailsHeaderRarityTypeText_C, TypeTextBlock) == 0x0002F0, "Member 'UItemDetailsHeaderRarityTypeText_C::TypeTextBlock' has a wrong offset!");

}

