#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemShopNavigationButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ItemShopNavigationButton.ItemShopNavigationButton_C
// 0x0050 (0x0C00 - 0x0BB0)
class UItemShopNavigationButton_C final  : public UAthenaItemShopNavigationButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BB0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOutBacking;                                    // 0x0BB8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Translate_Bottom;                                  // 0x0BC0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Translate_Top;                                     // 0x0BC8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x0BD0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Backing;                                           // 0x0BD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                BorderButton;                                      // 0x0BE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                GridBoundBorder;                                   // 0x0BE8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Arrow;                                         // 0x0BF0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bFlipArrow;                                        // 0x0BF8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          bIsTop;                                            // 0x0BF9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void PreConstruct(bool IsDesignTime);
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_ItemShopNavigationButton(int32 EntryPoint, class UMaterialInterface* Temp_object_Variable, class UMaterialInterface* Temp_object_Variable_1, bool Temp_bool_Variable, class UMaterialInterface* Temp_object_Variable_2, class UMaterialInterface* Temp_object_Variable_3, bool Temp_bool_Variable_1, const struct FVector2D& Temp_struct_Variable, const struct FVector2D& Temp_struct_Variable_1, bool Temp_bool_Variable_2, bool Temp_bool_Variable_3, const struct FVector2D& Temp_struct_Variable_2, const struct FVector2D& Temp_struct_Variable_3, bool Temp_bool_Variable_4, EVerticalAlignment Temp_byte_Variable, EVerticalAlignment Temp_byte_Variable_1, EVerticalAlignment K2Node_Select_Default, bool K2Node_Event_IsDesignTime, class UMaterialInterface* K2Node_Select_Default_1, const struct FVector2D& K2Node_Select_Default_2, class UUMGSequencePlayer* CallFunc_PlayAnimationReverse_ReturnValue, class UUMGSequencePlayer* CallFunc_PlayAnimationForward_ReturnValue, bool Temp_bool_Variable_5, class UMaterialInterface* K2Node_Select_Default_3, class UWidgetAnimation* K2Node_Select_Default_4, class UUMGSequencePlayer* CallFunc_PlayAnimationReverse_ReturnValue_1, const struct FVector2D& K2Node_Select_Default_5, class UUMGSequencePlayer* CallFunc_PlayAnimationForward_ReturnValue_1, class UUMGSequencePlayer* CallFunc_PlayAnimationReverse_ReturnValue_2, class UUMGSequencePlayer* CallFunc_PlayAnimationForward_ReturnValue_2);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ItemShopNavigationButton_C">();
	}
	static class UItemShopNavigationButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemShopNavigationButton_C>();
	}
};
static_assert(alignof(UItemShopNavigationButton_C) == 0x000008, "Wrong alinment on UItemShopNavigationButton_C");
static_assert(sizeof(UItemShopNavigationButton_C) == 0x000C00, "Wrong size on UItemShopNavigationButton_C");
static_assert(offsetof(UItemShopNavigationButton_C, UberGraphFrame) == 0x000BB0, "Member 'UItemShopNavigationButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UItemShopNavigationButton_C, FadeOutBacking) == 0x000BB8, "Member 'UItemShopNavigationButton_C::FadeOutBacking' has a wrong offset!");
static_assert(offsetof(UItemShopNavigationButton_C, Translate_Bottom) == 0x000BC0, "Member 'UItemShopNavigationButton_C::Translate_Bottom' has a wrong offset!");
static_assert(offsetof(UItemShopNavigationButton_C, Translate_Top) == 0x000BC8, "Member 'UItemShopNavigationButton_C::Translate_Top' has a wrong offset!");
static_assert(offsetof(UItemShopNavigationButton_C, Hover) == 0x000BD0, "Member 'UItemShopNavigationButton_C::Hover' has a wrong offset!");
static_assert(offsetof(UItemShopNavigationButton_C, Backing) == 0x000BD8, "Member 'UItemShopNavigationButton_C::Backing' has a wrong offset!");
static_assert(offsetof(UItemShopNavigationButton_C, BorderButton) == 0x000BE0, "Member 'UItemShopNavigationButton_C::BorderButton' has a wrong offset!");
static_assert(offsetof(UItemShopNavigationButton_C, GridBoundBorder) == 0x000BE8, "Member 'UItemShopNavigationButton_C::GridBoundBorder' has a wrong offset!");
static_assert(offsetof(UItemShopNavigationButton_C, IMG_Arrow) == 0x000BF0, "Member 'UItemShopNavigationButton_C::IMG_Arrow' has a wrong offset!");
static_assert(offsetof(UItemShopNavigationButton_C, bFlipArrow) == 0x000BF8, "Member 'UItemShopNavigationButton_C::bFlipArrow' has a wrong offset!");
static_assert(offsetof(UItemShopNavigationButton_C, bIsTop) == 0x000BF9, "Member 'UItemShopNavigationButton_C::bIsTop' has a wrong offset!");

}

