#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemCalledOutAttributesDetailWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ItemCalledOutAttributesDetailWidget.ItemCalledOutAttributesDetailWidget_C
// 0x0028 (0x0308 - 0x02E0)
class UItemCalledOutAttributesDetailWidget_C final  : public UFortItemDetailElementWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortItemCategoryIndicator*             AmmoTypeIndicator;                                 // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                               ContainerWrapBox;                                  // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UStatsListItemWIdget_C*>         StatWidgets;                                       // 0x02F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)

public:
	void Clear_Stats(int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, class UStatsListItemWIdget_C* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue);
	void UpdateStats(int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable_1, int32 CallFunc_Add_IntInt_ReturnValue_1, bool CallFunc_IsValid_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, const struct FMargin& K2Node_MakeStruct_Margin, int32 Temp_int_Array_Index_Variable_1, class UStatsListItemWIdget_C* CallFunc_Array_Get_Item, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, TArray<struct FFortDisplayAttribute>& CallFunc_GetDisplayAttributesToCallOut_Attributes, class UStatsListItemWIdget_C* CallFunc_Create_ReturnValue, const struct FFortDisplayAttribute& CallFunc_Array_Get_Item_1, class UWrapBoxSlot* CallFunc_AddChildToWrapBox_ReturnValue, int32 CallFunc_Array_Add_ReturnValue, const struct FFortDisplayAttribute& CallFunc_Array_Get_Item_2, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_2, bool CallFunc_Less_IntInt_ReturnValue_1, int32 CallFunc_Array_Length_ReturnValue_3, bool CallFunc_EqualEqual_IntInt_ReturnValue);
	void GetDisplayAttributesToCallOut(TArray<struct FFortDisplayAttribute>* Attributes, const TArray<struct FGameplayTag>& Tokens, const TArray<struct FFortDisplayAttribute>& Results, TArray<struct FGameplayTag>& K2Node_MakeArray_Array, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable, TArray<struct FGameplayTag>& K2Node_MakeArray_Array_1, TArray<struct FGameplayTag>& K2Node_MakeArray_Array_2, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class AFortPlayerController* K2Node_DynamicCast_AsFort_Player_Controller, bool K2Node_DynamicCast_bSuccess, const struct FUniqueNetIdRepl& CallFunc_GetGameAccountId_ReturnValue, const struct FGameplayTag& CallFunc_Array_Get_Item, class UFortTooltipContext* CallFunc_SpawnTooltipContextWithNetID_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_1, int32 Temp_int_Loop_Counter_Variable, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, class UFortTooltipUIContext* CallFunc_GetContext_ReturnValue, bool Temp_bool_Variable, const struct FFortDisplayAttribute& CallFunc_GetTooltipStat_OutDisplayAttribute, bool CallFunc_GetTooltipStat_ReturnValue, class UFortItemDefinition* CallFunc_GetSchematicCraftingResultBP_ReturnValue, EFortItemType CallFunc_GetSchematicResultType_ReturnValue, bool CallFunc_IsValid_ReturnValue, EFortItemType CallFunc_GetType_ReturnValue, int32 CallFunc_Array_Add_ReturnValue, EFortItemType K2Node_Select_Default, bool K2Node_SwitchEnum_CmpSuccess);
	void HandlePostDifferentItemToDetailSet();
	void HandleItemToDetailChangedBP();
	void ExecuteUbergraph_ItemCalledOutAttributesDetailWidget(int32 EntryPoint, ESlateVisibility Temp_byte_Variable, bool Temp_bool_Variable, ESlateVisibility Temp_byte_Variable_1, bool CallFunc_IsValid_ReturnValue, EFortItemType CallFunc_GetSchematicResultType_ReturnValue, EFortItemType CallFunc_GetType_ReturnValue, class UFortItemDefinition* CallFunc_GetSchematicCraftingResultBP_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, EFortItemType K2Node_Select_Default, TArray<EFortItemType>& K2Node_MakeArray_Array, bool Temp_bool_Variable_1, bool CallFunc_Array_Contains_ReturnValue, ESlateVisibility K2Node_Select_Default_1);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ItemCalledOutAttributesDetailWidget_C">();
	}
	static class UItemCalledOutAttributesDetailWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemCalledOutAttributesDetailWidget_C>();
	}
};
static_assert(alignof(UItemCalledOutAttributesDetailWidget_C) == 0x000008, "Wrong alinment on UItemCalledOutAttributesDetailWidget_C");
static_assert(sizeof(UItemCalledOutAttributesDetailWidget_C) == 0x000308, "Wrong size on UItemCalledOutAttributesDetailWidget_C");
static_assert(offsetof(UItemCalledOutAttributesDetailWidget_C, UberGraphFrame) == 0x0002E0, "Member 'UItemCalledOutAttributesDetailWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UItemCalledOutAttributesDetailWidget_C, AmmoTypeIndicator) == 0x0002E8, "Member 'UItemCalledOutAttributesDetailWidget_C::AmmoTypeIndicator' has a wrong offset!");
static_assert(offsetof(UItemCalledOutAttributesDetailWidget_C, ContainerWrapBox) == 0x0002F0, "Member 'UItemCalledOutAttributesDetailWidget_C::ContainerWrapBox' has a wrong offset!");
static_assert(offsetof(UItemCalledOutAttributesDetailWidget_C, StatWidgets) == 0x0002F8, "Member 'UItemCalledOutAttributesDetailWidget_C::StatWidgets' has a wrong offset!");

}

