#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LandscapeWaterInfo

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass LandscapeWaterInfo.LandscapeWaterInfo_C
// 0x0070 (0x0290 - 0x0220)
class ALandscapeWaterInfo_C final  : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Flood_Water_Level;                                 // 0x0230(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E33[0x4];                                     // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Game_TextureMinus_Water_Velocity_and_Height;       // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             LS_Transform;                                      // 0x0240(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	struct FIntPoint                              LS_RT_Res;                                         // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Quad_Size;                                         // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Use_Terrain_Velocity_and_Height_Texture;           // 0x0280(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E34[0x7];                                     // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               External_Water_MID_To_Update;                      // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_LandscapeWaterInfo(int32 EntryPoint, bool CallFunc_IsValid_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, float CallFunc_GetScalarParameterValue_ReturnValue, float CallFunc_Conv_BoolToFloat_ReturnValue, EEndPlayReason K2Node_Event_EndPlayReason, class UWaterSubsystem* CallFunc_GetWorldSubsystem_ReturnValue);
	void Set_Flood_Water_Level();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveBeginPlay();
	void UserConstructionScript(const class FString& CallFunc_Concat_StrStr_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue_1, float CallFunc_GetScalarParameterValue_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue_2, const class FString& CallFunc_Conv_FloatToString_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue_3, const class FString& CallFunc_GetDisplayName_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue_4, bool CallFunc_IsValid_ReturnValue, const class FString& CallFunc_Conv_BoolToString_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue_5, float CallFunc_Conv_BoolToFloat_ReturnValue);
	void Set_Water_MPC_Values(const struct FVector& CallFunc_BreakTransform_Location, const struct FRotator& CallFunc_BreakTransform_Rotation, const struct FVector& CallFunc_BreakTransform_Scale, const struct FVector& CallFunc_BreakTransform_Location_1, const struct FRotator& CallFunc_BreakTransform_Rotation_1, const struct FVector& CallFunc_BreakTransform_Scale_1, float CallFunc_BreakVector_X, float CallFunc_BreakVector_Y, float CallFunc_BreakVector_Z, float CallFunc_BreakVector_X_1, float CallFunc_BreakVector_Y_1, float CallFunc_BreakVector_Z_1, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue, const struct FVector& CallFunc_MakeVector_ReturnValue, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue, const struct FLinearColor& CallFunc_Conv_VectorToLinearColor_ReturnValue, float CallFunc_Conv_IntToFloat_ReturnValue, float CallFunc_Conv_IntToFloat_ReturnValue_1, const struct FVector& CallFunc_BreakTransform_Location_2, const struct FRotator& CallFunc_BreakTransform_Rotation_2, const struct FVector& CallFunc_BreakTransform_Scale_2, const struct FVector& CallFunc_BreakTransform_Location_3, const struct FRotator& CallFunc_BreakTransform_Rotation_3, const struct FVector& CallFunc_BreakTransform_Scale_3, float CallFunc_BreakVector_X_2, float CallFunc_BreakVector_Y_2, float CallFunc_BreakVector_Z_2, float CallFunc_BreakVector_X_3, float CallFunc_BreakVector_Y_3, float CallFunc_BreakVector_Z_3, float CallFunc_Multiply_FloatFloat_ReturnValue, float CallFunc_Divide_FloatFloat_ReturnValue, float CallFunc_Multiply_FloatFloat_ReturnValue_1, const struct FVector& CallFunc_MakeVector_ReturnValue_1, float CallFunc_BreakVector_X_4, float CallFunc_BreakVector_Y_4, float CallFunc_BreakVector_Z_4, const struct FLinearColor& CallFunc_Conv_VectorToLinearColor_ReturnValue_1, const struct FLinearColor& CallFunc_Conv_VectorToLinearColor_ReturnValue_2);
	void Update_Water_MID(class UTexture* Texture, bool CallFunc_IsValid_ReturnValue);
	void UpdateGameTexture(TArray<class AWaterMeshActor*>& CallFunc_GetAllActorsOfClass_OutActors, int32 CallFunc_Array_LastIndex_ReturnValue, class AWaterMeshActor* CallFunc_Array_Get_Item, bool CallFunc_GreaterEqual_IntInt_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LandscapeWaterInfo_C">();
	}
	static class ALandscapeWaterInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALandscapeWaterInfo_C>();
	}
};
static_assert(alignof(ALandscapeWaterInfo_C) == 0x000010, "Wrong alinment on ALandscapeWaterInfo_C");
static_assert(sizeof(ALandscapeWaterInfo_C) == 0x000290, "Wrong size on ALandscapeWaterInfo_C");
static_assert(offsetof(ALandscapeWaterInfo_C, UberGraphFrame) == 0x000220, "Member 'ALandscapeWaterInfo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ALandscapeWaterInfo_C, DefaultSceneRoot) == 0x000228, "Member 'ALandscapeWaterInfo_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ALandscapeWaterInfo_C, Flood_Water_Level) == 0x000230, "Member 'ALandscapeWaterInfo_C::Flood_Water_Level' has a wrong offset!");
static_assert(offsetof(ALandscapeWaterInfo_C, Game_TextureMinus_Water_Velocity_and_Height) == 0x000238, "Member 'ALandscapeWaterInfo_C::Game_TextureMinus_Water_Velocity_and_Height' has a wrong offset!");
static_assert(offsetof(ALandscapeWaterInfo_C, LS_Transform) == 0x000240, "Member 'ALandscapeWaterInfo_C::LS_Transform' has a wrong offset!");
static_assert(offsetof(ALandscapeWaterInfo_C, LS_RT_Res) == 0x000270, "Member 'ALandscapeWaterInfo_C::LS_RT_Res' has a wrong offset!");
static_assert(offsetof(ALandscapeWaterInfo_C, Quad_Size) == 0x000278, "Member 'ALandscapeWaterInfo_C::Quad_Size' has a wrong offset!");
static_assert(offsetof(ALandscapeWaterInfo_C, Use_Terrain_Velocity_and_Height_Texture) == 0x000280, "Member 'ALandscapeWaterInfo_C::Use_Terrain_Velocity_and_Height_Texture' has a wrong offset!");
static_assert(offsetof(ALandscapeWaterInfo_C, External_Water_MID_To_Update) == 0x000288, "Member 'ALandscapeWaterInfo_C::External_Water_MID_To_Update' has a wrong offset!");

}

