#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LiveStreamVoice

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class LiveStreamVoice.LiveStreamVoiceChannel
// 0x0010 (0x0078 - 0x0068)
class ULiveStreamVoiceChannel final  : public UChannel
{
public:
	uint8                                         Pad_4BB6[0x10];                                    // 0x0068(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LiveStreamVoiceChannel">();
	}
	static class ULiveStreamVoiceChannel* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULiveStreamVoiceChannel>();
	}
};
static_assert(alignof(ULiveStreamVoiceChannel) == 0x000008, "Wrong alinment on ULiveStreamVoiceChannel");
static_assert(sizeof(ULiveStreamVoiceChannel) == 0x000078, "Wrong size on ULiveStreamVoiceChannel");

// Class LiveStreamVoice.LiveStreamVoiceSubsystem
// 0x0030 (0x0060 - 0x0030)
class ULiveStreamVoiceSubsystem final  : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_4BB7[0x8];                                     // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVoiceSettings                         PlaybackSettings;                                  // 0x0038(0x0018)(NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4BB8[0x10];                                    // 0x0050(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClearVoiceSettings();
	void EnableLocalVoiceProcessing(uint8 LocalUserNum, bool bEnable);
	void SetVoiceSettings(struct FVoiceSettings& InSettings);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LiveStreamVoiceSubsystem">();
	}
	static class ULiveStreamVoiceSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULiveStreamVoiceSubsystem>();
	}
};
static_assert(alignof(ULiveStreamVoiceSubsystem) == 0x000008, "Wrong alinment on ULiveStreamVoiceSubsystem");
static_assert(sizeof(ULiveStreamVoiceSubsystem) == 0x000060, "Wrong size on ULiveStreamVoiceSubsystem");
static_assert(offsetof(ULiveStreamVoiceSubsystem, PlaybackSettings) == 0x000038, "Member 'ULiveStreamVoiceSubsystem::PlaybackSettings' has a wrong offset!");

}

