#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_MED_HighTower_Radish_Pet_PostProcess_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass M_MED_HighTower_Radish_Pet_PostProcess_AnimBP.M_MED_HighTower_Radish_Pet_PostProcess_AnimBP_C
// 0x1550 (0x1B30 - 0x05E0)
class UM_MED_HighTower_Radish_Pet_PostProcess_AnimBP_C final  : public UFortPetAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimInstanceSubsystemData             AnimBlueprintClassSubsystem_PropertyAccess;        // 0x05E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DF3[0x7];                                     // 0x05E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x05F0(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0620(0x0088)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x06A8(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x06C8(0x0020)()
	uint8                                         Pad_6DF4[0x8];                                     // 0x06E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_2;                         // 0x06F0(0x0660)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0D50(0x0108)()
	uint8                                         Pad_6DF5[0x8];                                     // 0x0E58(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_1;                         // 0x0E60(0x0660)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x14C0(0x0660)()
	struct FVector                                Gravity_override;                                  // 0x1B20(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSkydiving;                                       // 0x1B2C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsParachuteOpen;                                   // 0x1B2D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_M_MED_HighTower_Radish_Pet_PostProcess_AnimBP(int32 EntryPoint, float K2Node_Event_DeltaTimeX, bool CallFunc_Greater_FloatFloat_ReturnValue);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"M_MED_HighTower_Radish_Pet_PostProcess_AnimBP_C">();
	}
	static class UM_MED_HighTower_Radish_Pet_PostProcess_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UM_MED_HighTower_Radish_Pet_PostProcess_AnimBP_C>();
	}
};
static_assert(alignof(UM_MED_HighTower_Radish_Pet_PostProcess_AnimBP_C) == 0x000010, "Wrong alinment on UM_MED_HighTower_Radish_Pet_PostProcess_AnimBP_C");
static_assert(sizeof(UM_MED_HighTower_Radish_Pet_PostProcess_AnimBP_C) == 0x001B30, "Wrong size on UM_MED_HighTower_Radish_Pet_PostProcess_AnimBP_C");
static_assert(offsetof(UM_MED_HighTower_Radish_Pet_PostProcess_AnimBP_C, UberGraphFrame) == 0x0005E0, "Member 'UM_MED_HighTower_Radish_Pet_PostProcess_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UM_MED_HighTower_Radish_Pet_PostProcess_AnimBP_C, AnimBlueprintClassSubsystem_PropertyAccess) == 0x0005E8, "Member 'UM_MED_HighTower_Radish_Pet_PostProcess_AnimBP_C::AnimBlueprintClassSubsystem_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UM_MED_HighTower_Radish_Pet_PostProcess_AnimBP_C, AnimGraphNode_Root) == 0x0005F0, "Member 'UM_MED_HighTower_Radish_Pet_PostProcess_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UM_MED_HighTower_Radish_Pet_PostProcess_AnimBP_C, AnimGraphNode_LinkedInputPose) == 0x000620, "Member 'UM_MED_HighTower_Radish_Pet_PostProcess_AnimBP_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UM_MED_HighTower_Radish_Pet_PostProcess_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x0006A8, "Member 'UM_MED_HighTower_Radish_Pet_PostProcess_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UM_MED_HighTower_Radish_Pet_PostProcess_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x0006C8, "Member 'UM_MED_HighTower_Radish_Pet_PostProcess_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UM_MED_HighTower_Radish_Pet_PostProcess_AnimBP_C, AnimGraphNode_RigidBody_2) == 0x0006F0, "Member 'UM_MED_HighTower_Radish_Pet_PostProcess_AnimBP_C::AnimGraphNode_RigidBody_2' has a wrong offset!");
static_assert(offsetof(UM_MED_HighTower_Radish_Pet_PostProcess_AnimBP_C, AnimGraphNode_ModifyBone) == 0x000D50, "Member 'UM_MED_HighTower_Radish_Pet_PostProcess_AnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UM_MED_HighTower_Radish_Pet_PostProcess_AnimBP_C, AnimGraphNode_RigidBody_1) == 0x000E60, "Member 'UM_MED_HighTower_Radish_Pet_PostProcess_AnimBP_C::AnimGraphNode_RigidBody_1' has a wrong offset!");
static_assert(offsetof(UM_MED_HighTower_Radish_Pet_PostProcess_AnimBP_C, AnimGraphNode_RigidBody) == 0x0014C0, "Member 'UM_MED_HighTower_Radish_Pet_PostProcess_AnimBP_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UM_MED_HighTower_Radish_Pet_PostProcess_AnimBP_C, Gravity_override) == 0x001B20, "Member 'UM_MED_HighTower_Radish_Pet_PostProcess_AnimBP_C::Gravity_override' has a wrong offset!");
static_assert(offsetof(UM_MED_HighTower_Radish_Pet_PostProcess_AnimBP_C, IsSkydiving) == 0x001B2C, "Member 'UM_MED_HighTower_Radish_Pet_PostProcess_AnimBP_C::IsSkydiving' has a wrong offset!");
static_assert(offsetof(UM_MED_HighTower_Radish_Pet_PostProcess_AnimBP_C, IsParachuteOpen) == 0x001B2D, "Member 'UM_MED_HighTower_Radish_Pet_PostProcess_AnimBP_C::IsParachuteOpen' has a wrong offset!");

}

