#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_MED_Tactical_Scuba_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "ControlRig_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass M_MED_Tactical_Scuba_AnimBP.M_MED_Tactical_Scuba_AnimBP_C
// 0x0EE0 (0x13E0 - 0x0500)
class UM_MED_Tactical_Scuba_AnimBP_C final  : public UCustomCharacterPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0500(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimInstanceSubsystemData             AnimBlueprintClassSubsystem_PropertyAccess;        // 0x0508(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5DD9[0x7];                                     // 0x0509(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0510(0x0030)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x0540(0x0140)(ContainsInstancedReference)
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_1;                        // 0x0680(0x0360)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x09E0(0x0360)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x0D40(0x0660)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x13A0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x13C0(0x0020)()

public:
	void ExecuteUbergraph_M_MED_Tactical_Scuba_AnimBP(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"M_MED_Tactical_Scuba_AnimBP_C">();
	}
	static class UM_MED_Tactical_Scuba_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UM_MED_Tactical_Scuba_AnimBP_C>();
	}
};
static_assert(alignof(UM_MED_Tactical_Scuba_AnimBP_C) == 0x000010, "Wrong alinment on UM_MED_Tactical_Scuba_AnimBP_C");
static_assert(sizeof(UM_MED_Tactical_Scuba_AnimBP_C) == 0x0013E0, "Wrong size on UM_MED_Tactical_Scuba_AnimBP_C");
static_assert(offsetof(UM_MED_Tactical_Scuba_AnimBP_C, UberGraphFrame) == 0x000500, "Member 'UM_MED_Tactical_Scuba_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UM_MED_Tactical_Scuba_AnimBP_C, AnimBlueprintClassSubsystem_PropertyAccess) == 0x000508, "Member 'UM_MED_Tactical_Scuba_AnimBP_C::AnimBlueprintClassSubsystem_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UM_MED_Tactical_Scuba_AnimBP_C, AnimGraphNode_Root) == 0x000510, "Member 'UM_MED_Tactical_Scuba_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UM_MED_Tactical_Scuba_AnimBP_C, AnimGraphNode_CopyPoseFromMesh) == 0x000540, "Member 'UM_MED_Tactical_Scuba_AnimBP_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UM_MED_Tactical_Scuba_AnimBP_C, AnimGraphNode_ControlRig_1) == 0x000680, "Member 'UM_MED_Tactical_Scuba_AnimBP_C::AnimGraphNode_ControlRig_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Tactical_Scuba_AnimBP_C, AnimGraphNode_ControlRig) == 0x0009E0, "Member 'UM_MED_Tactical_Scuba_AnimBP_C::AnimGraphNode_ControlRig' has a wrong offset!");
static_assert(offsetof(UM_MED_Tactical_Scuba_AnimBP_C, AnimGraphNode_RigidBody) == 0x000D40, "Member 'UM_MED_Tactical_Scuba_AnimBP_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UM_MED_Tactical_Scuba_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x0013A0, "Member 'UM_MED_Tactical_Scuba_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UM_MED_Tactical_Scuba_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x0013C0, "Member 'UM_MED_Tactical_Scuba_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");

}

