#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MantisRuntime

#include "Basic.hpp"

#include "MantisRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "ModularGameplay_classes.hpp"


namespace SDK
{

// Class MantisRuntime.FortMantisPawnComponent
// 0x0160 (0x0210 - 0x00B0)
class UFortMantisPawnComponent final  : public UPawnComponent
{
public:
	uint8                                         Pad_476E[0x60];                                    // 0x00B0(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UAnimMontage*, struct FFortMantisMontageData> MontageDataMap;                                    // 0x0110(0x0050)(Protected, NativeAccessSpecifierProtected)
	class UFortMantisData*                        MantisData;                                        // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AFortWeapon*                            Weapon;                                            // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_476F[0xA0];                                    // 0x0170(0x00A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnCharacterMovementPreUpdate(class UCharacterMovementComponent* CharMoveComp, float DeltaSeconds);
	void OnPostPhysicsRotation(class UCharacterMovementComponent* CharMoveComp, float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FortMantisPawnComponent">();
	}
	static class UFortMantisPawnComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMantisPawnComponent>();
	}
};
static_assert(alignof(UFortMantisPawnComponent) == 0x000008, "Wrong alinment on UFortMantisPawnComponent");
static_assert(sizeof(UFortMantisPawnComponent) == 0x000210, "Wrong size on UFortMantisPawnComponent");
static_assert(offsetof(UFortMantisPawnComponent, MontageDataMap) == 0x000110, "Member 'UFortMantisPawnComponent::MontageDataMap' has a wrong offset!");
static_assert(offsetof(UFortMantisPawnComponent, MantisData) == 0x000160, "Member 'UFortMantisPawnComponent::MantisData' has a wrong offset!");
static_assert(offsetof(UFortMantisPawnComponent, Weapon) == 0x000168, "Member 'UFortMantisPawnComponent::Weapon' has a wrong offset!");

// Class MantisRuntime.FortAbilityTask_ApplyRootMotionMantisForce
// 0x0038 (0x00F0 - 0x00B8)
class UFortAbilityTask_ApplyRootMotionMantisForce final  : public UAbilityTask_ApplyRootMotion_Base
{
public:
	FMulticastInlineDelegateProperty_             OnFinish;                                          // 0x00B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	float                                         Duration;                                          // 0x00C8(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4772[0x4];                                     // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           TechniqueMontage;                                  // 0x00D0(0x0008)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FFortMantisRootMotionWarpInfo          WarpInfo;                                          // 0x00D8(0x0018)(Net, NoDestructor, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FortAbilityTask_ApplyRootMotionMantisForce">();
	}
	static class UFortAbilityTask_ApplyRootMotionMantisForce* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAbilityTask_ApplyRootMotionMantisForce>();
	}
};
static_assert(alignof(UFortAbilityTask_ApplyRootMotionMantisForce) == 0x000008, "Wrong alinment on UFortAbilityTask_ApplyRootMotionMantisForce");
static_assert(sizeof(UFortAbilityTask_ApplyRootMotionMantisForce) == 0x0000F0, "Wrong size on UFortAbilityTask_ApplyRootMotionMantisForce");
static_assert(offsetof(UFortAbilityTask_ApplyRootMotionMantisForce, OnFinish) == 0x0000B8, "Member 'UFortAbilityTask_ApplyRootMotionMantisForce::OnFinish' has a wrong offset!");
static_assert(offsetof(UFortAbilityTask_ApplyRootMotionMantisForce, Duration) == 0x0000C8, "Member 'UFortAbilityTask_ApplyRootMotionMantisForce::Duration' has a wrong offset!");
static_assert(offsetof(UFortAbilityTask_ApplyRootMotionMantisForce, TechniqueMontage) == 0x0000D0, "Member 'UFortAbilityTask_ApplyRootMotionMantisForce::TechniqueMontage' has a wrong offset!");
static_assert(offsetof(UFortAbilityTask_ApplyRootMotionMantisForce, WarpInfo) == 0x0000D8, "Member 'UFortAbilityTask_ApplyRootMotionMantisForce::WarpInfo' has a wrong offset!");

// Class MantisRuntime.FortAnimNotify_Mantis
// 0x0008 (0x0040 - 0x0038)
class UFortAnimNotify_Mantis final  : public UAnimNotify
{
public:
	EFortMantisNotifyEvent                        MantisNotifyEvent;                                 // 0x0038(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFortMantisBranchRule                         MantisBranchRule;                                  // 0x0039(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFortMantisBranchPath                         MantisBranchPath;                                  // 0x003A(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4773[0x5];                                     // 0x003B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FortAnimNotify_Mantis">();
	}
	static class UFortAnimNotify_Mantis* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAnimNotify_Mantis>();
	}
};
static_assert(alignof(UFortAnimNotify_Mantis) == 0x000008, "Wrong alinment on UFortAnimNotify_Mantis");
static_assert(sizeof(UFortAnimNotify_Mantis) == 0x000040, "Wrong size on UFortAnimNotify_Mantis");
static_assert(offsetof(UFortAnimNotify_Mantis, MantisNotifyEvent) == 0x000038, "Member 'UFortAnimNotify_Mantis::MantisNotifyEvent' has a wrong offset!");
static_assert(offsetof(UFortAnimNotify_Mantis, MantisBranchRule) == 0x000039, "Member 'UFortAnimNotify_Mantis::MantisBranchRule' has a wrong offset!");
static_assert(offsetof(UFortAnimNotify_Mantis, MantisBranchPath) == 0x00003A, "Member 'UFortAnimNotify_Mantis::MantisBranchPath' has a wrong offset!");

// Class MantisRuntime.FortMantisWeaponComponent
// 0x0010 (0x00C0 - 0x00B0)
class UFortMantisWeaponComponent final  : public UFortWeaponComponent
{
public:
	class UFortMantisData*                        MantisData;                                        // 0x00B0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortMantisPawnComponent*               MantisPawnComponent;                               // 0x00B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FortMantisWeaponComponent">();
	}
	static class UFortMantisWeaponComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMantisWeaponComponent>();
	}
};
static_assert(alignof(UFortMantisWeaponComponent) == 0x000008, "Wrong alinment on UFortMantisWeaponComponent");
static_assert(sizeof(UFortMantisWeaponComponent) == 0x0000C0, "Wrong size on UFortMantisWeaponComponent");
static_assert(offsetof(UFortMantisWeaponComponent, MantisData) == 0x0000B0, "Member 'UFortMantisWeaponComponent::MantisData' has a wrong offset!");
static_assert(offsetof(UFortMantisWeaponComponent, MantisPawnComponent) == 0x0000B8, "Member 'UFortMantisWeaponComponent::MantisPawnComponent' has a wrong offset!");

// Class MantisRuntime.FortAnimNotifyState_Mantis
// 0x0010 (0x0040 - 0x0030)
class UFortAnimNotifyState_Mantis final  : public UAnimNotifyState
{
public:
	EFortMantisNotifyWindow                       MantisNotifyWindow;                                // 0x0030(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4774[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           MantisNotifyTag;                                   // 0x0034(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFortMantisNotifyRotationWarpRateRule         RotationRateWarpRule;                              // 0x003C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bWarpRotation : 1;                                 // 0x003D(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bWarpTranslation : 1;                              // 0x003D(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_4775[0x2];                                     // 0x003E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FortAnimNotifyState_Mantis">();
	}
	static class UFortAnimNotifyState_Mantis* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAnimNotifyState_Mantis>();
	}
};
static_assert(alignof(UFortAnimNotifyState_Mantis) == 0x000008, "Wrong alinment on UFortAnimNotifyState_Mantis");
static_assert(sizeof(UFortAnimNotifyState_Mantis) == 0x000040, "Wrong size on UFortAnimNotifyState_Mantis");
static_assert(offsetof(UFortAnimNotifyState_Mantis, MantisNotifyWindow) == 0x000030, "Member 'UFortAnimNotifyState_Mantis::MantisNotifyWindow' has a wrong offset!");
static_assert(offsetof(UFortAnimNotifyState_Mantis, MantisNotifyTag) == 0x000034, "Member 'UFortAnimNotifyState_Mantis::MantisNotifyTag' has a wrong offset!");
static_assert(offsetof(UFortAnimNotifyState_Mantis, RotationRateWarpRule) == 0x00003C, "Member 'UFortAnimNotifyState_Mantis::RotationRateWarpRule' has a wrong offset!");

// Class MantisRuntime.FortGameplayAbility_Mantis
// 0x0028 (0x0AE0 - 0x0AB8)
class UFortGameplayAbility_Mantis final  : public UFortGameplayAbility
{
public:
	bool                                          bAllowRootMotionWarping;                           // 0x0AB8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4776[0x7];                                     // 0x0AB9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMantisPawnComponent*               MantisPawnComponent;                               // 0x0AC0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAbilityTask_PlayMontageAndWait*        MontageTask;                                       // 0x0AC8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortAbilityTask_ApplyRootMotionMantisForce* RootMotionTask;                                    // 0x0AD0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4777[0x8];                                     // 0x0AD8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_OnMantisTechniqueHit(struct FGameplayAbilityTargetDataHandle& TargetDataHandle, const struct FGameplayTag& ApplicationTag);
	void ConfigureRootMotionWarping(class AActor** OutTargetActor, bool* bOutAllowTranslationWarp, bool* bOutAllowRotationWarp, bool* bOutSnapshotTargetLocation);
	void OnMontageCancelled();
	void OnMontageFinished();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FortGameplayAbility_Mantis">();
	}
	static class UFortGameplayAbility_Mantis* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGameplayAbility_Mantis>();
	}
};
static_assert(alignof(UFortGameplayAbility_Mantis) == 0x000008, "Wrong alinment on UFortGameplayAbility_Mantis");
static_assert(sizeof(UFortGameplayAbility_Mantis) == 0x000AE0, "Wrong size on UFortGameplayAbility_Mantis");
static_assert(offsetof(UFortGameplayAbility_Mantis, bAllowRootMotionWarping) == 0x000AB8, "Member 'UFortGameplayAbility_Mantis::bAllowRootMotionWarping' has a wrong offset!");
static_assert(offsetof(UFortGameplayAbility_Mantis, MantisPawnComponent) == 0x000AC0, "Member 'UFortGameplayAbility_Mantis::MantisPawnComponent' has a wrong offset!");
static_assert(offsetof(UFortGameplayAbility_Mantis, MontageTask) == 0x000AC8, "Member 'UFortGameplayAbility_Mantis::MontageTask' has a wrong offset!");
static_assert(offsetof(UFortGameplayAbility_Mantis, RootMotionTask) == 0x000AD0, "Member 'UFortGameplayAbility_Mantis::RootMotionTask' has a wrong offset!");

// Class MantisRuntime.FortItemLayerAnimInstance_UncleBrolly
// 0x0060 (0x03E0 - 0x0380)
class UFortItemLayerAnimInstance_UncleBrolly final  : public UFortItemLayerAnimInstance
{
public:
	struct FCachedAnimStateArray                  UmbrellaGliderOpenStateDataArray;                  // 0x0378(0x0018)(Edit, NativeAccessSpecifierPublic)
	struct FVector                                WrapTranslation;                                   // 0x0390(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               WrapRotation;                                      // 0x039C(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               RootRotationOffset;                                // 0x03A8(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         LandingPredictedTimer;                             // 0x03B4(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldUpdateYawCorrection;                        // 0x03B8(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWasAcceleratingBeforeDodge;                       // 0x03B9(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4779[0x2];                                     // 0x03BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         UncleBrollyDeployCurveValue;                       // 0x03BC(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DashChargeTier;                                    // 0x03C0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DashChargeAdditivePlayrate;                        // 0x03C4(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsUmbrellaFailing;                                // 0x03C8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsMeleeGuarding;                                  // 0x03C9(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsSprinting;                                      // 0x03CA(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsInAir;                                          // 0x03CB(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsLandingPredicted;                               // 0x03CC(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsJumping;                                        // 0x03CD(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDodging;                                        // 0x03CE(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDodgingEast;                                    // 0x03CF(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDodgingSouth;                                   // 0x03D0(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDodgingWest;                                    // 0x03D1(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDashing;                                        // 0x03D2(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDashCharging;                                   // 0x03D3(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDashPredictingEnd;                              // 0x03D4(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsChargeTier1;                                    // 0x03D5(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsChargeTier2;                                    // 0x03D6(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsChargeTier3;                                    // 0x03D7(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMeleeGuardingOrUmbrellaFailing;                   // 0x03D8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTransition_Default_to_GuardLoop;                  // 0x03D9(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTransition_Default_to_GuardIntro;                 // 0x03DA(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTransition_GuardIntro_to_Default;                 // 0x03DB(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUpperBodyShouldPassThrough;                       // 0x03DC(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUmbrellaGliderIsOpen;                             // 0x03DD(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_477A[0x2];                                     // 0x03DE(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FortItemLayerAnimInstance_UncleBrolly">();
	}
	static class UFortItemLayerAnimInstance_UncleBrolly* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortItemLayerAnimInstance_UncleBrolly>();
	}
};
static_assert(alignof(UFortItemLayerAnimInstance_UncleBrolly) == 0x000010, "Wrong alinment on UFortItemLayerAnimInstance_UncleBrolly");
static_assert(sizeof(UFortItemLayerAnimInstance_UncleBrolly) == 0x0003E0, "Wrong size on UFortItemLayerAnimInstance_UncleBrolly");
static_assert(offsetof(UFortItemLayerAnimInstance_UncleBrolly, UmbrellaGliderOpenStateDataArray) == 0x000378, "Member 'UFortItemLayerAnimInstance_UncleBrolly::UmbrellaGliderOpenStateDataArray' has a wrong offset!");
static_assert(offsetof(UFortItemLayerAnimInstance_UncleBrolly, WrapTranslation) == 0x000390, "Member 'UFortItemLayerAnimInstance_UncleBrolly::WrapTranslation' has a wrong offset!");
static_assert(offsetof(UFortItemLayerAnimInstance_UncleBrolly, WrapRotation) == 0x00039C, "Member 'UFortItemLayerAnimInstance_UncleBrolly::WrapRotation' has a wrong offset!");
static_assert(offsetof(UFortItemLayerAnimInstance_UncleBrolly, RootRotationOffset) == 0x0003A8, "Member 'UFortItemLayerAnimInstance_UncleBrolly::RootRotationOffset' has a wrong offset!");
static_assert(offsetof(UFortItemLayerAnimInstance_UncleBrolly, LandingPredictedTimer) == 0x0003B4, "Member 'UFortItemLayerAnimInstance_UncleBrolly::LandingPredictedTimer' has a wrong offset!");
static_assert(offsetof(UFortItemLayerAnimInstance_UncleBrolly, bShouldUpdateYawCorrection) == 0x0003B8, "Member 'UFortItemLayerAnimInstance_UncleBrolly::bShouldUpdateYawCorrection' has a wrong offset!");
static_assert(offsetof(UFortItemLayerAnimInstance_UncleBrolly, bWasAcceleratingBeforeDodge) == 0x0003B9, "Member 'UFortItemLayerAnimInstance_UncleBrolly::bWasAcceleratingBeforeDodge' has a wrong offset!");
static_assert(offsetof(UFortItemLayerAnimInstance_UncleBrolly, UncleBrollyDeployCurveValue) == 0x0003BC, "Member 'UFortItemLayerAnimInstance_UncleBrolly::UncleBrollyDeployCurveValue' has a wrong offset!");
static_assert(offsetof(UFortItemLayerAnimInstance_UncleBrolly, DashChargeTier) == 0x0003C0, "Member 'UFortItemLayerAnimInstance_UncleBrolly::DashChargeTier' has a wrong offset!");
static_assert(offsetof(UFortItemLayerAnimInstance_UncleBrolly, DashChargeAdditivePlayrate) == 0x0003C4, "Member 'UFortItemLayerAnimInstance_UncleBrolly::DashChargeAdditivePlayrate' has a wrong offset!");
static_assert(offsetof(UFortItemLayerAnimInstance_UncleBrolly, bIsUmbrellaFailing) == 0x0003C8, "Member 'UFortItemLayerAnimInstance_UncleBrolly::bIsUmbrellaFailing' has a wrong offset!");
static_assert(offsetof(UFortItemLayerAnimInstance_UncleBrolly, bIsMeleeGuarding) == 0x0003C9, "Member 'UFortItemLayerAnimInstance_UncleBrolly::bIsMeleeGuarding' has a wrong offset!");
static_assert(offsetof(UFortItemLayerAnimInstance_UncleBrolly, bIsSprinting) == 0x0003CA, "Member 'UFortItemLayerAnimInstance_UncleBrolly::bIsSprinting' has a wrong offset!");
static_assert(offsetof(UFortItemLayerAnimInstance_UncleBrolly, bIsInAir) == 0x0003CB, "Member 'UFortItemLayerAnimInstance_UncleBrolly::bIsInAir' has a wrong offset!");
static_assert(offsetof(UFortItemLayerAnimInstance_UncleBrolly, bIsLandingPredicted) == 0x0003CC, "Member 'UFortItemLayerAnimInstance_UncleBrolly::bIsLandingPredicted' has a wrong offset!");
static_assert(offsetof(UFortItemLayerAnimInstance_UncleBrolly, bIsJumping) == 0x0003CD, "Member 'UFortItemLayerAnimInstance_UncleBrolly::bIsJumping' has a wrong offset!");
static_assert(offsetof(UFortItemLayerAnimInstance_UncleBrolly, bIsDodging) == 0x0003CE, "Member 'UFortItemLayerAnimInstance_UncleBrolly::bIsDodging' has a wrong offset!");
static_assert(offsetof(UFortItemLayerAnimInstance_UncleBrolly, bIsDodgingEast) == 0x0003CF, "Member 'UFortItemLayerAnimInstance_UncleBrolly::bIsDodgingEast' has a wrong offset!");
static_assert(offsetof(UFortItemLayerAnimInstance_UncleBrolly, bIsDodgingSouth) == 0x0003D0, "Member 'UFortItemLayerAnimInstance_UncleBrolly::bIsDodgingSouth' has a wrong offset!");
static_assert(offsetof(UFortItemLayerAnimInstance_UncleBrolly, bIsDodgingWest) == 0x0003D1, "Member 'UFortItemLayerAnimInstance_UncleBrolly::bIsDodgingWest' has a wrong offset!");
static_assert(offsetof(UFortItemLayerAnimInstance_UncleBrolly, bIsDashing) == 0x0003D2, "Member 'UFortItemLayerAnimInstance_UncleBrolly::bIsDashing' has a wrong offset!");
static_assert(offsetof(UFortItemLayerAnimInstance_UncleBrolly, bIsDashCharging) == 0x0003D3, "Member 'UFortItemLayerAnimInstance_UncleBrolly::bIsDashCharging' has a wrong offset!");
static_assert(offsetof(UFortItemLayerAnimInstance_UncleBrolly, bIsDashPredictingEnd) == 0x0003D4, "Member 'UFortItemLayerAnimInstance_UncleBrolly::bIsDashPredictingEnd' has a wrong offset!");
static_assert(offsetof(UFortItemLayerAnimInstance_UncleBrolly, bIsChargeTier1) == 0x0003D5, "Member 'UFortItemLayerAnimInstance_UncleBrolly::bIsChargeTier1' has a wrong offset!");
static_assert(offsetof(UFortItemLayerAnimInstance_UncleBrolly, bIsChargeTier2) == 0x0003D6, "Member 'UFortItemLayerAnimInstance_UncleBrolly::bIsChargeTier2' has a wrong offset!");
static_assert(offsetof(UFortItemLayerAnimInstance_UncleBrolly, bIsChargeTier3) == 0x0003D7, "Member 'UFortItemLayerAnimInstance_UncleBrolly::bIsChargeTier3' has a wrong offset!");
static_assert(offsetof(UFortItemLayerAnimInstance_UncleBrolly, bMeleeGuardingOrUmbrellaFailing) == 0x0003D8, "Member 'UFortItemLayerAnimInstance_UncleBrolly::bMeleeGuardingOrUmbrellaFailing' has a wrong offset!");
static_assert(offsetof(UFortItemLayerAnimInstance_UncleBrolly, bTransition_Default_to_GuardLoop) == 0x0003D9, "Member 'UFortItemLayerAnimInstance_UncleBrolly::bTransition_Default_to_GuardLoop' has a wrong offset!");
static_assert(offsetof(UFortItemLayerAnimInstance_UncleBrolly, bTransition_Default_to_GuardIntro) == 0x0003DA, "Member 'UFortItemLayerAnimInstance_UncleBrolly::bTransition_Default_to_GuardIntro' has a wrong offset!");
static_assert(offsetof(UFortItemLayerAnimInstance_UncleBrolly, bTransition_GuardIntro_to_Default) == 0x0003DB, "Member 'UFortItemLayerAnimInstance_UncleBrolly::bTransition_GuardIntro_to_Default' has a wrong offset!");
static_assert(offsetof(UFortItemLayerAnimInstance_UncleBrolly, bUpperBodyShouldPassThrough) == 0x0003DC, "Member 'UFortItemLayerAnimInstance_UncleBrolly::bUpperBodyShouldPassThrough' has a wrong offset!");
static_assert(offsetof(UFortItemLayerAnimInstance_UncleBrolly, bUmbrellaGliderIsOpen) == 0x0003DD, "Member 'UFortItemLayerAnimInstance_UncleBrolly::bUmbrellaGliderIsOpen' has a wrong offset!");

// Class MantisRuntime.FortMantisData
// 0x0050 (0x0080 - 0x0030)
class UFortMantisData final  : public UDataAsset
{
public:
	bool                                          bDetachCharacterRotationFromCamera;                // 0x0030(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_477B[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ReattachCharacterRotationBlendTime;                // 0x0034(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReattachCharacterRotationBlendExponent;            // 0x0038(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WindupCharacterRotationRate;                       // 0x003C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExecutionCharacterRotationRate;                    // 0x0040(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RecoveryCharacterRotationRate;                     // 0x0044(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UFortGameplayAbility_Mantis> TechniqueAbility;                                  // 0x0048(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FFortGameplayEffectContainer>   TechniqueAdditionEffectContainers;                 // 0x0050(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FFortMantisTechniqueData>       Techniques;                                        // 0x0060(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FFortMantisTechniqueBranch>     Branches;                                          // 0x0070(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FortMantisData">();
	}
	static class UFortMantisData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMantisData>();
	}
};
static_assert(alignof(UFortMantisData) == 0x000008, "Wrong alinment on UFortMantisData");
static_assert(sizeof(UFortMantisData) == 0x000080, "Wrong size on UFortMantisData");
static_assert(offsetof(UFortMantisData, bDetachCharacterRotationFromCamera) == 0x000030, "Member 'UFortMantisData::bDetachCharacterRotationFromCamera' has a wrong offset!");
static_assert(offsetof(UFortMantisData, ReattachCharacterRotationBlendTime) == 0x000034, "Member 'UFortMantisData::ReattachCharacterRotationBlendTime' has a wrong offset!");
static_assert(offsetof(UFortMantisData, ReattachCharacterRotationBlendExponent) == 0x000038, "Member 'UFortMantisData::ReattachCharacterRotationBlendExponent' has a wrong offset!");
static_assert(offsetof(UFortMantisData, WindupCharacterRotationRate) == 0x00003C, "Member 'UFortMantisData::WindupCharacterRotationRate' has a wrong offset!");
static_assert(offsetof(UFortMantisData, ExecutionCharacterRotationRate) == 0x000040, "Member 'UFortMantisData::ExecutionCharacterRotationRate' has a wrong offset!");
static_assert(offsetof(UFortMantisData, RecoveryCharacterRotationRate) == 0x000044, "Member 'UFortMantisData::RecoveryCharacterRotationRate' has a wrong offset!");
static_assert(offsetof(UFortMantisData, TechniqueAbility) == 0x000048, "Member 'UFortMantisData::TechniqueAbility' has a wrong offset!");
static_assert(offsetof(UFortMantisData, TechniqueAdditionEffectContainers) == 0x000050, "Member 'UFortMantisData::TechniqueAdditionEffectContainers' has a wrong offset!");
static_assert(offsetof(UFortMantisData, Techniques) == 0x000060, "Member 'UFortMantisData::Techniques' has a wrong offset!");
static_assert(offsetof(UFortMantisData, Branches) == 0x000070, "Member 'UFortMantisData::Branches' has a wrong offset!");

// Class MantisRuntime.UncleBrollyWeaponAnimInstance
// 0x0030 (0x02F0 - 0x02C0)
class UUncleBrollyWeaponAnimInstance final  : public UAnimInstance
{
public:
	TSubclassOf<class UAnimInstance>              UncleBrollyItemLayer;                              // 0x02B8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               UmbrellaRotation;                                  // 0x02C0(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         UmbrellaSpinSpeed;                                 // 0x02CC(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlockDeployEndPlayrate;                            // 0x02D0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlockDeployEndStartPosition;                       // 0x02D4(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDodging;                                        // 0x02D8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsPlayingMeleeAnim;                               // 0x02D9(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsUmbrellaFailing;                                // 0x02DA(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsMeleeGuarding;                                  // 0x02DB(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsInAir;                                          // 0x02DC(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDashing;                                        // 0x02DD(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsSprinting;                                      // 0x02DE(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsPredictingEnd;                                  // 0x02DF(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDashCharging;                                   // 0x02E0(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDashPredictingEnd;                              // 0x02E1(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInAirAndMeleeGuarding;                            // 0x02E2(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTransition_Default_to_DeployStart;                // 0x02E3(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTransition_DeployStart_to_Default;                // 0x02E4(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTransition_Fail_to_FailToDeploy;                  // 0x02E5(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTransition_FailLoop_to_DeployEnd;                 // 0x02E6(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_477C[0x9];                                     // 0x02E7(0x0009)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UncleBrollyWeaponAnimInstance">();
	}
	static class UUncleBrollyWeaponAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUncleBrollyWeaponAnimInstance>();
	}
};
static_assert(alignof(UUncleBrollyWeaponAnimInstance) == 0x000010, "Wrong alinment on UUncleBrollyWeaponAnimInstance");
static_assert(sizeof(UUncleBrollyWeaponAnimInstance) == 0x0002F0, "Wrong size on UUncleBrollyWeaponAnimInstance");
static_assert(offsetof(UUncleBrollyWeaponAnimInstance, UncleBrollyItemLayer) == 0x0002B8, "Member 'UUncleBrollyWeaponAnimInstance::UncleBrollyItemLayer' has a wrong offset!");
static_assert(offsetof(UUncleBrollyWeaponAnimInstance, UmbrellaRotation) == 0x0002C0, "Member 'UUncleBrollyWeaponAnimInstance::UmbrellaRotation' has a wrong offset!");
