#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MinigameButtons

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "MinigameButtonsState_structs.hpp"
#include "UMG_classes.hpp"
#include "MinigameButtonsStateConfiguration_structs.hpp"
#include "MinigameButtonsWidgetSwitcherConfiguration_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MinigameButtons.MinigameButtons_C
// 0x0140 (0x03A0 - 0x0260)
class UMinigameButtons_C final  : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetSwitcher*                        ButtonSwitcher;                                    // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      EndGameButton;                                     // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      EndGameButton2;                                    // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      StartGameButton;                                   // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      StartGameButton2;                                  // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             StartButtonClicked;                                // 0x0290(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             EndButtonClicked;                                  // 0x02A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             StartButtonHovered;                                // 0x02B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             EndButtonHovered;                                  // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UIconTextButton_C*                      CurrentButton;                                     // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMinigameButtonsState                         ButtonState;                                       // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_76F8[0x7];                                     // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EMinigameButtonsState, struct FMinigameButtonsStateConfiguration> ButtonConfigurations;                              // 0x02E0(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	FMulticastInlineDelegateProperty_             StartButtonUnhovered;                              // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             EndButtonUnhovered;                                // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FMinigameButtonsWidgetSwitcherConfiguration CurrentWidgetSwitcherConfiguration;                // 0x0350(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FMinigameButtonsWidgetSwitcherConfiguration> WidgetSwitcherConfigurations;                      // 0x0390(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)

public:
	void UpdateButtonsFromButtonState(const struct FMinigameButtonsStateConfiguration& ButtonConfiguration, bool Temp_bool_Variable, bool Temp_bool_Variable_1, class UIconTextButton_C* Temp_object_Variable, const struct FMinigameButtonsStateConfiguration& CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, bool Temp_bool_Variable_2, bool CallFunc_EqualEqual_ByteByte_ReturnValue, class UIconTextButton_C* K2Node_Select_Default, class FText K2Node_Select_Default_1, bool CallFunc_EqualEqual_ByteByte_ReturnValue_1, class UIconTextButton_C* K2Node_Select_Default_2);
	void SetButtonState(EMinigameButtonsState Value, bool CallFunc_NotEqual_ByteByte_ReturnValue);
	void CenterOnCurrentButton();
	void UpdateButtons(class AFortMinigame* CurrentMinigame, EMinigameButtonsState UseButtonState, EMinigameButtonsState Temp_byte_Variable, EMinigameButtonsState Temp_byte_Variable_1, EMinigameButtonsState Temp_byte_Variable_2, EMinigameButtonsState Temp_byte_Variable_3, EMinigameButtonsState Temp_byte_Variable_4, EMinigameButtonsState Temp_byte_Variable_5, EMinigameButtonsState Temp_byte_Variable_6, EMinigameButtonsState Temp_byte_Variable_7, EMinigameButtonsState Temp_byte_Variable_8, EMinigameButtonsState Temp_byte_Variable_9, bool Temp_bool_Variable, EFortMinigameState Temp_byte_Variable_10, EMinigameButtonsState Temp_byte_Variable_11, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class AFortPlayerControllerAthena* K2Node_DynamicCast_AsFort_Player_Controller_Athena, bool K2Node_DynamicCast_bSuccess, EMinigameButtonsState Temp_byte_Variable_12, bool CallFunc_IsValid_ReturnValue, class AFortMinigame* CallFunc_GetMinigame_ReturnValue, class APawn* CallFunc_GetOwningPlayerPawn_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_IsCuratedHub_ReturnValue, bool CallFunc_IsValid_ReturnValue_2, bool CallFunc_IsReady_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, EMinigameButtonsState K2Node_Select_Default, bool CallFunc_IsValid_ReturnValue_3, EMinigameButtonsState K2Node_Select_Default_1);
	void BndEvt__StartGameButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__EndGameButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void SetWidgetSwitcherIndex(int32 Param_Index);
	void BndEvt__EndGameButton2_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__StartGameButton2_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__StartGameButton2_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__EndGameButton2_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__StartGameButton2_K2Node_ComponentBoundEvent_6_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__EndGameButton2_K2Node_ComponentBoundEvent_7_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnInitialized();
	void ExecuteUbergraph_MinigameButtons(int32 EntryPoint, bool Temp_bool_Variable, class UCommonButton* K2Node_ComponentBoundEvent_Button_6, int32 K2Node_CustomEvent_Index, class UCommonButton* K2Node_ComponentBoundEvent_Button_7, int32 Temp_int_Variable, class UCommonButton* K2Node_ComponentBoundEvent_Button_5, class UCommonButton* K2Node_ComponentBoundEvent_Button_4, class UCommonButton* K2Node_ComponentBoundEvent_Button_3, class UCommonButton* K2Node_ComponentBoundEvent_Button_2, class UCommonButton* K2Node_ComponentBoundEvent_Button_1, class UCommonButton* K2Node_ComponentBoundEvent_Button, const struct FMinigameButtonsWidgetSwitcherConfiguration& K2Node_MakeStruct_MinigameButtonsWidgetSwitcherConfiguration, const struct FMinigameButtonsWidgetSwitcherConfiguration& K2Node_MakeStruct_MinigameButtonsWidgetSwitcherConfiguration_1, bool CallFunc_Array_IsValidIndex_ReturnValue, TArray<struct FMinigameButtonsWidgetSwitcherConfiguration>& K2Node_MakeArray_Array, int32 K2Node_Select_Default);
	void EndButtonUnhovered__DelegateSignature(class UCommonButton* Button);
	void StartButtonUnhovered__DelegateSignature(class UCommonButton* Button);
	void EndButtonHovered__DelegateSignature(class UCommonButton* Button);
	void StartButtonHovered__DelegateSignature(class UCommonButton* Button);
	void EndButtonClicked__DelegateSignature();
	void StartButtonClicked__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MinigameButtons_C">();
	}
	static class UMinigameButtons_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMinigameButtons_C>();
	}
};
static_assert(alignof(UMinigameButtons_C) == 0x000008, "Wrong alinment on UMinigameButtons_C");
static_assert(sizeof(UMinigameButtons_C) == 0x0003A0, "Wrong size on UMinigameButtons_C");
static_assert(offsetof(UMinigameButtons_C, UberGraphFrame) == 0x000260, "Member 'UMinigameButtons_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMinigameButtons_C, ButtonSwitcher) == 0x000268, "Member 'UMinigameButtons_C::ButtonSwitcher' has a wrong offset!");
static_assert(offsetof(UMinigameButtons_C, EndGameButton) == 0x000270, "Member 'UMinigameButtons_C::EndGameButton' has a wrong offset!");
static_assert(offsetof(UMinigameButtons_C, EndGameButton2) == 0x000278, "Member 'UMinigameButtons_C::EndGameButton2' has a wrong offset!");
static_assert(offsetof(UMinigameButtons_C, StartGameButton) == 0x000280, "Member 'UMinigameButtons_C::StartGameButton' has a wrong offset!");
static_assert(offsetof(UMinigameButtons_C, StartGameButton2) == 0x000288, "Member 'UMinigameButtons_C::StartGameButton2' has a wrong offset!");
static_assert(offsetof(UMinigameButtons_C, StartButtonClicked) == 0x000290, "Member 'UMinigameButtons_C::StartButtonClicked' has a wrong offset!");
static_assert(offsetof(UMinigameButtons_C, EndButtonClicked) == 0x0002A0, "Member 'UMinigameButtons_C::EndButtonClicked' has a wrong offset!");
static_assert(offsetof(UMinigameButtons_C, StartButtonHovered) == 0x0002B0, "Member 'UMinigameButtons_C::StartButtonHovered' has a wrong offset!");
static_assert(offsetof(UMinigameButtons_C, EndButtonHovered) == 0x0002C0, "Member 'UMinigameButtons_C::EndButtonHovered' has a wrong offset!");
static_assert(offsetof(UMinigameButtons_C, CurrentButton) == 0x0002D0, "Member 'UMinigameButtons_C::CurrentButton' has a wrong offset!");
static_assert(offsetof(UMinigameButtons_C, ButtonState) == 0x0002D8, "Member 'UMinigameButtons_C::ButtonState' has a wrong offset!");
static_assert(offsetof(UMinigameButtons_C, ButtonConfigurations) == 0x0002E0, "Member 'UMinigameButtons_C::ButtonConfigurations' has a wrong offset!");
static_assert(offsetof(UMinigameButtons_C, StartButtonUnhovered) == 0x000330, "Member 'UMinigameButtons_C::StartButtonUnhovered' has a wrong offset!");
static_assert(offsetof(UMinigameButtons_C, EndButtonUnhovered) == 0x000340, "Member 'UMinigameButtons_C::EndButtonUnhovered' has a wrong offset!");
static_assert(offsetof(UMinigameButtons_C, CurrentWidgetSwitcherConfiguration) == 0x000350, "Member 'UMinigameButtons_C::CurrentWidgetSwitcherConfiguration' has a wrong offset!");
static_assert(offsetof(UMinigameButtons_C, WidgetSwitcherConfigurations) == 0x000390, "Member 'UMinigameButtons_C::WidgetSwitcherConfigurations' has a wrong offset!");

}

