#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OptionsMenu

#include "Basic.hpp"

#include "CommonUI_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function OptionsMenu.OptionsMenu_C.ExecuteUbergraph_OptionsMenu
// 0x02A8 (0x02A8 - 0x0000)
struct OptionsMenu_C_ExecuteUbergraph_OptionsMenu final 
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDialogResult                             Temp_byte_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_590E[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_590F[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue_1;                 // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESubGame                                      CallFunc_GetSubGame_ReturnValue;                   // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5910[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5911[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0040(0x0040)(HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5912[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetWidgetAtIndex_ReturnValue;             // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTabVideoOptions_New_C*                 K2Node_DynamicCast_AsTab_Video_Options_New;        // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5913[0x3];                                     // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTabGamePadConfig_v3_C*                 K2Node_DynamicCast_AsTab_Game_Pad_Config_V_3;      // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5914[0x3];                                     // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_ComponentBoundEvent_TabId;                  // 0x00BC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5915[0x4];                                     // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_TabButton;              // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UIconTabButton_C*                       K2Node_DynamicCast_AsIcon_Tab_Button;              // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5916[0x2];                                     // 0x00DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00DC(0x0010)(ZeroConstructor, NoDestructor)
	EFortDialogResult                             K2Node_CustomEvent_Result;                         // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5917[0x3];                                     // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_ResultName;                     // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00F8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(EFortDialogResult Result, class FName ResultName)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0108(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0118(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(TArray<class FText>& ScreenLabels)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0128(0x0010)(ZeroConstructor, NoDestructor)
	TArray<class FText>                           K2Node_CustomEvent_ScreenLabels;                   // 0x0138(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FText                                   CallFunc_Array_Get_Item;                           // 0x0148(0x0018)()
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue_1;       // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5918[0x4];                                     // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0168(0x0040)(HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetWidgetAtIndex_ReturnValue_1;           // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01B0(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class UTabGamePadConfig_v3_C*                 K2Node_DynamicCast_AsTab_Game_Pad_Config_V_3_1;    // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5919[0x7];                                     // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01D0(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x01F0(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_591A[0x7];                                     // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0238(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0248(0x0018)()
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_591B[0x4];                                     // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_ShowConfirmation_NUI*  CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue; // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_591C[0x6];                                     // 0x0272(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_ShowConfirmation_NUI*  CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue_1; // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortDialogResult                             Temp_byte_Variable_1;                              // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_591D[0x2];                                     // 0x0282(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_1;                              // 0x0284(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDialogResult                             K2Node_CustomEvent_Result_1;                       // 0x028C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_591E[0x3];                                     // 0x028D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_ResultName_1;                   // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EFortDialogResult Result, class FName ResultName)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0298(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu) == 0x000008, "Wrong alinment on OptionsMenu_C_ExecuteUbergraph_OptionsMenu");
static_assert(sizeof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu) == 0x0002A8, "Wrong size on OptionsMenu_C_ExecuteUbergraph_OptionsMenu");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, EntryPoint) == 0x000000, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, Temp_name_Variable) == 0x000004, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, Temp_byte_Variable) == 0x00000C, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_GetContext_ReturnValue) == 0x000010, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_SwitchEnum_CmpSuccess) == 0x000018, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_GetContext_ReturnValue_1) == 0x000020, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_GetSubGame_ReturnValue) == 0x00002C, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_GetSubGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000034, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, Temp_int_Array_Index_Variable) == 0x000038, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_Add_IntInt_ReturnValue_1) == 0x00003C, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_MakeStruct_FormatArgumentData) == 0x000040, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, Temp_int_Variable) == 0x000080, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000084, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000088, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_GetWidgetAtIndex_ReturnValue) == 0x000090, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_GetWidgetAtIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_DynamicCast_AsTab_Video_Options_New) == 0x000098, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_DynamicCast_AsTab_Video_Options_New' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000A4, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_GetChildAt_ReturnValue) == 0x0000A8, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_DynamicCast_AsTab_Game_Pad_Config_V_3) == 0x0000B0, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_DynamicCast_AsTab_Game_Pad_Config_V_3' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_DynamicCast_bSuccess_1) == 0x0000B8, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_ComponentBoundEvent_TabId) == 0x0000BC, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_ComponentBoundEvent_TabId' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_ComponentBoundEvent_TabButton) == 0x0000C8, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_ComponentBoundEvent_TabButton' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_DynamicCast_AsIcon_Tab_Button) == 0x0000D0, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_DynamicCast_AsIcon_Tab_Button' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_DynamicCast_bSuccess_2) == 0x0000D8, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_IsVisible_ReturnValue) == 0x0000D9, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_CreateDelegate_OutputDelegate) == 0x0000DC, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_CustomEvent_Result) == 0x0000EC, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_CustomEvent_ResultName) == 0x0000F0, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_CustomEvent_ResultName' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000F8, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_CreateDelegate_OutputDelegate_2) == 0x000108, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_CreateDelegate_OutputDelegate_3) == 0x000118, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_CreateDelegate_OutputDelegate_4) == 0x000128, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_CustomEvent_ScreenLabels) == 0x000138, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_CustomEvent_ScreenLabels' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_Array_Get_Item) == 0x000148, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_GetActiveWidgetIndex_ReturnValue_1) == 0x000160, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_GetActiveWidgetIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_MakeStruct_FormatArgumentData_1) == 0x000168, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_GetWidgetAtIndex_ReturnValue_1) == 0x0001A8, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_GetWidgetAtIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_MakeArray_Array) == 0x0001B0, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_DynamicCast_AsTab_Game_Pad_Config_V_3_1) == 0x0001C0, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_DynamicCast_AsTab_Game_Pad_Config_V_3_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_DynamicCast_bSuccess_3) == 0x0001C8, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_Format_ReturnValue) == 0x0001D0, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_Array_Length_ReturnValue) == 0x0001E8, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_Array_Length_ReturnValue_1) == 0x0001EC, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_MakeStruct_FormatArgumentData_2) == 0x0001F0, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_Less_IntInt_ReturnValue) == 0x000230, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_MakeArray_Array_1) == 0x000238, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_Format_ReturnValue_1) == 0x000248, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_Subtract_IntInt_ReturnValue) == 0x000260, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue) == 0x000268, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000270, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_IsValid_ReturnValue) == 0x000271, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue_1) == 0x000278, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_IsValid_ReturnValue_1) == 0x000280, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, Temp_byte_Variable_1) == 0x000281, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, Temp_name_Variable_1) == 0x000284, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_CustomEvent_Result_1) == 0x00028C, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_CustomEvent_Result_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_CustomEvent_ResultName_1) == 0x000290, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_CustomEvent_ResultName_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_CreateDelegate_OutputDelegate_5) == 0x000298, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");

// Function OptionsMenu.OptionsMenu_C.HandleTabGamePadActionsNeedBinds
// 0x0010 (0x0010 - 0x0000)
struct OptionsMenu_C_HandleTabGamePadActionsNeedBinds final 
{
public:
	TArray<class FText>                           ScreenLabels;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenu_C_HandleTabGamePadActionsNeedBinds) == 0x000008, "Wrong alinment on OptionsMenu_C_HandleTabGamePadActionsNeedBinds");
static_assert(sizeof(OptionsMenu_C_HandleTabGamePadActionsNeedBinds) == 0x000010, "Wrong size on OptionsMenu_C_HandleTabGamePadActionsNeedBinds");
static_assert(offsetof(OptionsMenu_C_HandleTabGamePadActionsNeedBinds, ScreenLabels) == 0x000000, "Member 'OptionsMenu_C_HandleTabGamePadActionsNeedBinds::ScreenLabels' has a wrong offset!");

// Function OptionsMenu.OptionsMenu_C.BndEvt__SettingsTabs_K2Node_ComponentBoundEvent_95_OnTabButtonCreated__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct OptionsMenu_C_BndEvt__SettingsTabs_K2Node_ComponentBoundEvent_95_OnTabButtonCreated__DelegateSignature final 
{
public:
	class FName                                   TabId;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          TabButton;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenu_C_BndEvt__SettingsTabs_K2Node_ComponentBoundEvent_95_OnTabButtonCreated__DelegateSignature) == 0x000008, "Wrong alinment on OptionsMenu_C_BndEvt__SettingsTabs_K2Node_ComponentBoundEvent_95_OnTabButtonCreated__DelegateSignature");
static_assert(sizeof(OptionsMenu_C_BndEvt__SettingsTabs_K2Node_ComponentBoundEvent_95_OnTabButtonCreated__DelegateSignature) == 0x000010, "Wrong size on OptionsMenu_C_BndEvt__SettingsTabs_K2Node_ComponentBoundEvent_95_OnTabButtonCreated__DelegateSignature");
static_assert(offsetof(OptionsMenu_C_BndEvt__SettingsTabs_K2Node_ComponentBoundEvent_95_OnTabButtonCreated__DelegateSignature, TabId) == 0x000000, "Member 'OptionsMenu_C_BndEvt__SettingsTabs_K2Node_ComponentBoundEvent_95_OnTabButtonCreated__DelegateSignature::TabId' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_BndEvt__SettingsTabs_K2Node_ComponentBoundEvent_95_OnTabButtonCreated__DelegateSignature, TabButton) == 0x000008, "Member 'OptionsMenu_C_BndEvt__SettingsTabs_K2Node_ComponentBoundEvent_95_OnTabButtonCreated__DelegateSignature::TabButton' has a wrong offset!");

// Function OptionsMenu.OptionsMenu_C.DialogResult_B31FF5BD4C0772716F27509EA83B418E
// 0x000C (0x000C - 0x0000)
struct OptionsMenu_C_DialogResult_B31FF5BD4C0772716F27509EA83B418E final 
{
public:
	EFortDialogResult                             Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_591F[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ResultName;                                        // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenu_C_DialogResult_B31FF5BD4C0772716F27509EA83B418E) == 0x000004, "Wrong alinment on OptionsMenu_C_DialogResult_B31FF5BD4C0772716F27509EA83B418E");
static_assert(sizeof(OptionsMenu_C_DialogResult_B31FF5BD4C0772716F27509EA83B418E) == 0x00000C, "Wrong size on OptionsMenu_C_DialogResult_B31FF5BD4C0772716F27509EA83B418E");
static_assert(offsetof(OptionsMenu_C_DialogResult_B31FF5BD4C0772716F27509EA83B418E, Result) == 0x000000, "Member 'OptionsMenu_C_DialogResult_B31FF5BD4C0772716F27509EA83B418E::Result' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_DialogResult_B31FF5BD4C0772716F27509EA83B418E, ResultName) == 0x000004, "Member 'OptionsMenu_C_DialogResult_B31FF5BD4C0772716F27509EA83B418E::ResultName' has a wrong offset!");

// Function OptionsMenu.OptionsMenu_C.DialogResult_826C59EC4C294BC872A644878B35A13B
// 0x000C (0x000C - 0x0000)
struct OptionsMenu_C_DialogResult_826C59EC4C294BC872A644878B35A13B final 
{
public:
	EFortDialogResult                             Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5920[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ResultName;                                        // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenu_C_DialogResult_826C59EC4C294BC872A644878B35A13B) == 0x000004, "Wrong alinment on OptionsMenu_C_DialogResult_826C59EC4C294BC872A644878B35A13B");
static_assert(sizeof(OptionsMenu_C_DialogResult_826C59EC4C294BC872A644878B35A13B) == 0x00000C, "Wrong size on OptionsMenu_C_DialogResult_826C59EC4C294BC872A644878B35A13B");
static_assert(offsetof(OptionsMenu_C_DialogResult_826C59EC4C294BC872A644878B35A13B, Result) == 0x000000, "Member 'OptionsMenu_C_DialogResult_826C59EC4C294BC872A644878B35A13B::Result' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_DialogResult_826C59EC4C294BC872A644878B35A13B, ResultName) == 0x000004, "Member 'OptionsMenu_C_DialogResult_826C59EC4C294BC872A644878B35A13B::ResultName' has a wrong offset!");

// Function OptionsMenu.OptionsMenu_C.Handle Tab Gamepad Config Action Handler States_SAVE
// 0x0028 (0x0028 - 0x0000)
struct OptionsMenu_C_Handle_Tab_Gamepad_Config_Action_Handler_States_SAVE final 
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EInputActionState                             Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputActionState                             Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5921[0x1];                                     // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputActionState                             K2Node_Select_Default;                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5922[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetWidgetAtIndex_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTabGamePadConfig_v3_C*                 K2Node_DynamicCast_AsTab_Game_Pad_Config_V_3;      // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OptionsMenu_C_Handle_Tab_Gamepad_Config_Action_Handler_States_SAVE) == 0x000008, "Wrong alinment on OptionsMenu_C_Handle_Tab_Gamepad_Config_Action_Handler_States_SAVE");
static_assert(sizeof(OptionsMenu_C_Handle_Tab_Gamepad_Config_Action_Handler_States_SAVE) == 0x000028, "Wrong size on OptionsMenu_C_Handle_Tab_Gamepad_Config_Action_Handler_States_SAVE");
static_assert(offsetof(OptionsMenu_C_Handle_Tab_Gamepad_Config_Action_Handler_States_SAVE, Temp_bool_Variable) == 0x000000, "Member 'OptionsMenu_C_Handle_Tab_Gamepad_Config_Action_Handler_States_SAVE::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_Handle_Tab_Gamepad_Config_Action_Handler_States_SAVE, Temp_byte_Variable) == 0x000001, "Member 'OptionsMenu_C_Handle_Tab_Gamepad_Config_Action_Handler_States_SAVE::Temp_byte_Variable' has a wrong offset!");
