#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PerkWidgetNew

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PerkWidgetNew.PerkWidgetNew_C
// 0x01C0 (0x0518 - 0x0358)
class UPerkWidgetNew_C final  : public UFortPerkWidget_NUI
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0358(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x0360(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USizeBox*                               AbilityIconSizeBox;                                // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                BorderAbility;                                     // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                BorderHighlightBorder;                             // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                BorderHightlightBackground;                        // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          Divider;                                           // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          EvolutionBorder;                                   // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_1;                                   // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageAbilityIcon;                                  // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageHeroBonusIcon;                                // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageLockAbility;                                  // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageLockPerk;                                     // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImagePerkIcon;                                     // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageTier;                                         // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  InfoSwitcher;                                      // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       LargeInfo;                                         // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       LevelTextNew;                                      // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlayAbilityPerk;                                // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlayBadge;                                      // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlayBasicPerk;                                  // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlayImagePerk;                                  // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlayLevel;                                      // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               PerkIconSizeBox;                                   // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SkillDescription;                                  // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SkillName;                                         // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           SmallInfo;                                         // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcherBasicPerkOrAbilityPerk;              // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcherTierOrLevel;                         // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateBrush                            DemoImage;                                         // 0x0440(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bIncludeName;                                      // 0x04C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          bIncludeDescription;                               // 0x04C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          bUseLegacyFixedSizeIcons;                          // 0x04CA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	EFortBrushSize                                IconSize;                                          // 0x04CB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bUseLargeFormatName;                               // 0x04CC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_619A[0x3];                                     // 0x04CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Locked_Text_Style;                                 // 0x04D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Locked_Description_Style;                          // 0x04D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Default_Description_Style;                         // 0x04E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Default_Text_Style;                                // 0x04E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnableMouseTooltips;                              // 0x04F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_619B[0x7];                                     // 0x04F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CachedTooltipDescription;                          // 0x04F8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bShowBadges;                                       // 0x0510(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void SetDescriptionWraptTextAt(float WrapTextAt, bool Temp_bool_Variable, bool CallFunc_GreaterEqual_FloatFloat_ReturnValue, float Temp_float_Variable, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_GreaterEqual_FloatFloat_ReturnValue_1, float K2Node_Select_Default, int32 CallFunc_FTrunc_ReturnValue);
	void UpdatePerk(bool Temp_bool_Variable, bool Temp_bool_Variable_1, bool Temp_bool_Variable_2, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, bool Temp_bool_Variable_3, const struct FLinearColor& Temp_struct_Variable, const struct FLinearColor& Temp_struct_Variable_1, bool CallFunc_IsPerkHighlighted_ReturnValue, ESlateVisibility Temp_byte_Variable_2, ESlateVisibility Temp_byte_Variable_3, bool CallFunc_HasAbility_ReturnValue, bool Temp_bool_Variable_4, bool CallFunc_ShouldFadePerk_Result, ESlateVisibility K2Node_Select_Default, class UClass* K2Node_Select_Default_1, class UClass* K2Node_Select_Default_2, ESlateVisibility K2Node_Select_Default_3, const struct FLinearColor& K2Node_Select_Default_4);
	class UWidget* Get_OverlayAbilityPerk_ToolTipWidget(class UCommonInputSubsystem* CallFunc_GetContext_ReturnValue, ECommonInputType CallFunc_GetCurrentInputType_ReturnValue, class FText CallFunc_GetTooltipTitle_ReturnValue, bool CallFunc_NotEqual_ByteByte_ReturnValue, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, class UUserWidget* CallFunc_Create_Basic_Tooltip_Output);
	void InitializeSettings(bool Param_bIncludeName, bool Param_bIncludeDescription, bool Param_bUseLegacyFixedSizeIcons, EFortBrushSize Param_IconSize, bool Param_bUseLargeFormatName, const struct FFortUIPerk& Param_Perk, bool ShowMouseTooltips, bool bInShowBadges, float WrapTextAt, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue);
	void HighlightBadge(const struct FLinearColor& CallFunc_GetHighlightColor_Color, const struct FLinearColor& CallFunc_GetHighlightColor_Color_1, const struct FSlateColor& K2Node_MakeStruct_SlateColor);
	void GetPerkStat(struct FTooltipStat* TooltipStat, bool Temp_bool_Variable, EFortItemTier CallFunc_GetPerkTier_ReturnValue, class FText CallFunc_GetTooltipTitle_ReturnValue, bool CallFunc_IsTierPerk_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData, class FText CallFunc_GetTooltipTitle_ReturnValue_1, class UFortInventoryContext* CallFunc_GetContext_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_1, class FText CallFunc_GetTierText_ReturnValue, int32 CallFunc_GetRequiredLevel_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_2, class FText CallFunc_Conv_IntToText_ReturnValue, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_3, class FText CallFunc_Format_ReturnValue, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array_1, class FText CallFunc_Format_ReturnValue_1, class FText K2Node_Select_Default, const struct FTooltipStat& K2Node_MakeStruct_TooltipStat);
	void ShowTierImage();
	void SetupBadge(EFortSupportBonusType SupportPerkType, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, const struct FSlateBrush& CallFunc_GetTierAbilityBrush_SlateBrush, bool Temp_bool_Variable, ESlateVisibility K2Node_Select_Default, bool CallFunc_IsTierPerk_ReturnValue, int32 CallFunc_GetRequiredLevel_ReturnValue, class FText CallFunc_Conv_IntToText_ReturnValue);
	void InitializeHeroBonusIcon(EFortSupportBonusType SupportPerkType, EFortSupportBonusType Temp_byte_Variable, class UObject* Temp_object_Variable, class UObject* Temp_object_Variable_1, class UObject* Temp_object_Variable_2, EFortSupportBonusType CallFunc_GetSupportBonusType_ReturnValue, class UObject* K2Node_Select_Default, const struct FSlateBrush& K2Node_MakeStruct_SlateBrush, bool CallFunc_EqualEqual_ByteByte_ReturnValue);
	void InitializeText(const class FString& DescriptionText, bool Temp_bool_Variable, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, bool Temp_bool_Variable_1, ESlateVisibility Temp_byte_Variable_2, ESlateVisibility Temp_byte_Variable_3, class UScaleBoxSlot* K2Node_DynamicCast_AsScale_Box_Slot, bool K2Node_DynamicCast_bSuccess, EVerticalAlignment Temp_byte_Variable_4, ESlateVisibility K2Node_Select_Default, EVerticalAlignment Temp_byte_Variable_5, bool Temp_bool_Variable_2, EVerticalAlignment K2Node_Select_Default_1, class UVerticalBoxSlot* K2Node_DynamicCast_AsVertical_Box_Slot, bool K2Node_DynamicCast_bSuccess_1, class FText CallFunc_GetTooltipTitle_ReturnValue, ESlateVisibility K2Node_Select_Default_2);
	void ShouldFadePerk(bool* Result, bool CallFunc_IsPerkHighlighted_ReturnValue, bool CallFunc_IsPerkUnlocked_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue);
	void GetHighlightColor(struct FLinearColor* Color, bool Temp_bool_Variable, const struct FLinearColor& Temp_struct_Variable, const struct FLinearColor& CallFunc_Get_Buff_Color_Color, bool CallFunc_IsPerkHighlighted_ReturnValue, const struct FLinearColor& K2Node_Select_Default);
	void GetTierAbilityBrush(struct FSlateBrush* SlateBrush, EFortItemTier Temp_byte_Variable, class UObject* Temp_object_Variable, class UObject* Temp_object_Variable_1, class UObject* Temp_object_Variable_2, class UObject* Temp_object_Variable_3, class UObject* Temp_object_Variable_4, class UObject* Temp_object_Variable_5, class UObject* Temp_object_Variable_6, class UObject* Temp_object_Variable_7, class UObject* Temp_object_Variable_8, class UObject* Temp_object_Variable_9, class UObject* Temp_object_Variable_10, EFortItemTier CallFunc_GetPerkTier_ReturnValue, class UObject* K2Node_Select_Default, const struct FSlateBrush& K2Node_MakeStruct_SlateBrush);
	void InitializeAbilityPerk(bool Temp_bool_Variable, float Temp_float_Variable, bool Temp_bool_Variable_1, float Temp_float_Variable_1, bool Temp_bool_Variable_2, bool Temp_bool_Variable_3, const struct FSlateBrush& K2Node_MakeStruct_SlateBrush, const struct FSlateBrush& CallFunc_GetIcon_Brush, bool CallFunc_GetIcon_ReturnValue, const struct FSlateBrush& K2Node_Select_Default, const struct FSlateBrush& CallFunc_ResizeBrush_ResizedBrush, const struct FSlateBrush& K2Node_Select_Default_1, float CallFunc_BreakVector2D_X, float CallFunc_BreakVector2D_Y, float K2Node_Select_Default_2, float K2Node_Select_Default_3);
	void InitializeBasicPerk(bool Temp_bool_Variable, bool Temp_bool_Variable_1, float Temp_float_Variable, bool Temp_bool_Variable_2, float Temp_float_Variable_1, bool Temp_bool_Variable_3, const struct FSlateBrush& CallFunc_NoResourceBrush_ReturnValue, const struct FSlateBrush& CallFunc_GetIcon_Brush, bool CallFunc_GetIcon_ReturnValue, const struct FSlateBrush& K2Node_Select_Default, const struct FSlateBrush& CallFunc_ResizeBrush_ResizedBrush, const struct FSlateBrush& K2Node_Select_Default_1, float CallFunc_BreakVector2D_X, float CallFunc_BreakVector2D_Y, float K2Node_Select_Default_2, float K2Node_Select_Default_3);
	void PreConstruct(bool IsDesignTime);
	void OnCombinedTooltipDescriptionReady(class FText& Description);
	void ExecuteUbergraph_PerkWidgetNew(int32 EntryPoint, bool K2Node_Event_IsDesignTime, const struct FSlateBrush& K2Node_MakeStruct_SlateBrush, class FText K2Node_Event_Description);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PerkWidgetNew_C">();
	}
	static class UPerkWidgetNew_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPerkWidgetNew_C>();
	}
};
static_assert(alignof(UPerkWidgetNew_C) == 0x000008, "Wrong alinment on UPerkWidgetNew_C");
static_assert(sizeof(UPerkWidgetNew_C) == 0x000518, "Wrong size on UPerkWidgetNew_C");
static_assert(offsetof(UPerkWidgetNew_C, UberGraphFrame) == 0x000358, "Member 'UPerkWidgetNew_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPerkWidgetNew_C, Intro) == 0x000360, "Member 'UPerkWidgetNew_C::Intro' has a wrong offset!");
static_assert(offsetof(UPerkWidgetNew_C, AbilityIconSizeBox) == 0x000368, "Member 'UPerkWidgetNew_C::AbilityIconSizeBox' has a wrong offset!");
static_assert(offsetof(UPerkWidgetNew_C, BorderAbility) == 0x000370, "Member 'UPerkWidgetNew_C::BorderAbility' has a wrong offset!");
static_assert(offsetof(UPerkWidgetNew_C, BorderHighlightBorder) == 0x000378, "Member 'UPerkWidgetNew_C::BorderHighlightBorder' has a wrong offset!");
static_assert(offsetof(UPerkWidgetNew_C, BorderHightlightBackground) == 0x000380, "Member 'UPerkWidgetNew_C::BorderHightlightBackground' has a wrong offset!");
static_assert(offsetof(UPerkWidgetNew_C, Divider) == 0x000388, "Member 'UPerkWidgetNew_C::Divider' has a wrong offset!");
static_assert(offsetof(UPerkWidgetNew_C, EvolutionBorder) == 0x000390, "Member 'UPerkWidgetNew_C::EvolutionBorder' has a wrong offset!");
static_assert(offsetof(UPerkWidgetNew_C, HorizontalBox_1) == 0x000398, "Member 'UPerkWidgetNew_C::HorizontalBox_1' has a wrong offset!");
static_assert(offsetof(UPerkWidgetNew_C, ImageAbilityIcon) == 0x0003A0, "Member 'UPerkWidgetNew_C::ImageAbilityIcon' has a wrong offset!");
static_assert(offsetof(UPerkWidgetNew_C, ImageHeroBonusIcon) == 0x0003A8, "Member 'UPerkWidgetNew_C::ImageHeroBonusIcon' has a wrong offset!");
static_assert(offsetof(UPerkWidgetNew_C, ImageLockAbility) == 0x0003B0, "Member 'UPerkWidgetNew_C::ImageLockAbility' has a wrong offset!");
static_assert(offsetof(UPerkWidgetNew_C, ImageLockPerk) == 0x0003B8, "Member 'UPerkWidgetNew_C::ImageLockPerk' has a wrong offset!");
static_assert(offsetof(UPerkWidgetNew_C, ImagePerkIcon) == 0x0003C0, "Member 'UPerkWidgetNew_C::ImagePerkIcon' has a wrong offset!");
static_assert(offsetof(UPerkWidgetNew_C, ImageTier) == 0x0003C8, "Member 'UPerkWidgetNew_C::ImageTier' has a wrong offset!");
static_assert(offsetof(UPerkWidgetNew_C, InfoSwitcher) == 0x0003D0, "Member 'UPerkWidgetNew_C::InfoSwitcher' has a wrong offset!");
static_assert(offsetof(UPerkWidgetNew_C, LargeInfo) == 0x0003D8, "Member 'UPerkWidgetNew_C::LargeInfo' has a wrong offset!");
static_assert(offsetof(UPerkWidgetNew_C, LevelTextNew) == 0x0003E0, "Member 'UPerkWidgetNew_C::LevelTextNew' has a wrong offset!");
static_assert(offsetof(UPerkWidgetNew_C, OverlayAbilityPerk) == 0x0003E8, "Member 'UPerkWidgetNew_C::OverlayAbilityPerk' has a wrong offset!");
static_assert(offsetof(UPerkWidgetNew_C, OverlayBadge) == 0x0003F0, "Member 'UPerkWidgetNew_C::OverlayBadge' has a wrong offset!");
static_assert(offsetof(UPerkWidgetNew_C, OverlayBasicPerk) == 0x0003F8, "Member 'UPerkWidgetNew_C::OverlayBasicPerk' has a wrong offset!");
static_assert(offsetof(UPerkWidgetNew_C, OverlayImagePerk) == 0x000400, "Member 'UPerkWidgetNew_C::OverlayImagePerk' has a wrong offset!");
static_assert(offsetof(UPerkWidgetNew_C, OverlayLevel) == 0x000408, "Member 'UPerkWidgetNew_C::OverlayLevel' has a wrong offset!");
static_assert(offsetof(UPerkWidgetNew_C, PerkIconSizeBox) == 0x000410, "Member 'UPerkWidgetNew_C::PerkIconSizeBox' has a wrong offset!");
static_assert(offsetof(UPerkWidgetNew_C, SkillDescription) == 0x000418, "Member 'UPerkWidgetNew_C::SkillDescription' has a wrong offset!");
static_assert(offsetof(UPerkWidgetNew_C, SkillName) == 0x000420, "Member 'UPerkWidgetNew_C::SkillName' has a wrong offset!");
static_assert(offsetof(UPerkWidgetNew_C, SmallInfo) == 0x000428, "Member 'UPerkWidgetNew_C::SmallInfo' has a wrong offset!");
static_assert(offsetof(UPerkWidgetNew_C, WidgetSwitcherBasicPerkOrAbilityPerk) == 0x000430, "Member 'UPerkWidgetNew_C::WidgetSwitcherBasicPerkOrAbilityPerk' has a wrong offset!");
static_assert(offsetof(UPerkWidgetNew_C, WidgetSwitcherTierOrLevel) == 0x000438, "Member 'UPerkWidgetNew_C::WidgetSwitcherTierOrLevel' has a wrong offset!");
static_assert(offsetof(UPerkWidgetNew_C, DemoImage) == 0x000440, "Member 'UPerkWidgetNew_C::DemoImage' has a wrong offset!");
static_assert(offsetof(UPerkWidgetNew_C, bIncludeName) == 0x0004C8, "Member 'UPerkWidgetNew_C::bIncludeName' has a wrong offset!");
static_assert(offsetof(UPerkWidgetNew_C, bIncludeDescription) == 0x0004C9, "Member 'UPerkWidgetNew_C::bIncludeDescription' has a wrong offset!");
static_assert(offsetof(UPerkWidgetNew_C, bUseLegacyFixedSizeIcons) == 0x0004CA, "Member 'UPerkWidgetNew_C::bUseLegacyFixedSizeIcons' has a wrong offset!");
static_assert(offsetof(UPerkWidgetNew_C, IconSize) == 0x0004CB, "Member 'UPerkWidgetNew_C::IconSize' has a wrong offset!");
static_assert(offsetof(UPerkWidgetNew_C, bUseLargeFormatName) == 0x0004CC, "Member 'UPerkWidgetNew_C::bUseLargeFormatName' has a wrong offset!");
static_assert(offsetof(UPerkWidgetNew_C, Locked_Text_Style) == 0x0004D0, "Member 'UPerkWidgetNew_C::Locked_Text_Style' has a wrong offset!");
static_assert(offsetof(UPerkWidgetNew_C, Locked_Description_Style) == 0x0004D8, "Member 'UPerkWidgetNew_C::Locked_Description_Style' has a wrong offset!");
static_assert(offsetof(UPerkWidgetNew_C, Default_Description_Style) == 0x0004E0, "Member 'UPerkWidgetNew_C::Default_Description_Style' has a wrong offset!");
static_assert(offsetof(UPerkWidgetNew_C, Default_Text_Style) == 0x0004E8, "Member 'UPerkWidgetNew_C::Default_Text_Style' has a wrong offset!");
static_assert(offsetof(UPerkWidgetNew_C, bEnableMouseTooltips) == 0x0004F0, "Member 'UPerkWidgetNew_C::bEnableMouseTooltips' has a wrong offset!");
static_assert(offsetof(UPerkWidgetNew_C, CachedTooltipDescription) == 0x0004F8, "Member 'UPerkWidgetNew_C::CachedTooltipDescription' has a wrong offset!");
static_assert(offsetof(UPerkWidgetNew_C, bShowBadges) == 0x000510, "Member 'UPerkWidgetNew_C::bShowBadges' has a wrong offset!");

}

