#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerSurveyPanelContentsAnswerMultipleSelectionWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "SlateCore_structs.hpp"
#include "Slate_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PlayerSurveyPanelContentsAnswerMultipleSelectionWidget.PlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C
// 0x00F8 (0x0470 - 0x0378)
class UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C final  : public UFortPlayerSurveyButtonListMultipleSelectionAnswerWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonActionWidget*                    Action_ActionDisplay;                              // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDynamicEntryBox*                       ChoicesEntryBox;                                   // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonHierarchicalScrollBox*           ChoicesScrollBox;                                  // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                DummyButton;                                       // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SelectionCountTextBlock;                           // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_ActionDisplay;                                // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UCommonButton*>                  ChoiceButtons;                                     // 0x03B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	class FText                                   Text_Subtitle;                                     // 0x03C0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Text_SelectionCount_NoLimit;                       // 0x03D8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Text_SelectionCount_MinLimit;                      // 0x03F0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Text_SelectionCount_MaxLimit;                      // 0x0408(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 SelectionCountStyle_Valid;                         // 0x0420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 SelectionCountStyle_Invalid;                       // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Text_ActionDisplay_ToggleOff;                      // 0x0430(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Text_ActionDisplay_ToggleOn;                       // 0x0448(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 ActionDisplayStyle_CannotToggle;                   // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 ActionDisplayStyle_CanToggle;                      // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PlayerSurveyPanelContentsAnswerMultipleSelectionWidget(int32 EntryPoint, bool CallFunc_GetCurrentAnswer_bOutIsSet, const struct FFortPlayerSurveyAnswerMultipleSelection& CallFunc_GetCurrentAnswer_OutAnswer, struct FFortPlayerSurveyAnswerContainerChangeEventInfo& K2Node_Event_EventInfo, int32 K2Node_Event_ButtonIndex, class UCommonButton* CallFunc_GetButtonAtIndex_ReturnValue);
	void HandleFocusChanged();
	void HandleButtonClicked(int32 ButtonIndex);
	void HandleQuestionChanged();
	void HandleAnswerChanged(struct FFortPlayerSurveyAnswerContainerChangeEventInfo& EventInfo);
	void HandleCommitCurrentAnswer();
	void Construct();
	void HandlePlayerRequestAnswer(TArray<struct FFortPlayerSurveyAnswerMultipleSelectionSingleAnswer>& AnswerChoices, const struct FTimespan& CallFunc_GetStopwatchTime_ReturnValue, const struct FFortPlayerSurveyAnswerMultipleSelection& K2Node_MakeStruct_FortPlayerSurveyAnswerMultipleSelection);
	void UpdateEntryBoxContents(class UWidget* ChoiceWidget, class UFortPlayerSurveyQuestionMultipleSelection* CurrentQuestion, bool CallFunc_IsValid_ReturnValue, TScriptInterface<class IPlayerSurveyMultipleChoiceListItemWidgetInterface_C> K2Node_DynamicCast_AsPlayer_Survey_Multiple_Choice_List_Item_Widget_Interface, bool K2Node_DynamicCast_bSuccess, class UCommonButton* K2Node_DynamicCast_AsCommon_Button, bool K2Node_DynamicCast_bSuccess_1, int32 Temp_int_Array_Index_Variable, int32 CallFunc_Array_Add_ReturnValue, int32 Temp_int_Loop_Counter_Variable, const struct FFortPlayerSurveyQuestionChoice& CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, class UFortPlayerSurveyQuestionMultipleSelection* CallFunc_GetCurrentQuestion_ReturnValue, class UUserWidget* CallFunc_BP_CreateEntry_ReturnValue);
	void ScrollSelectedItemIntoView(bool FallBackToDefault, bool AnimateScroll, bool OverrideScrollDestination, class UWidget* WidgetToFocus, class UWidget* DefaultFocusedWidget, EDescendantScrollDestination Temp_byte_Variable, bool CallFunc_IsValid_ReturnValue, bool Temp_bool_Variable, bool CallFunc_IsValid_ReturnValue_1, EDescendantScrollDestination K2Node_Select_Default, bool CallFunc_NotEqual_ObjectObject_ReturnValue, class UWidget* CallFunc_GetDefaultFocusedWidget_ReturnValue, class UWidget* CallFunc_GetDefaultFocusedWidgetPostDummy_Widget);
	void HandlePlayerRequestToggleChoice(int32 Param_Index, bool CallFunc_IsChoiceSelected_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue);
	void UpdateSelectionCountText(class FText TextFormatToUse, int32 MaxNumAnswers, int32 MinNumAnswers, class UFortPlayerSurveyQuestionMultipleSelection* CurrentQuestion, int32 NumSelected, bool CallFunc_IsValid_ReturnValue, bool CallFunc_GreaterEqual_IntInt_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_1, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_2, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array, class FText CallFunc_Format_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, bool Temp_bool_Variable, bool CallFunc_Greater_IntInt_ReturnValue_1, class FText K2Node_Select_Default, int32 CallFunc_TryGetMaxNumAnswers_OutMaxNumAnswers, bool CallFunc_TryGetMaxNumAnswers_ReturnValue, class UFortPlayerSurveyQuestionMultipleSelection* CallFunc_GetCurrentQuestion_ReturnValue, int32 CallFunc_GetNumChoicesSelected_ReturnValue);
	void UpdateValidDisplay(bool CurrentAnswerValid, bool Temp_bool_Variable, bool CallFunc_IsCurrentAnswerValid_ReturnValue, class UClass* K2Node_Select_Default);
	void UpdateQuestionAnswerDisplay();
	void UpdateActionDisplay(bool bWillSelect, bool bCanToggle, const struct FFortPlayerSurveyButtonListMultipleSelectionAnswerWidgetFocusInfo& FocusInfo, bool CallFunc_IsChoiceSelected_ReturnValue, bool CallFunc_CanToggleChoice_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, bool Temp_bool_Variable, class FText K2Node_Select_Default, bool Temp_bool_Variable_1, const struct FFortPlayerSurveyButtonListMultipleSelectionAnswerWidgetFocusInfo& CallFunc_GetFocusInfo_ReturnValue, class UClass* K2Node_Select_Default_1);

	class UWidget* GetDefaultFocusedWidget(int32 DefaultIndex, class UWidget* TargetWidget, int32 SelectedIndex, class UCommonButton* CallFunc_GetButtonAtIndex_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool CallFunc_GetCurrentAnswer_bOutIsSet, const struct FFortPlayerSurveyAnswerMultipleSelection& CallFunc_GetCurrentAnswer_OutAnswer) const;
	class FText GetSubtitleText() const;
	void GetDefaultFocusedWidgetPostDummy(EUINavigation Param_Navigation, class UWidget** Widget, int32 Param_Index, int32 CallFunc_GetDefaultInitialChoiceIndex_Index, TArray<class UUserWidget*>& CallFunc_GetAllEntries_ReturnValue, bool CallFunc_Array_IsValidIndex_ReturnValue, class UUserWidget* CallFunc_Array_Get_Item) const;
	void GetDefaultInitialChoiceIndex(int32* Param_Index) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C">();
	}
	static class UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C>();
	}
};
static_assert(alignof(UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C) == 0x000008, "Wrong alinment on UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C");
static_assert(sizeof(UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C) == 0x000470, "Wrong size on UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C, UberGraphFrame) == 0x000378, "Member 'UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C, Action_ActionDisplay) == 0x000380, "Member 'UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C::Action_ActionDisplay' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C, ChoicesEntryBox) == 0x000388, "Member 'UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C::ChoicesEntryBox' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C, ChoicesScrollBox) == 0x000390, "Member 'UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C::ChoicesScrollBox' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C, DummyButton) == 0x000398, "Member 'UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C::DummyButton' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C, SelectionCountTextBlock) == 0x0003A0, "Member 'UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C::SelectionCountTextBlock' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C, Text_ActionDisplay) == 0x0003A8, "Member 'UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C::Text_ActionDisplay' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C, ChoiceButtons) == 0x0003B0, "Member 'UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C::ChoiceButtons' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C, Text_Subtitle) == 0x0003C0, "Member 'UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C::Text_Subtitle' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C, Text_SelectionCount_NoLimit) == 0x0003D8, "Member 'UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C::Text_SelectionCount_NoLimit' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C, Text_SelectionCount_MinLimit) == 0x0003F0, "Member 'UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C::Text_SelectionCount_MinLimit' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C, Text_SelectionCount_MaxLimit) == 0x000408, "Member 'UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C::Text_SelectionCount_MaxLimit' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C, SelectionCountStyle_Valid) == 0x000420, "Member 'UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C::SelectionCountStyle_Valid' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C, SelectionCountStyle_Invalid) == 0x000428, "Member 'UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C::SelectionCountStyle_Invalid' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C, Text_ActionDisplay_ToggleOff) == 0x000430, "Member 'UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C::Text_ActionDisplay_ToggleOff' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C, Text_ActionDisplay_ToggleOn) == 0x000448, "Member 'UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C::Text_ActionDisplay_ToggleOn' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C, ActionDisplayStyle_CannotToggle) == 0x000460, "Member 'UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C::ActionDisplayStyle_CannotToggle' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C, ActionDisplayStyle_CanToggle) == 0x000468, "Member 'UPlayerSurveyPanelContentsAnswerMultipleSelectionWidget_C::ActionDisplayStyle_CanToggle' has a wrong offset!");

}

