#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prj_Athena_Bucket_Old

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "B_Prj_ThrownConsumable_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Prj_Athena_Bucket_Old.Prj_Athena_Bucket_Old_C
// 0x0040 (0x0958 - 0x0918)
class APrj_Athena_Bucket_Old_C : public AB_Prj_ThrownConsumable_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Prj_Athena_Bucket_Old_C;            // 0x0918(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortWorldItemDefinition*               ItemToSpawn;                                       // 0x0920(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TurnOffFX;                                         // 0x0928(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	uint8                                         Pad_6EB4[0x7];                                     // 0x0929(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             HitMarkerSound;                                    // 0x0930(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             ThrowIndicator_SoundRef;                           // 0x0938(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldSpawnItem;                                   // 0x0940(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6EB5[0x7];                                     // 0x0941(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Splash_Sound_0;                                    // 0x0948(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ImpactSpawnOffset;                                 // 0x0950(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Prj_Athena_Bucket_Old(int32 EntryPoint, bool Temp_bool_Has_Been_Initd_Variable, bool Temp_bool_Has_Been_Initd_Variable_1, class UPrimitiveComponent* K2Node_Event_MyComp, class AActor* K2Node_Event_Other, class UPrimitiveComponent* K2Node_Event_OtherComp, bool K2Node_Event_bSelfMoved, const struct FVector& K2Node_Event_HitLocation, const struct FVector& K2Node_Event_HitNormal, const struct FVector& K2Node_Event_NormalImpulse, struct FHitResult& K2Node_Event_Hit, bool Temp_bool_Variable, bool CallFunc_BreakHitResult_bBlockingHit, bool CallFunc_BreakHitResult_bInitialOverlap, float CallFunc_BreakHitResult_Time, float CallFunc_BreakHitResult_Distance, const struct FVector& CallFunc_BreakHitResult_Location, const struct FVector& CallFunc_BreakHitResult_ImpactPoint, const struct FVector& CallFunc_BreakHitResult_Normal, const struct FVector& CallFunc_BreakHitResult_ImpactNormal, class UPhysicalMaterial* CallFunc_BreakHitResult_PhysMat, class AActor* CallFunc_BreakHitResult_HitActor, class UPrimitiveComponent* CallFunc_BreakHitResult_HitComponent, class FName CallFunc_BreakHitResult_HitBoneName, int32 CallFunc_BreakHitResult_HitItem, int32 CallFunc_BreakHitResult_ElementIndex, int32 CallFunc_BreakHitResult_FaceIndex, const struct FVector& CallFunc_BreakHitResult_TraceStart, const struct FVector& CallFunc_BreakHitResult_TraceEnd, class AFortPawn* K2Node_DynamicCast_AsFort_Pawn, bool K2Node_DynamicCast_bSuccess, bool CallFunc_IsServer_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, bool Temp_bool_IsClosed_Variable, TArray<class AActor*>& K2Node_Event_HitActors, TArray<struct FHitResult>& K2Node_Event_HitResults, class AFortWaterBodyActor* K2Node_ComponentBoundEvent_WaterBody, class UFortWaterInteractionComponent* K2Node_ComponentBoundEvent_WaterInteractionComponent, bool K2Node_ComponentBoundEvent_bIsFirstBody, const struct FVector& CallFunc_GetActorForwardVector_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_1, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_2, TArray<EFortTeamAffiliation>& K2Node_MakeArray_Array, uint8 CallFunc_GetActorTeam_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, class APawn* CallFunc_GetInstigator_ReturnValue, bool CallFunc_IsServer_ReturnValue_1, bool CallFunc_IsServer_ReturnValue_2, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_3, bool CallFunc_IsInWater_ReturnValue, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue, const struct FVector& CallFunc_Add_VectorVector_ReturnValue, bool Temp_bool_IsClosed_Variable_1, const struct FVector& K2Node_Select_Default, class AFortPickup* CallFunc_K2_SpawnPickupInWorld_ReturnValue);
	void Held_Water_Impact();
	void ReceiveBeginPlay();
	void PlayHitSound();
	void BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_2_WaterInteractionOnEnterWater__DelegateSignature(class AFortWaterBodyActor* WaterBody, class UFortWaterInteractionComponent* Param_WaterInteractionComponent, bool bIsFirstBody);
	void OnExploded(TArray<class AActor*>& HitActors, TArray<struct FHitResult>& HitResults);
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, const struct FVector& HitLocation, const struct FVector& HitNormal, const struct FVector& NormalImpulse, struct FHitResult& Hit);
	void OnRep_TurnOffFX();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Prj_Athena_Bucket_Old_C">();
	}
	static class APrj_Athena_Bucket_Old_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APrj_Athena_Bucket_Old_C>();
	}
};
static_assert(alignof(APrj_Athena_Bucket_Old_C) == 0x000008, "Wrong alinment on APrj_Athena_Bucket_Old_C");
static_assert(sizeof(APrj_Athena_Bucket_Old_C) == 0x000958, "Wrong size on APrj_Athena_Bucket_Old_C");
static_assert(offsetof(APrj_Athena_Bucket_Old_C, UberGraphFrame_Prj_Athena_Bucket_Old_C) == 0x000918, "Member 'APrj_Athena_Bucket_Old_C::UberGraphFrame_Prj_Athena_Bucket_Old_C' has a wrong offset!");
static_assert(offsetof(APrj_Athena_Bucket_Old_C, ItemToSpawn) == 0x000920, "Member 'APrj_Athena_Bucket_Old_C::ItemToSpawn' has a wrong offset!");
static_assert(offsetof(APrj_Athena_Bucket_Old_C, TurnOffFX) == 0x000928, "Member 'APrj_Athena_Bucket_Old_C::TurnOffFX' has a wrong offset!");
static_assert(offsetof(APrj_Athena_Bucket_Old_C, HitMarkerSound) == 0x000930, "Member 'APrj_Athena_Bucket_Old_C::HitMarkerSound' has a wrong offset!");
static_assert(offsetof(APrj_Athena_Bucket_Old_C, ThrowIndicator_SoundRef) == 0x000938, "Member 'APrj_Athena_Bucket_Old_C::ThrowIndicator_SoundRef' has a wrong offset!");
static_assert(offsetof(APrj_Athena_Bucket_Old_C, ShouldSpawnItem) == 0x000940, "Member 'APrj_Athena_Bucket_Old_C::ShouldSpawnItem' has a wrong offset!");
static_assert(offsetof(APrj_Athena_Bucket_Old_C, Splash_Sound_0) == 0x000948, "Member 'APrj_Athena_Bucket_Old_C::Splash_Sound_0' has a wrong offset!");
static_assert(offsetof(APrj_Athena_Bucket_Old_C, ImpactSpawnOffset) == 0x000950, "Member 'APrj_Athena_Bucket_Old_C::ImpactSpawnOffset' has a wrong offset!");

}

