#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PropertyAccess

#include "Basic.hpp"

#include "PropertyAccess_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class PropertyAccess.AnimBlueprintClassSubsystem_PropertyAccess
// 0x00D0 (0x00F8 - 0x0028)
class UAnimBlueprintClassSubsystem_PropertyAccess final  : public UAnimBlueprintClassSubsystem
{
public:
	uint8                                         Pad_4EEE[0x8];                                     // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPropertyAccessLibrary                 PropertyAccessLibrary;                             // 0x0030(0x00C8)(NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AnimBlueprintClassSubsystem_PropertyAccess">();
	}
	static class UAnimBlueprintClassSubsystem_PropertyAccess* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimBlueprintClassSubsystem_PropertyAccess>();
	}
};
static_assert(alignof(UAnimBlueprintClassSubsystem_PropertyAccess) == 0x000008, "Wrong alinment on UAnimBlueprintClassSubsystem_PropertyAccess");
static_assert(sizeof(UAnimBlueprintClassSubsystem_PropertyAccess) == 0x0000F8, "Wrong size on UAnimBlueprintClassSubsystem_PropertyAccess");
static_assert(offsetof(UAnimBlueprintClassSubsystem_PropertyAccess, PropertyAccessLibrary) == 0x000030, "Member 'UAnimBlueprintClassSubsystem_PropertyAccess::PropertyAccessLibrary' has a wrong offset!");

// Class PropertyAccess.PropertyEventBroadcaster
// 0x0000 (0x0028 - 0x0028)
class IPropertyEventBroadcaster final  : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PropertyEventBroadcaster">();
	}
	static class IPropertyEventBroadcaster* GetDefaultObj()
	{
		return GetDefaultObjImpl<IPropertyEventBroadcaster>();
	}
};
static_assert(alignof(IPropertyEventBroadcaster) == 0x000008, "Wrong alinment on IPropertyEventBroadcaster");
static_assert(sizeof(IPropertyEventBroadcaster) == 0x000028, "Wrong size on IPropertyEventBroadcaster");

// Class PropertyAccess.PropertyEventSubscriber
// 0x0000 (0x0028 - 0x0028)
class IPropertyEventSubscriber final  : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PropertyEventSubscriber">();
	}
	static class IPropertyEventSubscriber* GetDefaultObj()
	{
		return GetDefaultObjImpl<IPropertyEventSubscriber>();
	}
};
static_assert(alignof(IPropertyEventSubscriber) == 0x000008, "Wrong alinment on IPropertyEventSubscriber");
static_assert(sizeof(IPropertyEventSubscriber) == 0x000028, "Wrong size on IPropertyEventSubscriber");

}

