#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RestartClient

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass RestartClient.RestartClient_C
// 0x0018 (0x04B0 - 0x0498)
class URestartClient_C final  : public UFortRestartClientModal
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0498(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x04A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UIconTextButton_C*                      Button_Confirm;                                    // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void OnButtonSet(bool InbShouldExit, bool bShouldShow);
	void BndEvt__Button_Confirm_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnInitialized();
	void ExecuteUbergraph_RestartClient(int32 EntryPoint, bool Temp_bool_Variable, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue, bool Temp_bool_Variable_1, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, bool K2Node_Event_InbShouldExit, bool K2Node_Event_bShouldShow, ESlateVisibility K2Node_Select_Default, class FText CallFunc_MakeLiteralText_ReturnValue, class FText CallFunc_MakeLiteralText_ReturnValue_1, class UCommonButton* K2Node_ComponentBoundEvent_Button, class FText K2Node_Select_Default_1);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RestartClient_C">();
	}
	static class URestartClient_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URestartClient_C>();
	}
};
static_assert(alignof(URestartClient_C) == 0x000008, "Wrong alinment on URestartClient_C");
static_assert(sizeof(URestartClient_C) == 0x0004B0, "Wrong size on URestartClient_C");
static_assert(offsetof(URestartClient_C, UberGraphFrame) == 0x000498, "Member 'URestartClient_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(URestartClient_C, Intro) == 0x0004A0, "Member 'URestartClient_C::Intro' has a wrong offset!");
static_assert(offsetof(URestartClient_C, Button_Confirm) == 0x0004A8, "Member 'URestartClient_C::Button_Confirm' has a wrong offset!");

}

