#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RigVM

#include "Basic.hpp"

#include "RigVM_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class RigVM.RigVM
// 0x0220 (0x0248 - 0x0028)
class URigVM final  : public UObject
{
public:
	struct FRigVMMemoryContainer                  WorkMemory;                                        // 0x0028(0x00A0)(NativeAccessSpecifierPublic)
	struct FRigVMMemoryContainer                  LiteralMemory;                                     // 0x00C8(0x00A0)(NativeAccessSpecifierPublic)
	struct FRigVMByteCode                         ByteCode;                                          // 0x0168(0x0010)(NativeAccessSpecifierPublic)
	struct FRigVMInstructionArray                 Instructions;                                      // 0x0178(0x0010)(Transient, NativeAccessSpecifierPrivate)
	TArray<class FName>                           FunctionNames;                                     // 0x0188(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_52DA[0x10];                                    // 0x0198(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigVMParameter>                Parameters;                                        // 0x01A8(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<class FName, int32>                      ParametersNameMap;                                 // 0x01B8(0x0050)(NativeAccessSpecifierPrivate)
	uint8                                         Pad_52DB[0x38];                                    // 0x0208(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	class URigVM*                                 DeferredVMToCopy;                                  // 0x0240(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	int32 AddRigVMFunction(class UScriptStruct* InRigVMStruct, class FName& InMethodName);
	bool Execute();
	bool GetParameterValueBool(class FName& InParameterName, int32 InArrayIndex);
	float GetParameterValueFloat(class FName& InParameterName, int32 InArrayIndex);
	int32 GetParameterValueInt(class FName& InParameterName, int32 InArrayIndex);
	class FName GetParameterValueName(class FName& InParameterName, int32 InArrayIndex);
	struct FQuat GetParameterValueQuat(class FName& InParameterName, int32 InArrayIndex);
	class FString GetParameterValueString(class FName& InParameterName, int32 InArrayIndex);
	struct FTransform GetParameterValueTransform(class FName& InParameterName, int32 InArrayIndex);
	struct FVector GetParameterValueVector(class FName& InParameterName, int32 InArrayIndex);
	struct FVector2D GetParameterValueVector2D(class FName& InParameterName, int32 InArrayIndex);
	void SetParameterValueBool(class FName& InParameterName, bool InValue, int32 InArrayIndex);
	void SetParameterValueFloat(class FName& InParameterName, float InValue, int32 InArrayIndex);
	void SetParameterValueInt(class FName& InParameterName, int32 InValue, int32 InArrayIndex);
	void SetParameterValueName(class FName& InParameterName, class FName& InValue, int32 InArrayIndex);
	void SetParameterValueQuat(class FName& InParameterName, struct FQuat& InValue, int32 InArrayIndex);
	void SetParameterValueString(class FName& InParameterName, const class FString& InValue, int32 InArrayIndex);
	void SetParameterValueTransform(class FName& InParameterName, struct FTransform& InValue, int32 InArrayIndex);
	void SetParameterValueVector(class FName& InParameterName, struct FVector& InValue, int32 InArrayIndex);
	void SetParameterValueVector2D(class FName& InParameterName, struct FVector2D& InValue, int32 InArrayIndex);

	int32 GetParameterArraySize(class FName& InParameterName) const;
	class FString GetRigVMFunctionName(int32 InFunctionIndex) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RigVM">();
	}
	static class URigVM* GetDefaultObj()
	{
		return GetDefaultObjImpl<URigVM>();
	}
};
static_assert(alignof(URigVM) == 0x000008, "Wrong alinment on URigVM");
static_assert(sizeof(URigVM) == 0x000248, "Wrong size on URigVM");
static_assert(offsetof(URigVM, WorkMemory) == 0x000028, "Member 'URigVM::WorkMemory' has a wrong offset!");
static_assert(offsetof(URigVM, LiteralMemory) == 0x0000C8, "Member 'URigVM::LiteralMemory' has a wrong offset!");
static_assert(offsetof(URigVM, ByteCode) == 0x000168, "Member 'URigVM::ByteCode' has a wrong offset!");
static_assert(offsetof(URigVM, Instructions) == 0x000178, "Member 'URigVM::Instructions' has a wrong offset!");
static_assert(offsetof(URigVM, FunctionNames) == 0x000188, "Member 'URigVM::FunctionNames' has a wrong offset!");
static_assert(offsetof(URigVM, Parameters) == 0x0001A8, "Member 'URigVM::Parameters' has a wrong offset!");
static_assert(offsetof(URigVM, ParametersNameMap) == 0x0001B8, "Member 'URigVM::ParametersNameMap' has a wrong offset!");
static_assert(offsetof(URigVM, DeferredVMToCopy) == 0x000240, "Member 'URigVM::DeferredVMToCopy' has a wrong offset!");

}

