#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SettingsRotator_Narrow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SettingsRotator_Narrow.SettingsRotator_Narrow_C
// 0x0018 (0x0C10 - 0x0BF8)
class USettingsRotator_Narrow_C final  : public UFortSettingsRotator
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BF8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       RotatorHover;                                      // 0x0C00(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Background;                                        // 0x0C08(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SettingsRotator_Narrow(int32 EntryPoint, int32 K2Node_Event_Count, class UMaterialInstanceDynamic* CallFunc_GetDynamicMaterial_ReturnValue, float CallFunc_Conv_IntToFloat_ReturnValue, int32 K2Node_Event_Index, float CallFunc_Conv_IntToFloat_ReturnValue_1, int32 K2Node_Event_DefaultOptionIndex, class UMaterialInstanceDynamic* CallFunc_GetDynamicMaterial_ReturnValue_1, float CallFunc_Conv_IntToFloat_ReturnValue_2, class UMaterialInstanceDynamic* CallFunc_GetDynamicMaterial_ReturnValue_2, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue_1);
	void OnUnHover_Animation();
	void OnHover_Animation();
	void BP_OnDefaultOptionSpecified(int32 DefaultOptionIndex);
	void BP_OnOptionSelected(int32 Param_Index);
	void BP_OnOptionsPopulated(int32 Count);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SettingsRotator_Narrow_C">();
	}
	static class USettingsRotator_Narrow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USettingsRotator_Narrow_C>();
	}
};
static_assert(alignof(USettingsRotator_Narrow_C) == 0x000008, "Wrong alinment on USettingsRotator_Narrow_C");
static_assert(sizeof(USettingsRotator_Narrow_C) == 0x000C10, "Wrong size on USettingsRotator_Narrow_C");
static_assert(offsetof(USettingsRotator_Narrow_C, UberGraphFrame) == 0x000BF8, "Member 'USettingsRotator_Narrow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USettingsRotator_Narrow_C, RotatorHover) == 0x000C00, "Member 'USettingsRotator_Narrow_C::RotatorHover' has a wrong offset!");
static_assert(offsetof(USettingsRotator_Narrow_C, Background) == 0x000C08, "Member 'USettingsRotator_Narrow_C::Background' has a wrong offset!");

}

