#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SettingsListEntry_Scalar_Narrow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SettingsListEntry_Scalar_Narrow.SettingsListEntry_Scalar_Narrow_C
// 0x0020 (0x0308 - 0x02E8)
class USettingsListEntry_Scalar_Narrow_C final  : public UFortSettingsListEntrySetting_Scalar
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnHover;                                           // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 DefaultValueLayer;                                 // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USimpleMaterialProgressBar_C*           Progress;                                          // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SettingsListEntry_Scalar_Narrow(int32 EntryPoint, bool CallFunc_IsUsingTouch_ReturnValue, float K2Node_Event_Value, class UMaterialInstanceDynamic* CallFunc_GetDynamicMaterial_ReturnValue, float K2Node_Event_DefaultValue, const struct FGeometry& K2Node_Event_MyGeometry, struct FPointerEvent& K2Node_Event_MouseEvent_1, class UUMGSequencePlayer* CallFunc_PlayAnimationReverse_ReturnValue, class UUMGSequencePlayer* CallFunc_PlayAnimationForward_ReturnValue, struct FPointerEvent& K2Node_Event_MouseEvent);
	void OnMouseLeave(struct FPointerEvent& MouseEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, struct FPointerEvent& MouseEvent);
	void OnDefaultValueChanged(float DefaultValue);
	void OnValueChanged(float Value);
	class UWidget* GetPrimaryGamepadFocusWidget();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SettingsListEntry_Scalar_Narrow_C">();
	}
	static class USettingsListEntry_Scalar_Narrow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USettingsListEntry_Scalar_Narrow_C>();
	}
};
static_assert(alignof(USettingsListEntry_Scalar_Narrow_C) == 0x000008, "Wrong alinment on USettingsListEntry_Scalar_Narrow_C");
static_assert(sizeof(USettingsListEntry_Scalar_Narrow_C) == 0x000308, "Wrong size on USettingsListEntry_Scalar_Narrow_C");
static_assert(offsetof(USettingsListEntry_Scalar_Narrow_C, UberGraphFrame) == 0x0002E8, "Member 'USettingsListEntry_Scalar_Narrow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USettingsListEntry_Scalar_Narrow_C, OnHover) == 0x0002F0, "Member 'USettingsListEntry_Scalar_Narrow_C::OnHover' has a wrong offset!");
static_assert(offsetof(USettingsListEntry_Scalar_Narrow_C, DefaultValueLayer) == 0x0002F8, "Member 'USettingsListEntry_Scalar_Narrow_C::DefaultValueLayer' has a wrong offset!");
static_assert(offsetof(USettingsListEntry_Scalar_Narrow_C, Progress) == 0x000300, "Member 'USettingsListEntry_Scalar_Narrow_C::Progress' has a wrong offset!");

}

