#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShowdownPin

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ShowdownPin.ShowdownPin_C
// 0x0098 (0x0750 - 0x06B8)
class UShowdownPin_C final  : public UFortShowdownPin
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x06C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Focus;                                             // 0x06C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Reveal;                                            // 0x06D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_NoPinPts;                          // 0x06D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_PinPts;                            // 0x06E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_PinShadow;                                   // 0x06E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               NoPinContent;                                      // 0x06F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       NoPinIcon;                                         // 0x06F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonNumericTextBlock*                NoPinScoreText;                                    // 0x0700(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       NoPinShadow;                                       // 0x0708(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               PinContent;                                        // 0x0710(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PinIcon;                                           // 0x0718(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  PinInfoSwitcher;                                   // 0x0720(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       PinScoreText;                                      // 0x0728(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_PointValuesProgress;                   // 0x0730(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBoxPointValues;                            // 0x0738(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bRepresentsTournamentBestPin;                      // 0x0740(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          DEVShowPin;                                        // 0x0741(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          HidePoints;                                        // 0x0742(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6EE3[0x1];                                     // 0x0743(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         DEVPinScore;                                       // 0x0744(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ColorSilhouette;                                   // 0x0748(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          HideBackplate;                                     // 0x0749(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void Refresh(EFortShowdownPinState PinState, EFortShowdownPinState Temp_byte_Variable, bool Temp_bool_Variable, EFortShowdownPinState Temp_byte_Variable_1, int32 CallFunc_GetScoreToDisplay_ReturnValue, float CallFunc_Conv_IntToFloat_ReturnValue, class FText CallFunc_Conv_IntToText_ReturnValue, class UTextBlock* K2Node_Select_Default, class UWidget* K2Node_Select_Default_1, EFortShowdownPinState CallFunc_GetEventPinState_ReturnValue, EFortShowdownPinState CallFunc_GetTournamentBestPinState_ReturnValue, EFortShowdownPinState K2Node_Select_Default_2);
	void RefreshDataBP();
	void PreConstruct(bool IsDesignTime);
	void EventSetTier(int32 Score);
	void EventFixPts(int32 Points);
	void EventColorize();
	void EventRevealAnim();
	void ExecuteUbergraph_ShowdownPin(int32 EntryPoint, bool Temp_bool_Variable, int32 Temp_int_Variable, bool Temp_bool_Variable_1, int32 Temp_int_Variable_1, bool Temp_bool_Variable_2, int32 Temp_int_Variable_2, int32 Temp_int_Variable_3, bool Temp_bool_Variable_3, float Temp_float_Variable, bool Temp_bool_Variable_4, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, class UMaterialInterface* Temp_object_Variable, class UMaterialInterface* Temp_object_Variable_1, class UMaterialInterface* Temp_object_Variable_2, class UMaterialInterface* Temp_object_Variable_3, bool K2Node_Event_IsDesignTime, int32 K2Node_CustomEvent_Score, float CallFunc_Conv_IntToFloat_ReturnValue, int32 Temp_int_Variable_4, class FText CallFunc_Conv_IntToText_ReturnValue, int32 K2Node_CustomEvent_Points, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array, class FText CallFunc_Format_ReturnValue, ESlateVisibility Temp_byte_Variable_2, class UMaterialInstanceDynamic* CallFunc_GetDynamicMaterial_ReturnValue, const struct FLinearColor& CallFunc_MakeColor_ReturnValue, ESlateVisibility Temp_byte_Variable_3, class UMaterialInstanceDynamic* CallFunc_GetDynamicMaterial_ReturnValue_1, bool Temp_bool_Variable_5, ESlateVisibility K2Node_Select_Default, int32 Temp_int_Variable_5, float CallFunc_PauseAnimation_ReturnValue, float CallFunc_GetStartTime_ReturnValue, float CallFunc_PauseAnimation_ReturnValue_1, bool CallFunc_LessEqual_FloatFloat_ReturnValue, float CallFunc_Add_FloatFloat_ReturnValue, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue, float CallFunc_GetEndTime_ReturnValue, int32 Temp_int_Variable_6, float CallFunc_Subtract_FloatFloat_ReturnValue, float K2Node_Select_Default_1, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue_1, bool Temp_bool_Variable_6, int32 CallFunc_GetTournamentPinUnlockScore_ReturnValue, float CallFunc_Conv_IntToFloat_ReturnValue_1, int32 K2Node_Select_Default_2, float CallFunc_Divide_FloatFloat_ReturnValue, bool CallFunc_Less_FloatFloat_ReturnValue, bool CallFunc_Less_FloatFloat_ReturnValue_1, int32 K2Node_Select_Default_3, bool CallFunc_Less_FloatFloat_ReturnValue_2, int32 K2Node_Select_Default_4, int32 K2Node_Select_Default_5, ESlateVisibility K2Node_Select_Default_6, class UMaterialInterface* K2Node_Select_Default_7);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ShowdownPin_C">();
	}
	static class UShowdownPin_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShowdownPin_C>();
	}
};
static_assert(alignof(UShowdownPin_C) == 0x000008, "Wrong alinment on UShowdownPin_C");
static_assert(sizeof(UShowdownPin_C) == 0x000750, "Wrong size on UShowdownPin_C");
static_assert(offsetof(UShowdownPin_C, UberGraphFrame) == 0x0006B8, "Member 'UShowdownPin_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, Hover) == 0x0006C0, "Member 'UShowdownPin_C::Hover' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, Focus) == 0x0006C8, "Member 'UShowdownPin_C::Focus' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, Reveal) == 0x0006D0, "Member 'UShowdownPin_C::Reveal' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, CommonTextBlock_NoPinPts) == 0x0006D8, "Member 'UShowdownPin_C::CommonTextBlock_NoPinPts' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, CommonTextBlock_PinPts) == 0x0006E0, "Member 'UShowdownPin_C::CommonTextBlock_PinPts' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, Image_PinShadow) == 0x0006E8, "Member 'UShowdownPin_C::Image_PinShadow' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, NoPinContent) == 0x0006F0, "Member 'UShowdownPin_C::NoPinContent' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, NoPinIcon) == 0x0006F8, "Member 'UShowdownPin_C::NoPinIcon' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, NoPinScoreText) == 0x000700, "Member 'UShowdownPin_C::NoPinScoreText' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, NoPinShadow) == 0x000708, "Member 'UShowdownPin_C::NoPinShadow' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, PinContent) == 0x000710, "Member 'UShowdownPin_C::PinContent' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, PinIcon) == 0x000718, "Member 'UShowdownPin_C::PinIcon' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, PinInfoSwitcher) == 0x000720, "Member 'UShowdownPin_C::PinInfoSwitcher' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, PinScoreText) == 0x000728, "Member 'UShowdownPin_C::PinScoreText' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, VerticalBox_PointValuesProgress) == 0x000730, "Member 'UShowdownPin_C::VerticalBox_PointValuesProgress' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, VerticalBoxPointValues) == 0x000738, "Member 'UShowdownPin_C::VerticalBoxPointValues' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, bRepresentsTournamentBestPin) == 0x000740, "Member 'UShowdownPin_C::bRepresentsTournamentBestPin' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, DEVShowPin) == 0x000741, "Member 'UShowdownPin_C::DEVShowPin' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, HidePoints) == 0x000742, "Member 'UShowdownPin_C::HidePoints' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, DEVPinScore) == 0x000744, "Member 'UShowdownPin_C::DEVPinScore' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, ColorSilhouette) == 0x000748, "Member 'UShowdownPin_C::ColorSilhouette' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, HideBackplate) == 0x000749, "Member 'UShowdownPin_C::HideBackplate' has a wrong offset!");

}

