#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShowdownTournamentTile

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ShowdownTournamentTile.ShowdownTournamentTile_C
// 0x0030 (0x0BF0 - 0x0BC0)
class UShowdownTournamentTile_C final  : public UFortShowdownTournamentTile
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BC0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SizeUp;                                            // 0x0BC8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ChangeFocus;                                       // 0x0BD0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_TileFade;                                    // 0x0BD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               PosterSizeBox;                                     // 0x0BE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsFaded;                                           // 0x0BE8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ShowdownTournamentTile(int32 EntryPoint, bool Temp_bool_Variable, float Temp_float_Variable, bool Temp_bool_Variable_1, float Temp_float_Variable_1, bool Temp_bool_Variable_2, bool K2Node_CustomEvent_fadeOut, float CallFunc_GetStartTime_ReturnValue, float CallFunc_GetEndTime_ReturnValue, float CallFunc_GetStartTime_ReturnValue_1, float CallFunc_GetEndTime_ReturnValue_1, bool CallFunc_Not_PreBool_ReturnValue, float CallFunc_PauseAnimation_ReturnValue, float CallFunc_GetStartTime_ReturnValue_2, bool CallFunc_LessEqual_FloatFloat_ReturnValue, float CallFunc_Subtract_FloatFloat_ReturnValue, float CallFunc_GetEndTime_ReturnValue_2, float K2Node_Select_Default, float CallFunc_GetStartTime_ReturnValue_3, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue, float CallFunc_GetEndTime_ReturnValue_3, float CallFunc_PauseAnimation_ReturnValue_1, float CallFunc_PauseAnimation_ReturnValue_2, float CallFunc_Add_FloatFloat_ReturnValue, bool CallFunc_LessEqual_FloatFloat_ReturnValue_1, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue_1, float CallFunc_Subtract_FloatFloat_ReturnValue_1, float CallFunc_PauseAnimation_ReturnValue_3, float CallFunc_Add_FloatFloat_ReturnValue_1, float CallFunc_PauseAnimation_ReturnValue_4, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue_2, bool CallFunc_LessEqual_FloatFloat_ReturnValue_2, float CallFunc_Subtract_FloatFloat_ReturnValue_2, float CallFunc_PauseAnimation_ReturnValue_5, float K2Node_Select_Default_1, float CallFunc_Add_FloatFloat_ReturnValue_2, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue_3, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue_4, float CallFunc_PauseAnimation_ReturnValue_6, float CallFunc_PauseAnimation_ReturnValue_7, bool CallFunc_LessEqual_FloatFloat_ReturnValue_3, float CallFunc_Add_FloatFloat_ReturnValue_3, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue_5, float CallFunc_Subtract_FloatFloat_ReturnValue_3, float Temp_float_Variable_2, bool CallFunc_Not_PreBool_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue, bool Temp_bool_Variable_3, bool CallFunc_BooleanAND_ReturnValue_1, float K2Node_Select_Default_2, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue_6, bool CallFunc_IsVisible_ReturnValue, class UWidget* CallFunc_FindParentWidgetOfType_ReturnValue, class UShowdownScreen_C* K2Node_DynamicCast_AsShowdown_Screen, bool K2Node_DynamicCast_bSuccess, float Temp_float_Variable_3, class UWidget* CallFunc_FindParentWidgetOfType_ReturnValue_1, class UBacchusShowdownScreen_C* K2Node_DynamicCast_AsBacchus_Showdown_Screen, bool K2Node_DynamicCast_bSuccess_1, float K2Node_Select_Default_3, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue_7);
	void EventFade(bool FadeOut);
	void BP_OnDeselected();
	void BP_OnSelected();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ShowdownTournamentTile_C">();
	}
	static class UShowdownTournamentTile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShowdownTournamentTile_C>();
	}
};
static_assert(alignof(UShowdownTournamentTile_C) == 0x000008, "Wrong alinment on UShowdownTournamentTile_C");
static_assert(sizeof(UShowdownTournamentTile_C) == 0x000BF0, "Wrong size on UShowdownTournamentTile_C");
static_assert(offsetof(UShowdownTournamentTile_C, UberGraphFrame) == 0x000BC0, "Member 'UShowdownTournamentTile_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UShowdownTournamentTile_C, SizeUp) == 0x000BC8, "Member 'UShowdownTournamentTile_C::SizeUp' has a wrong offset!");
static_assert(offsetof(UShowdownTournamentTile_C, ChangeFocus) == 0x000BD0, "Member 'UShowdownTournamentTile_C::ChangeFocus' has a wrong offset!");
static_assert(offsetof(UShowdownTournamentTile_C, Image_TileFade) == 0x000BD8, "Member 'UShowdownTournamentTile_C::Image_TileFade' has a wrong offset!");
static_assert(offsetof(UShowdownTournamentTile_C, PosterSizeBox) == 0x000BE0, "Member 'UShowdownTournamentTile_C::PosterSizeBox' has a wrong offset!");
static_assert(offsetof(UShowdownTournamentTile_C, IsFaded) == 0x000BE8, "Member 'UShowdownTournamentTile_C::IsFaded' has a wrong offset!");

}

