#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShowdownDivisionLobbyPanel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ShowdownDivisionLobbyPanel.ShowdownDivisionLobbyPanel_C
// 0x0188 (0x0870 - 0x06E8)
class UShowdownDivisionLobbyPanel_C final  : public UFortDivisionLobbyPanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       EventButtonHover;                                  // 0x06F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x06F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UProgressBar*                           Bar_DivisionProgress;                              // 0x0700(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                BorderTimeRemaining;                               // 0x0708(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  CentralContentSwitcher;                            // 0x0710(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_1;                                 // 0x0718(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_EarnAPin;                          // 0x0720(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  CommonWidgetSwitcher_TournamentWarnings;           // 0x0728(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           EarnPinContent;                                    // 0x0730(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               EarnPinMessage;                                    // 0x0738(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_DivisionProgress;                    // 0x0740(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBoxJustHYpe;                             // 0x0748(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HypeIcon;                                          // 0x0750(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_4;                                           // 0x0758(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_35;                                          // 0x0760(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_DetailsButtonBG;                             // 0x0768(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ErrorBG;                                     // 0x0770(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_PanelBG;                                     // 0x0778(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_PanelBorder;                                 // 0x0780(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       MFA_WarningText;                                   // 0x0788(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               NoMessage;                                         // 0x0790(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RichTextBlock_TournamentTitle;                     // 0x0798(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox_DetailsText;                              // 0x07A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_CrossplayWarning;                             // 0x07A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_CurrentHype;                                  // 0x07B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_DetailsButton;                                // 0x07B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_DivsionProgress;                              // 0x07C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_DivsionRank;                                  // 0x07C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_MatchCapWarning;                              // 0x07D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Remaining;                                    // 0x07D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          TournamentTitleInfo;                               // 0x07E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               WarningMessage;                                    // 0x07E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Progress;                           // 0x07F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateColor                            PrimaryColor;                                      // 0x07F8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            ShadowColor;                                       // 0x0820(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            HighlightColor;                                    // 0x0848(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_ShowdownDivisionLobbyPanel(int32 EntryPoint, float Temp_float_Variable, class UCommonInputSubsystem* CallFunc_GetLocalPlayerSubsystem_ReturnValue, TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate, class UFortGlobalUIContext* CallFunc_GetContext_ReturnValue, bool CallFunc_IsUsingGamepad_ReturnValue, float Temp_float_Variable_1, float Temp_float_Variable_2, bool Temp_bool_Variable, float K2Node_Select_Default, const struct FMargin& K2Node_MakeStruct_Margin, class UCommonButton* K2Node_ComponentBoundEvent_Button_2, class UCommonButton* K2Node_ComponentBoundEvent_Button_1, float CallFunc_GetStartTime_ReturnValue, float CallFunc_GetEndTime_ReturnValue, float CallFunc_GetStartTime_ReturnValue_1, float CallFunc_GetEndTime_ReturnValue_1, bool Temp_bool_Variable_1, class UFortPartyContext* CallFunc_GetContext_ReturnValue_1, float CallFunc_PauseAnimation_ReturnValue, float CallFunc_PauseAnimation_ReturnValue_1, bool CallFunc_LessEqual_FloatFloat_ReturnValue, float CallFunc_Add_FloatFloat_ReturnValue, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue, float CallFunc_Subtract_FloatFloat_ReturnValue, float CallFunc_PauseAnimation_ReturnValue_2, float K2Node_Select_Default_1, bool CallFunc_LessEqual_FloatFloat_ReturnValue_1, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue_1, float CallFunc_Subtract_FloatFloat_ReturnValue_1, float CallFunc_PauseAnimation_ReturnValue_3, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_1, float CallFunc_Add_FloatFloat_ReturnValue_1, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue_2, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class UOverlaySlot* CallFunc_SlotAsOverlaySlot_ReturnValue, class UDivisionDetailsScreen_C* CallFunc_Create_ReturnValue, class UCommonButton* K2Node_ComponentBoundEvent_Button, float Temp_float_Variable_3, const class FString& CallFunc_GetTournamentId_ReturnValue, const class FString& CallFunc_GetEventId_ReturnValue, bool Temp_bool_Variable_2, float K2Node_Select_Default_2, class UMaterialInstanceDynamic* CallFunc_GetDynamicMaterial_ReturnValue, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue_3, ECommonInputType K2Node_CustomEvent_bNewInputType);
	void EventSwitchUI(ECommonInputType bNewInputType);
	void EventColorize();
	void BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void Construct();
	void RefreshDataBP();
	void Refresh(EFortShowdownEventState Temp_byte_Variable, class FText Temp_text_Variable, class FText Temp_text_Variable_1, class FText Temp_text_Variable_2, class FText Temp_text_Variable_3, class FText Temp_text_Variable_4, class FText Temp_text_Variable_5, bool Temp_bool_Variable, float Temp_float_Variable, float Temp_float_Variable_1, ESlateVisibility Temp_byte_Variable_1, float K2Node_Select_Default, class FText CallFunc_GetLeagueDisplayName_ReturnValue, class FText CallFunc_MakeLiteralText_ReturnValue, class FText CallFunc_TextToUpper_ReturnValue, bool CallFunc_IsDivisionEvent_ReturnValue, EFortShowdownEventState CallFunc_GetEventTimeState_ReturnValue, bool CallFunc_DoCalloutMFARequirement_ReturnValue, bool CallFunc_DoCalloutMFARequirement_ReturnValue_1, int32 CallFunc_GetTournamentMatchCap_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, int32 CallFunc_GetCurrentEventTeamNumMatchesPlayed_ReturnValue, int32 CallFunc_GetTournamentMatchCap_ReturnValue_1, ESlateVisibility Temp_byte_Variable_2, int32 CallFunc_Subtract_IntInt_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array, class FText CallFunc_Format_ReturnValue, int32 CallFunc_GetCurrentEventTeamNumMatchesPlayed_ReturnValue_1, int32 CallFunc_GetTournamentMatchCap_ReturnValue_2, int32 CallFunc_Subtract_IntInt_ReturnValue_1, bool CallFunc_GreaterEqual_IntInt_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_BooleanOR_ReturnValue, bool Temp_bool_Variable_1, ESlateVisibility K2Node_Select_Default_1, float Temp_float_Variable_2, class FText CallFunc_MakeLiteralText_ReturnValue_1, class FText CallFunc_MakeLiteralText_ReturnValue_2, class FText K2Node_Select_Default_2, class UVerticalBoxSlot* CallFunc_SlotAsVerticalBoxSlot_ReturnValue, float CallFunc_PauseAnimation_ReturnValue, const struct FMargin& K2Node_MakeStruct_Margin, float CallFunc_GetStartTime_ReturnValue, bool CallFunc_LessEqual_FloatFloat_ReturnValue, float CallFunc_PauseAnimation_ReturnValue_1, float CallFunc_GetEndTime_ReturnValue, float CallFunc_Add_FloatFloat_ReturnValue, float CallFunc_Subtract_FloatFloat_ReturnValue, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue, bool Temp_bool_Variable_2, float K2Node_Select_Default_3, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue_1, const class FString& CallFunc_GetEventId_ReturnValue, bool CallFunc_EqualEqual_StrStr_ReturnValue);
	void UpdateColors();
	void HandleCrossplayChanged();
	void InputTypeChanged(bool IsGamepad);
	void RefreshDivisionData(int32 TotalHypeForNextDivision, int32 TotalHype, int32 TotalNumberDivisions, int32 DivsionRank, int32 CallFunc_GetAmountEarnedWithinDivision_ReturnValue, float CallFunc_Conv_IntToFloat_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData, int32 CallFunc_GetTotalDivisionPoints_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_1, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array, int32 CallFunc_Subtract_IntInt_ReturnValue, class FText CallFunc_Format_ReturnValue, class FText CallFunc_Conv_IntToText_ReturnValue, class FText CallFunc_Conv_IntToText_ReturnValue_1, int32 CallFunc_GetNumericalDisplayAmountForNextDivision_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, bool CallFunc_EqualEqual_IntInt_ReturnValue, int32 CallFunc_GetTotalNumberOfDivisions_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_1, int32 CallFunc_GetDivisionRank_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_2, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array_1, int32 CallFunc_GetRequiredAmountToAdvanceDivision_ReturnValue, class FText CallFunc_Format_ReturnValue_1, float CallFunc_Conv_IntToFloat_ReturnValue_1, float CallFunc_Divide_FloatFloat_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ShowdownDivisionLobbyPanel_C">();
	}
	static class UShowdownDivisionLobbyPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShowdownDivisionLobbyPanel_C>();
	}
};
static_assert(alignof(UShowdownDivisionLobbyPanel_C) == 0x000008, "Wrong alinment on UShowdownDivisionLobbyPanel_C");
static_assert(sizeof(UShowdownDivisionLobbyPanel_C) == 0x000870, "Wrong size on UShowdownDivisionLobbyPanel_C");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, UberGraphFrame) == 0x0006E8, "Member 'UShowdownDivisionLobbyPanel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, EventButtonHover) == 0x0006F0, "Member 'UShowdownDivisionLobbyPanel_C::EventButtonHover' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, Intro) == 0x0006F8, "Member 'UShowdownDivisionLobbyPanel_C::Intro' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, Bar_DivisionProgress) == 0x000700, "Member 'UShowdownDivisionLobbyPanel_C::Bar_DivisionProgress' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, BorderTimeRemaining) == 0x000708, "Member 'UShowdownDivisionLobbyPanel_C::BorderTimeRemaining' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, CentralContentSwitcher) == 0x000710, "Member 'UShowdownDivisionLobbyPanel_C::CentralContentSwitcher' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, CommonTextBlock_1) == 0x000718, "Member 'UShowdownDivisionLobbyPanel_C::CommonTextBlock_1' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, CommonTextBlock_EarnAPin) == 0x000720, "Member 'UShowdownDivisionLobbyPanel_C::CommonTextBlock_EarnAPin' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, CommonWidgetSwitcher_TournamentWarnings) == 0x000728, "Member 'UShowdownDivisionLobbyPanel_C::CommonWidgetSwitcher_TournamentWarnings' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, EarnPinContent) == 0x000730, "Member 'UShowdownDivisionLobbyPanel_C::EarnPinContent' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, EarnPinMessage) == 0x000738, "Member 'UShowdownDivisionLobbyPanel_C::EarnPinMessage' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, HorizontalBox_DivisionProgress) == 0x000740, "Member 'UShowdownDivisionLobbyPanel_C::HorizontalBox_DivisionProgress' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, HorizontalBoxJustHYpe) == 0x000748, "Member 'UShowdownDivisionLobbyPanel_C::HorizontalBoxJustHYpe' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, HypeIcon) == 0x000750, "Member 'UShowdownDivisionLobbyPanel_C::HypeIcon' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, Image_4) == 0x000758, "Member 'UShowdownDivisionLobbyPanel_C::Image_4' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, Image_35) == 0x000760, "Member 'UShowdownDivisionLobbyPanel_C::Image_35' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, Image_DetailsButtonBG) == 0x000768, "Member 'UShowdownDivisionLobbyPanel_C::Image_DetailsButtonBG' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, Image_ErrorBG) == 0x000770, "Member 'UShowdownDivisionLobbyPanel_C::Image_ErrorBG' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, Image_PanelBG) == 0x000778, "Member 'UShowdownDivisionLobbyPanel_C::Image_PanelBG' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, Image_PanelBorder) == 0x000780, "Member 'UShowdownDivisionLobbyPanel_C::Image_PanelBorder' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, MFA_WarningText) == 0x000788, "Member 'UShowdownDivisionLobbyPanel_C::MFA_WarningText' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, NoMessage) == 0x000790, "Member 'UShowdownDivisionLobbyPanel_C::NoMessage' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, RichTextBlock_TournamentTitle) == 0x000798, "Member 'UShowdownDivisionLobbyPanel_C::RichTextBlock_TournamentTitle' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, ScaleBox_DetailsText) == 0x0007A0, "Member 'UShowdownDivisionLobbyPanel_C::ScaleBox_DetailsText' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, Text_CrossplayWarning) == 0x0007A8, "Member 'UShowdownDivisionLobbyPanel_C::Text_CrossplayWarning' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, Text_CurrentHype) == 0x0007B0, "Member 'UShowdownDivisionLobbyPanel_C::Text_CurrentHype' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, Text_DetailsButton) == 0x0007B8, "Member 'UShowdownDivisionLobbyPanel_C::Text_DetailsButton' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, Text_DivsionProgress) == 0x0007C0, "Member 'UShowdownDivisionLobbyPanel_C::Text_DivsionProgress' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, Text_DivsionRank) == 0x0007C8, "Member 'UShowdownDivisionLobbyPanel_C::Text_DivsionRank' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, Text_MatchCapWarning) == 0x0007D0, "Member 'UShowdownDivisionLobbyPanel_C::Text_MatchCapWarning' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, Text_Remaining) == 0x0007D8, "Member 'UShowdownDivisionLobbyPanel_C::Text_Remaining' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, TournamentTitleInfo) == 0x0007E0, "Member 'UShowdownDivisionLobbyPanel_C::TournamentTitleInfo' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, WarningMessage) == 0x0007E8, "Member 'UShowdownDivisionLobbyPanel_C::WarningMessage' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, WidgetSwitcher_Progress) == 0x0007F0, "Member 'UShowdownDivisionLobbyPanel_C::WidgetSwitcher_Progress' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, PrimaryColor) == 0x0007F8, "Member 'UShowdownDivisionLobbyPanel_C::PrimaryColor' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, ShadowColor) == 0x000820, "Member 'UShowdownDivisionLobbyPanel_C::ShadowColor' has a wrong offset!");
static_assert(offsetof(UShowdownDivisionLobbyPanel_C, HighlightColor) == 0x000848, "Member 'UShowdownDivisionLobbyPanel_C::HighlightColor' has a wrong offset!");

}

