#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Squad

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Squad.Squad_C
// 0x0028 (0x0310 - 0x02E8)
class USquad_C final  : public UFortTeamSquadDetailedEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                DarkenBorder;                                      // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        EntryLockSwitcher;                                 // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SquadLogo;                                         // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SquadRibbon;                                       // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void OnLoaded_68F5F01141304474DB5D18BD77CD085C(class UObject* Loaded);
	void OnLoaded_2EC4A7E44D1A9CF51A66D8904054E26E(class UObject* Loaded);
	void OnSquadAssigned(struct FAthenaTeamDisplayInfo& SquadStyle);
	void OnSquadIsEmptyChanged(bool bSquadIsEmpty, bool bMultipleSquadsPopulated);
	void ExecuteUbergraph_Squad(int32 EntryPoint, class UObject* K2Node_CustomEvent_Loaded_1, class UObject* Temp_object_Variable, class UTexture* K2Node_DynamicCast_AsTexture, bool K2Node_DynamicCast_bSuccess, class UObject* K2Node_CustomEvent_Loaded, class UObject* Temp_object_Variable_1, class UTexture* K2Node_DynamicCast_AsTexture_1, bool K2Node_DynamicCast_bSuccess_1, struct FAthenaTeamDisplayInfo& K2Node_Event_SquadStyle, class UMaterialInstanceDynamic* CallFunc_GetDynamicMaterial_ReturnValue, class UMaterialInstanceDynamic* CallFunc_GetDynamicMaterial_ReturnValue_1, TDelegate<void(class UObject* Loaded)> K2Node_CreateDelegate_OutputDelegate, TDelegate<void(class UObject* Loaded)> K2Node_CreateDelegate_OutputDelegate_1, bool K2Node_Event_bSquadIsEmpty, bool K2Node_Event_bMultipleSquadsPopulated, class UMaterialInstanceDynamic* CallFunc_GetDynamicMaterial_ReturnValue_2, class UMaterialInstanceDynamic* CallFunc_GetDynamicMaterial_ReturnValue_3, class UMaterialInstanceDynamic* CallFunc_GetDynamicMaterial_ReturnValue_4, class UMaterialInstanceDynamic* CallFunc_GetDynamicMaterial_ReturnValue_5);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Squad_C">();
	}
	static class USquad_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USquad_C>();
	}
};
static_assert(alignof(USquad_C) == 0x000008, "Wrong alinment on USquad_C");
static_assert(sizeof(USquad_C) == 0x000310, "Wrong size on USquad_C");
static_assert(offsetof(USquad_C, UberGraphFrame) == 0x0002E8, "Member 'USquad_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USquad_C, DarkenBorder) == 0x0002F0, "Member 'USquad_C::DarkenBorder' has a wrong offset!");
static_assert(offsetof(USquad_C, EntryLockSwitcher) == 0x0002F8, "Member 'USquad_C::EntryLockSwitcher' has a wrong offset!");
static_assert(offsetof(USquad_C, SquadLogo) == 0x000300, "Member 'USquad_C::SquadLogo' has a wrong offset!");
static_assert(offsetof(USquad_C, SquadRibbon) == 0x000308, "Member 'USquad_C::SquadRibbon' has a wrong offset!");

}

