#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StoreMain_OfferDetails

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass StoreMain_OfferDetails.StoreMain_OfferDetails_C
// 0x0118 (0x0908 - 0x07F0)
class UStoreMain_OfferDetails_C final  : public UFortRealMoneyOfferDetails
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BaseColor;                                         // 0x07F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BaseColorDetails;                                  // 0x0800(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         BonusMTXArea;                                      // 0x0808(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          BorderDisclaimer;                                  // 0x0810(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonText_BaseQuantity;                           // 0x0818(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonText_BonusQuantity;                          // 0x0820(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Highlight;                                         // 0x0828(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortLazyImage*                         Image_CurrencyIcon;                                // 0x0830(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       KeyArt;                                            // 0x0838(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               MTXArea;                                           // 0x0840(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               MTXButtonBox;                                      // 0x0848(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OverlayGradient;                                   // 0x0850(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OverlayGradientDetails;                            // 0x0858(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlaySalePrice;                                  // 0x0860(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZoneCloseButton;                               // 0x0868(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZoneMTX;                                       // 0x0870(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStoreMain_OfferDetailsAttribute_C*     StoreMain_OfferDetailsAttribute1;                  // 0x0878(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStoreMain_OfferDetailsAttribute_C*     StoreMain_OfferDetailsAttribute2;                  // 0x0880(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextDescription;                                   // 0x0888(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextName;                                          // 0x0890(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextOfferDisplayPrice;                             // 0x0898(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextOriginalPrice;                                 // 0x08A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBoxOfferInfo;                                     // 0x08A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 VBuckHighlight;                                    // 0x08B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<int32, class UFortMtxOfferData*>         ABAssetCollection;                                 // 0x08B8(0x0050)(Edit, BlueprintVisible)

public:
	void SetupCurrencyImage(class UFortAccountItemDefinition* PriceItem, bool Temp_bool_Variable, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, TSoftObjectPtr<class UTexture2D> CallFunc_GetSmallPreviewImage_ReturnValue, bool CallFunc_IsValid_ReturnValue, class UFortStoreFrontOfferInfo* CallFunc_GetOfferInfo_ReturnValue, int32 CallFunc_GetPriceItem_RequiredItemCount, class UFortAccountItemDefinition* CallFunc_GetPriceItem_ReturnValue, class UFortStoreFrontOfferInfo* CallFunc_GetOfferInfo_ReturnValue_1, bool CallFunc_IsPriceInRealMoney_ReturnValue, ESlateVisibility K2Node_Select_Default);
	void UpdatePurchaseButton(bool Temp_bool_Variable, class FText Temp_text_Variable, class FText Temp_text_Variable_1, class UFortStoreFrontOfferInfo* CallFunc_GetOfferInfo_ReturnValue, class UIconTextButton_C* K2Node_DynamicCast_AsIcon_Text_Button, bool K2Node_DynamicCast_bSuccess, bool CallFunc_AreGrantedItemsOwned_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, class FText K2Node_Select_Default);
	void InitDetailAttributes(int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, class UFortStoreFrontOfferInfo* CallFunc_GetOfferInfo_ReturnValue, class UFortMtxOfferData* CallFunc_GetOfferDisplayAsset_ReturnValue, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class UStoreMain_OfferDetailsAttribute_C* CallFunc_Create_ReturnValue, const struct FFortMtxDetailsAttribute& CallFunc_Array_Get_Item, class UVerticalBoxSlot* CallFunc_AddChildToVerticalBox_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue);
	void SetPurchaseButtonText(class FText ButtonText, class UIconTextButton_C* K2Node_DynamicCast_AsIcon_Text_Button, bool K2Node_DynamicCast_bSuccess);
	bool IsGiftingStorefrontOffer(class UFortStoreFrontOfferInfo* CallFunc_GetOfferInfo_ReturnValue, bool CallFunc_IsGiftingStorefrontOffer_ReturnValue);
	void GetCurrencyABAssetFromQuantity(int32 Quantity, class UFortMtxOfferData** DataAsset, class UFortMtxOfferData* CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue);
	void InitCurrency(ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, bool Temp_bool_Variable, ESlateVisibility Temp_byte_Variable_2, ESlateVisibility Temp_byte_Variable_3, bool Temp_bool_Variable_1, ESlateVisibility Temp_byte_Variable_4, ESlateVisibility Temp_byte_Variable_5, class UFortRuntimeOptions* CallFunc_GetRuntimeOptions_ReturnValue, bool Temp_bool_Variable_2, class UFortStoreFrontOfferInfo* CallFunc_GetOfferInfo_ReturnValue, class UFortStoreFrontOfferInfo* CallFunc_GetOfferInfo_ReturnValue_1, int32 CallFunc_GetBonusQuantity_ReturnValue, int32 CallFunc_GetTotalQuantity_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue, ESlateVisibility K2Node_Select_Default, ESlateVisibility K2Node_Select_Default_1, class UFortStoreFrontOfferInfo* CallFunc_GetOfferInfo_ReturnValue_2, class FText CallFunc_GetDescription_ReturnValue, class UFortStoreFrontOfferInfo* CallFunc_GetOfferInfo_ReturnValue_3, class UFortStoreFrontOfferInfo* CallFunc_GetOfferInfo_ReturnValue_4, int32 CallFunc_GetBonusQuantity_ReturnValue_1, int32 CallFunc_GetTotalQuantity_ReturnValue_1, class FText CallFunc_Conv_IntToText_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue_2, int32 CallFunc_GetBaseQuantity_ReturnValue, class FText CallFunc_Conv_IntToText_ReturnValue_1, ESlateVisibility K2Node_Select_Default_2);
	void InitStoreTypeVisuals(bool Temp_bool_Variable, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, class UFortStoreFrontOfferInfo* CallFunc_GetOfferInfo_ReturnValue, EFortMtxStoreOfferType CallFunc_GetFortStoreOfferType_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue, ESlateVisibility K2Node_Select_Default);
	void UnregisterInput();
	void RegisterInput(TDelegate<void(bool* bPassThrough)> K2Node_CreateDelegate_OutputDelegate, const struct FDataTableRowHandle& K2Node_MakeStruct_DataTableRowHandle);
	void PopDetails();
	void Init(class UFortMtxOfferData* DisplayAsset, class UFortStoreFrontOfferInfo* CallFunc_GetOfferInfo_ReturnValue, class UFortMtxOfferData* CallFunc_GetOfferDisplayAsset_ReturnValue, class UFortStoreFrontOfferInfo* CallFunc_GetOfferInfo_ReturnValue_1, class UFortStoreFrontOfferInfo* CallFunc_GetOfferInfo_ReturnValue_2, int32 CallFunc_GetTotalQuantity_ReturnValue, int32 CallFunc_GetTotalQuantity_ReturnValue_1, class UFortMtxOfferData* CallFunc_GetCurrencyABAssetFromQuantity_DataAsset, class UFortMtxOfferData* CallFunc_GetCurrencyABAssetFromQuantity_DataAsset_1, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, EFortMtxStoreOfferType CallFunc_GetFortStoreOfferType_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue, EFortMtxStoreOfferType CallFunc_GetFortStoreOfferType_ReturnValue_1, bool CallFunc_EqualEqual_ByteByte_ReturnValue_1, class FText CallFunc_GetSalePriceFromLastAppStore_SalePrice, bool CallFunc_GetSalePriceFromLastAppStore_ReturnValue, ESlateVisibility Temp_byte_Variable, class UMaterialInstanceDynamic* CallFunc_GetDynamicMaterial_ReturnValue, class UMaterialInstanceDynamic* CallFunc_GetDynamicMaterial_ReturnValue_1, ESlateVisibility Temp_byte_Variable_1, class UFortExperimentContext* CallFunc_GetContext_ReturnValue, bool CallFunc_ShouldShowNewVBuckColorsJuly2019_ReturnValue, class UFortExperimentContext* CallFunc_GetContext_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_ShouldShowNewVBuckColorsJuly2019_ReturnValue_1, bool Temp_bool_Variable, ESlateVisibility K2Node_Select_Default, class UFortStoreFrontOfferInfo* CallFunc_GetOfferInfo_ReturnValue_3, class FText CallFunc_GetNormalPrice_ReturnValue, class FText CallFunc_GetName_ReturnValue, class UMaterialInterface* Temp_object_Variable, class UMaterialInterface* Temp_object_Variable_1, class UMaterialInstanceDynamic* CallFunc_GetDynamicMaterial_ReturnValue_2, bool Temp_bool_Variable_1, class UFortExperimentContext* CallFunc_GetContext_ReturnValue_2, bool CallFunc_ShouldShowNewVBuckCoinAssetsJuly2019_ReturnValue, class UMaterialInterface* K2Node_Select_Default_1, bool CallFunc_BooleanAND_ReturnValue_1, class UMaterialInstanceDynamic* CallFunc_GetDynamicMaterial_ReturnValue_3);
	void HandleBack(bool* PassThrough);
	void ResetPurchaseButtonText();
	void OnPurchasingStarted();
	void BP_OnOfferSet();
	void BP_OnActivated();
	void ExecuteUbergraph_StoreMain_OfferDetails(int32 EntryPoint, class UFortRuntimeOptions* CallFunc_GetRuntimeOptions_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"StoreMain_OfferDetails_C">();
	}
	static class UStoreMain_OfferDetails_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStoreMain_OfferDetails_C>();
	}
};
static_assert(alignof(UStoreMain_OfferDetails_C) == 0x000008, "Wrong alinment on UStoreMain_OfferDetails_C");
static_assert(sizeof(UStoreMain_OfferDetails_C) == 0x000908, "Wrong size on UStoreMain_OfferDetails_C");
static_assert(offsetof(UStoreMain_OfferDetails_C, UberGraphFrame) == 0x0007F0, "Member 'UStoreMain_OfferDetails_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, BaseColor) == 0x0007F8, "Member 'UStoreMain_OfferDetails_C::BaseColor' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, BaseColorDetails) == 0x000800, "Member 'UStoreMain_OfferDetails_C::BaseColorDetails' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, BonusMTXArea) == 0x000808, "Member 'UStoreMain_OfferDetails_C::BonusMTXArea' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, BorderDisclaimer) == 0x000810, "Member 'UStoreMain_OfferDetails_C::BorderDisclaimer' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, CommonText_BaseQuantity) == 0x000818, "Member 'UStoreMain_OfferDetails_C::CommonText_BaseQuantity' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, CommonText_BonusQuantity) == 0x000820, "Member 'UStoreMain_OfferDetails_C::CommonText_BonusQuantity' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, Highlight) == 0x000828, "Member 'UStoreMain_OfferDetails_C::Highlight' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, Image_CurrencyIcon) == 0x000830, "Member 'UStoreMain_OfferDetails_C::Image_CurrencyIcon' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, KeyArt) == 0x000838, "Member 'UStoreMain_OfferDetails_C::KeyArt' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, MTXArea) == 0x000840, "Member 'UStoreMain_OfferDetails_C::MTXArea' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, MTXButtonBox) == 0x000848, "Member 'UStoreMain_OfferDetails_C::MTXButtonBox' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, OverlayGradient) == 0x000850, "Member 'UStoreMain_OfferDetails_C::OverlayGradient' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, OverlayGradientDetails) == 0x000858, "Member 'UStoreMain_OfferDetails_C::OverlayGradientDetails' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, OverlaySalePrice) == 0x000860, "Member 'UStoreMain_OfferDetails_C::OverlaySalePrice' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, SafeZoneCloseButton) == 0x000868, "Member 'UStoreMain_OfferDetails_C::SafeZoneCloseButton' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, SafeZoneMTX) == 0x000870, "Member 'UStoreMain_OfferDetails_C::SafeZoneMTX' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, StoreMain_OfferDetailsAttribute1) == 0x000878, "Member 'UStoreMain_OfferDetails_C::StoreMain_OfferDetailsAttribute1' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, StoreMain_OfferDetailsAttribute2) == 0x000880, "Member 'UStoreMain_OfferDetails_C::StoreMain_OfferDetailsAttribute2' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, TextDescription) == 0x000888, "Member 'UStoreMain_OfferDetails_C::TextDescription' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, TextName) == 0x000890, "Member 'UStoreMain_OfferDetails_C::TextName' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, TextOfferDisplayPrice) == 0x000898, "Member 'UStoreMain_OfferDetails_C::TextOfferDisplayPrice' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, TextOriginalPrice) == 0x0008A0, "Member 'UStoreMain_OfferDetails_C::TextOriginalPrice' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, VBoxOfferInfo) == 0x0008A8, "Member 'UStoreMain_OfferDetails_C::VBoxOfferInfo' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, VBuckHighlight) == 0x0008B0, "Member 'UStoreMain_OfferDetails_C::VBuckHighlight' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, ABAssetCollection) == 0x0008B8, "Member 'UStoreMain_OfferDetails_C::ABAssetCollection' has a wrong offset!");

}

