#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TooltipMinusBasicMinusS

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Tooltip-Basic-S.Tooltip-Basic-S_C
// 0x0088 (0x0310 - 0x0288)
class UTooltipMinusBasicMinusS_C final  : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0288(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 _hr_;                                              // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Body_HBox;                                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Header_HBox;                                       // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconMinusHeader;                                   // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                SpacerMinusIcon;                                   // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextMinusBody;                                     // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextMinusHeader;                                   // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   BodyText;                                          // 0x02C8(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   HeaderText;                                        // 0x02E0(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class USlateBrushAsset*                       Icon_Brush;                                        // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UClass*                                 Body_Style;                                        // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UClass*                                 Header_Style;                                      // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TooltipMinusBasicMinusS(int32 EntryPoint, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, bool Temp_bool_Variable, ESlateVisibility Temp_byte_Variable_2, ESlateVisibility Temp_byte_Variable_3, bool Temp_bool_Variable_1, ESlateVisibility Temp_byte_Variable_4, ESlateVisibility Temp_byte_Variable_5, bool Temp_bool_Variable_2, ESlateVisibility Temp_byte_Variable_6, ESlateVisibility Temp_byte_Variable_7, bool Temp_bool_Variable_3, ESlateVisibility Temp_byte_Variable_8, ESlateVisibility Temp_byte_Variable_9, bool CallFunc_TextIsEmpty_ReturnValue, bool CallFunc_TextIsEmpty_ReturnValue_1, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue_1, ESlateVisibility K2Node_Select_Default, ESlateVisibility K2Node_Select_Default_1, bool CallFunc_IsValid_ReturnValue, bool CallFunc_BooleanOR_ReturnValue, bool CallFunc_BooleanOR_ReturnValue_1, ESlateVisibility K2Node_Select_Default_2, ESlateVisibility K2Node_Select_Default_3, bool CallFunc_IsValidClass_ReturnValue, bool CallFunc_IsValidClass_ReturnValue_1, bool Temp_bool_Variable_4, ESlateVisibility K2Node_Select_Default_4);
	void Construct();
	class FText Get_Body_Text();
	class FText Get_Header_Text();
	struct FSlateBrush Get_Icon_Brush(const struct FSlateBrush& CallFunc_MakeBrushFromAsset_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Tooltip-Basic-S_C">();
	}
	static class UTooltipMinusBasicMinusS_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTooltipMinusBasicMinusS_C>();
	}
};
static_assert(alignof(UTooltipMinusBasicMinusS_C) == 0x000008, "Wrong alinment on UTooltipMinusBasicMinusS_C");
static_assert(sizeof(UTooltipMinusBasicMinusS_C) == 0x000310, "Wrong size on UTooltipMinusBasicMinusS_C");
static_assert(offsetof(UTooltipMinusBasicMinusS_C, UberGraphFrame) == 0x000288, "Member 'UTooltipMinusBasicMinusS_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTooltipMinusBasicMinusS_C, _hr_) == 0x000290, "Member 'UTooltipMinusBasicMinusS_C::_hr_' has a wrong offset!");
static_assert(offsetof(UTooltipMinusBasicMinusS_C, Body_HBox) == 0x000298, "Member 'UTooltipMinusBasicMinusS_C::Body_HBox' has a wrong offset!");
static_assert(offsetof(UTooltipMinusBasicMinusS_C, Header_HBox) == 0x0002A0, "Member 'UTooltipMinusBasicMinusS_C::Header_HBox' has a wrong offset!");
static_assert(offsetof(UTooltipMinusBasicMinusS_C, IconMinusHeader) == 0x0002A8, "Member 'UTooltipMinusBasicMinusS_C::IconMinusHeader' has a wrong offset!");
static_assert(offsetof(UTooltipMinusBasicMinusS_C, SpacerMinusIcon) == 0x0002B0, "Member 'UTooltipMinusBasicMinusS_C::SpacerMinusIcon' has a wrong offset!");
static_assert(offsetof(UTooltipMinusBasicMinusS_C, TextMinusBody) == 0x0002B8, "Member 'UTooltipMinusBasicMinusS_C::TextMinusBody' has a wrong offset!");
static_assert(offsetof(UTooltipMinusBasicMinusS_C, TextMinusHeader) == 0x0002C0, "Member 'UTooltipMinusBasicMinusS_C::TextMinusHeader' has a wrong offset!");
static_assert(offsetof(UTooltipMinusBasicMinusS_C, BodyText) == 0x0002C8, "Member 'UTooltipMinusBasicMinusS_C::BodyText' has a wrong offset!");
static_assert(offsetof(UTooltipMinusBasicMinusS_C, HeaderText) == 0x0002E0, "Member 'UTooltipMinusBasicMinusS_C::HeaderText' has a wrong offset!");
static_assert(offsetof(UTooltipMinusBasicMinusS_C, Icon_Brush) == 0x0002F8, "Member 'UTooltipMinusBasicMinusS_C::Icon_Brush' has a wrong offset!");
static_assert(offsetof(UTooltipMinusBasicMinusS_C, Body_Style) == 0x000300, "Member 'UTooltipMinusBasicMinusS_C::Body_Style' has a wrong offset!");
static_assert(offsetof(UTooltipMinusBasicMinusS_C, Header_Style) == 0x000308, "Member 'UTooltipMinusBasicMinusS_C::Header_Style' has a wrong offset!");

}

