#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TooltipMinusCustomMinusS

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Tooltip-Custom-S.Tooltip-Custom-S_C
// 0x0070 (0x02D0 - 0x0260)
class UTooltipMinusCustomMinusS_C final  : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 _hr_;                                              // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Body_HBox;                                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             Content_Slot;                                      // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Header_HBox;                                       // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconMinusHeader;                                   // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                SpacerMinusHeader;                                 // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                SpacerMinusIcon;                                   // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextMinusHeader;                                   // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   HeaderText;                                        // 0x02A8(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class USlateBrushAsset*                       Icon_Brush;                                        // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UUserWidget*                            ContentWidget;                                     // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TooltipMinusCustomMinusS(int32 EntryPoint, bool Temp_bool_Variable, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, bool Temp_bool_Variable_1, ESlateVisibility Temp_byte_Variable_2, ESlateVisibility Temp_byte_Variable_3, bool Temp_bool_Variable_2, ESlateVisibility Temp_byte_Variable_4, ESlateVisibility Temp_byte_Variable_5, bool Temp_bool_Variable_3, ESlateVisibility Temp_byte_Variable_6, ESlateVisibility Temp_byte_Variable_7, bool CallFunc_TextIsEmpty_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, ESlateVisibility K2Node_Select_Default, ESlateVisibility K2Node_Select_Default_1, bool CallFunc_BooleanOR_ReturnValue, ESlateVisibility K2Node_Select_Default_2, bool CallFunc_IsValid_ReturnValue_1, class UPanelSlot* CallFunc_AddChild_ReturnValue, ESlateVisibility K2Node_Select_Default_3);
	void Construct();
	class FText Get_Body_Text();
	class FText Get_Header_Text();
	struct FSlateBrush Get_Icon_Brush(const struct FSlateBrush& CallFunc_MakeBrushFromAsset_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Tooltip-Custom-S_C">();
	}
	static class UTooltipMinusCustomMinusS_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTooltipMinusCustomMinusS_C>();
	}
};
static_assert(alignof(UTooltipMinusCustomMinusS_C) == 0x000008, "Wrong alinment on UTooltipMinusCustomMinusS_C");
static_assert(sizeof(UTooltipMinusCustomMinusS_C) == 0x0002D0, "Wrong size on UTooltipMinusCustomMinusS_C");
static_assert(offsetof(UTooltipMinusCustomMinusS_C, UberGraphFrame) == 0x000260, "Member 'UTooltipMinusCustomMinusS_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTooltipMinusCustomMinusS_C, _hr_) == 0x000268, "Member 'UTooltipMinusCustomMinusS_C::_hr_' has a wrong offset!");
static_assert(offsetof(UTooltipMinusCustomMinusS_C, Body_HBox) == 0x000270, "Member 'UTooltipMinusCustomMinusS_C::Body_HBox' has a wrong offset!");
static_assert(offsetof(UTooltipMinusCustomMinusS_C, Content_Slot) == 0x000278, "Member 'UTooltipMinusCustomMinusS_C::Content_Slot' has a wrong offset!");
static_assert(offsetof(UTooltipMinusCustomMinusS_C, Header_HBox) == 0x000280, "Member 'UTooltipMinusCustomMinusS_C::Header_HBox' has a wrong offset!");
static_assert(offsetof(UTooltipMinusCustomMinusS_C, IconMinusHeader) == 0x000288, "Member 'UTooltipMinusCustomMinusS_C::IconMinusHeader' has a wrong offset!");
static_assert(offsetof(UTooltipMinusCustomMinusS_C, SpacerMinusHeader) == 0x000290, "Member 'UTooltipMinusCustomMinusS_C::SpacerMinusHeader' has a wrong offset!");
static_assert(offsetof(UTooltipMinusCustomMinusS_C, SpacerMinusIcon) == 0x000298, "Member 'UTooltipMinusCustomMinusS_C::SpacerMinusIcon' has a wrong offset!");
static_assert(offsetof(UTooltipMinusCustomMinusS_C, TextMinusHeader) == 0x0002A0, "Member 'UTooltipMinusCustomMinusS_C::TextMinusHeader' has a wrong offset!");
static_assert(offsetof(UTooltipMinusCustomMinusS_C, HeaderText) == 0x0002A8, "Member 'UTooltipMinusCustomMinusS_C::HeaderText' has a wrong offset!");
static_assert(offsetof(UTooltipMinusCustomMinusS_C, Icon_Brush) == 0x0002C0, "Member 'UTooltipMinusCustomMinusS_C::Icon_Brush' has a wrong offset!");
static_assert(offsetof(UTooltipMinusCustomMinusS_C, ContentWidget) == 0x0002C8, "Member 'UTooltipMinusCustomMinusS_C::ContentWidget' has a wrong offset!");

}

