#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TournamentEventWindowDetails

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TournamentEventWindowDetails.TournamentEventWindowDetails_C
// 0x00F8 (0x07B0 - 0x06B8)
class UTournamentEventWindowDetails_C final  : public UFortShowdownDetailView
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PayoutHover;                                       // 0x06C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       LeaderboardHover;                                  // 0x06C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       RefreshData;                                       // 0x06D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       RefreshTime;                                       // 0x06D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       RefreshDate;                                       // 0x06E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_SubheaderBG;                                // 0x06E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEventsSimpleButton_C*                  Button_Leaderboard;                                // 0x06F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEventsSimpleButton_C*                  Button_Payout;                                     // 0x06F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_LeaderboardButtonBG;                  // 0x0700(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_PayoutButtonBG;                       // 0x0708(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_StartingScore;                        // 0x0710(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  CommonWidgetSwitcher_isFuture;                     // 0x0718(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEventScoreRow_C*                       EliminationsInfo;                                  // 0x0720(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       EventDateText;                                     // 0x0728(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_SquadInfoContainer;                  // 0x0730(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEventScoreBigStat_C*                   MatchesPlayedInfo;                                 // 0x0738(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       MatchTypeText;                                     // 0x0740(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_LeaderboardButton;                         // 0x0748(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_PayoutButton;                              // 0x0750(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEventScoreRow_C*                       PlacementInfo;                                     // 0x0758(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEventScoreBigStat_C*                   PointsScoredInfo;                                  // 0x0760(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RichTextBlock_OtherReason;                         // 0x0768(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_BusFare;                                      // 0x0770(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TournamentContextText;                             // 0x0778(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEventScoreRow_C*                       VictoryRoyaleInfo;                                 // 0x0780(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             ViewLeaderboard;                                   // 0x0788(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          AllowLeaderboardAccess;                            // 0x0798(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C47[0x7];                                     // 0x0799(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             ViewPayouts;                                       // 0x07A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void RefreshDataBP();
	void EventColorize();
	void BndEvt__Button_Leaderboard_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__Button_Leaderboard_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__Button_Leaderboard_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__Button_Payout_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__Button_Payout_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__Button_Payout_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void ExecuteUbergraph_TournamentEventWindowDetails(int32 EntryPoint, const class FString& CallFunc_GetTournamentId_ReturnValue, int32 Temp_int_Variable, EFortEventWindowEligibility Temp_byte_Variable, class FText Temp_text_Variable, class FText Temp_text_Variable_1, class FText Temp_text_Variable_2, class FText Temp_text_Variable_3, EFortEventWindowEligibility Temp_byte_Variable_1, class FText Temp_text_Variable_4, class FText Temp_text_Variable_5, class FText Temp_text_Variable_6, class FText Temp_text_Variable_7, EFortEventWindowEligibility Temp_byte_Variable_2, class FText Temp_text_Variable_8, class FText Temp_text_Variable_9, class FText Temp_text_Variable_10, class FText Temp_text_Variable_11, EFortEventWindowEligibility Temp_byte_Variable_3, class FText Temp_text_Variable_12, class FText Temp_text_Variable_13, class FText Temp_text_Variable_14, class FText Temp_text_Variable_15, bool Temp_bool_Variable, ESlateVisibility Temp_byte_Variable_4, ESlateVisibility Temp_byte_Variable_5, bool Temp_bool_Variable_1, class FText Temp_text_Variable_16, bool Temp_bool_Variable_2, ESlateVisibility Temp_byte_Variable_6, ESlateVisibility Temp_byte_Variable_7, int32 Temp_int_Variable_1, int32 Temp_int_Variable_2, int32 Temp_int_Variable_3, int32 Temp_int_Variable_4, int32 Temp_int_Variable_5, int32 Temp_int_Variable_6, int32 Temp_int_Variable_7, int32 Temp_int_Variable_8, int32 Temp_int_Variable_9, int32 Temp_int_Variable_10, EFortShowdownEventState Temp_byte_Variable_8, float Temp_float_Variable, class FText Temp_text_Variable_17, class FText Temp_text_Variable_18, class FText Temp_text_Variable_19, class FText Temp_text_Variable_20, class FText Temp_text_Variable_21, class FText Temp_text_Variable_22, class FText Temp_text_Variable_23, class FText Temp_text_Variable_24, EFortShowdownEventState Temp_byte_Variable_9, ESlateVisibility Temp_byte_Variable_10, ESlateVisibility Temp_byte_Variable_11, bool Temp_bool_Variable_3, class FText CallFunc_GetText_ReturnValue, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue, ESlateVisibility Temp_byte_Variable_12, class FText CallFunc_Conv_StringToText_ReturnValue, ESlateVisibility Temp_byte_Variable_13, class FText CallFunc_TextToUpper_ReturnValue, EFortShowdownMatchType CallFunc_GetTournamentMatchType_ReturnValue, bool CallFunc_NotEqual_ByteByte_ReturnValue, float CallFunc_PauseAnimation_ReturnValue, float CallFunc_GetStartTime_ReturnValue, float CallFunc_PauseAnimation_ReturnValue_1, bool CallFunc_LessEqual_FloatFloat_ReturnValue, float CallFunc_Add_FloatFloat_ReturnValue, float CallFunc_GetEndTime_ReturnValue, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue_1, float CallFunc_Subtract_FloatFloat_ReturnValue, int32 CallFunc_GetTournamentPinUnlockScore_ReturnValue, bool Temp_bool_Variable_4, const struct FFortShowdownEventBestResultsSummary& CallFunc_GetEventResultsSummary_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, ESlateVisibility K2Node_Select_Default, const struct FSlateColor& K2Node_MakeStruct_SlateColor, int32 CallFunc_GetTournamentMatchCap_ReturnValue, float Temp_float_Variable_1, class UCommonButton* K2Node_ComponentBoundEvent_Button_5, bool CallFunc_IsEventLeaderboardAvailable_ReturnValue, bool CallFunc_IsEventLeaderboardAvailable_ReturnValue_1, const class FString& CallFunc_GetTournamentId_ReturnValue_1, const class FString& CallFunc_GetEventId_ReturnValue, bool Temp_bool_Variable_5, class UCommonButton* K2Node_ComponentBoundEvent_Button_4, float K2Node_Select_Default_1, class UCommonButton* K2Node_ComponentBoundEvent_Button_3, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue_2, float CallFunc_PauseAnimation_ReturnValue_2, float CallFunc_GetStartTime_ReturnValue_1, float CallFunc_PauseAnimation_ReturnValue_3, bool CallFunc_LessEqual_FloatFloat_ReturnValue_1, float CallFunc_Add_FloatFloat_ReturnValue_1, float CallFunc_GetEndTime_ReturnValue_1, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue_3, float CallFunc_Subtract_FloatFloat_ReturnValue_1, float CallFunc_PauseAnimation_ReturnValue_4, float CallFunc_GetStartTime_ReturnValue_2, float CallFunc_PauseAnimation_ReturnValue_5, bool CallFunc_LessEqual_FloatFloat_ReturnValue_2, float CallFunc_Add_FloatFloat_ReturnValue_2, float CallFunc_GetEndTime_ReturnValue_2, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue_4, float CallFunc_Subtract_FloatFloat_ReturnValue_2, float Temp_float_Variable_2, bool CallFunc_BooleanAND_ReturnValue_1, int32 CallFunc_GetEventWindowSessionNumber_ReturnValue, ESlateVisibility K2Node_Select_Default_2, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array, bool Temp_bool_Variable_6, class FText CallFunc_Format_ReturnValue, class FText CallFunc_TextToUpper_ReturnValue_1, EFortEventWindowEligibility CallFunc_GetEventWindowEligibility_ReturnValue, class FText K2Node_Select_Default_3, class FText K2Node_Select_Default_4, bool Temp_bool_Variable_7, class FText K2Node_Select_Default_5, EFortEventWindowEligibility CallFunc_GetEventWindowEligibility_ReturnValue_1, float K2Node_Select_Default_6, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue_5, class FText K2Node_Select_Default_7, float Temp_float_Variable_3, const struct FFortShowdownEventBestResultsSummary& CallFunc_GetEventResultsSummary_ReturnValue_1, const struct FDateTime& CallFunc_GetEventBeginTime_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_1, class FText CallFunc_GetEventDateAsText_ReturnValue, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array_1, bool CallFunc_NotEqual_IntInt_ReturnValue, class FText CallFunc_Format_ReturnValue_1, ESlateVisibility K2Node_Select_Default_8, const struct FDateTime& CallFunc_GetEventEndTime_ReturnValue, class FText CallFunc_GetEventDateAsText_ReturnValue_1, bool CallFunc_EqualEqual_TextText_ReturnValue, const struct FDateTime& CallFunc_GetEventBeginTime_ReturnValue_1, class FText CallFunc_GetEventTimeAsText_ReturnValue, const struct FDateTime& CallFunc_GetEventEndTime_ReturnValue_1, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_2, class FText CallFunc_GetEventTimeAsText_ReturnValue_1, bool Temp_bool_Variable_8, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_3, const struct FDateTime& CallFunc_GetEventBeginTime_ReturnValue_2, float K2Node_Select_Default_9, class FText CallFunc_GetEventDateAsText_ReturnValue_2, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue_6, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_4, const struct FDateTime& CallFunc_GetEventEndTime_ReturnValue_2, float Temp_float_Variable_4, class FText CallFunc_GetEventDateAsText_ReturnValue_3, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_5, EFortShowdownEventState CallFunc_GetEventTimeState_ReturnValue, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array_2, class FText CallFunc_Format_ReturnValue_2, class FText K2Node_Select_Default_10, class FText K2Node_Select_Default_11, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_6, EFortShowdownEventState CallFunc_GetEventPlayerParticipationState_ReturnValue, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array_3, class FText CallFunc_Format_ReturnValue_3, int32 K2Node_Select_Default_12, bool CallFunc_NotEqual_TextText_ReturnValue, bool CallFunc_IsEventLeaderboardAvailable_ReturnValue_2, class UCommonButton* K2Node_ComponentBoundEvent_Button_2, ESlateVisibility K2Node_Select_Default_13, const class FString& CallFunc_GetEventId_ReturnValue_1, float CallFunc_PauseAnimation_ReturnValue_6, float CallFunc_GetStartTime_ReturnValue_3, float CallFunc_PauseAnimation_ReturnValue_7, bool CallFunc_LessEqual_FloatFloat_ReturnValue_3, float CallFunc_Add_FloatFloat_ReturnValue_3, float CallFunc_GetEndTime_ReturnValue_3, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue_7, float CallFunc_Subtract_FloatFloat_ReturnValue_3, float CallFunc_PauseAnimation_ReturnValue_8, float CallFunc_GetStartTime_ReturnValue_4, float CallFunc_PauseAnimation_ReturnValue_9, bool CallFunc_LessEqual_FloatFloat_ReturnValue_4, float CallFunc_Add_FloatFloat_ReturnValue_4, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue_8, float CallFunc_GetEndTime_ReturnValue_4, class UCommonButton* K2Node_ComponentBoundEvent_Button_1, float CallFunc_Subtract_FloatFloat_ReturnValue_4, class UCommonButton* K2Node_ComponentBoundEvent_Button, float K2Node_Select_Default_14, bool Temp_bool_Variable_9, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue_9, float K2Node_Select_Default_15, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue_10);
	void ViewPayouts__DelegateSignature(const class FString& EventWindowId, const class FString& EventId);
	void ViewLeaderboard__DelegateSignature(const class FString& TournamentId, const class FString& EventId);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TournamentEventWindowDetails_C">();
	}
	static class UTournamentEventWindowDetails_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTournamentEventWindowDetails_C>();
	}
};
static_assert(alignof(UTournamentEventWindowDetails_C) == 0x000008, "Wrong alinment on UTournamentEventWindowDetails_C");
static_assert(sizeof(UTournamentEventWindowDetails_C) == 0x0007B0, "Wrong size on UTournamentEventWindowDetails_C");
static_assert(offsetof(UTournamentEventWindowDetails_C, UberGraphFrame) == 0x0006B8, "Member 'UTournamentEventWindowDetails_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTournamentEventWindowDetails_C, PayoutHover) == 0x0006C0, "Member 'UTournamentEventWindowDetails_C::PayoutHover' has a wrong offset!");
static_assert(offsetof(UTournamentEventWindowDetails_C, LeaderboardHover) == 0x0006C8, "Member 'UTournamentEventWindowDetails_C::LeaderboardHover' has a wrong offset!");
static_assert(offsetof(UTournamentEventWindowDetails_C, RefreshData) == 0x0006D0, "Member 'UTournamentEventWindowDetails_C::RefreshData' has a wrong offset!");
static_assert(offsetof(UTournamentEventWindowDetails_C, RefreshTime) == 0x0006D8, "Member 'UTournamentEventWindowDetails_C::RefreshTime' has a wrong offset!");
static_assert(offsetof(UTournamentEventWindowDetails_C, RefreshDate) == 0x0006E0, "Member 'UTournamentEventWindowDetails_C::RefreshDate' has a wrong offset!");
static_assert(offsetof(UTournamentEventWindowDetails_C, Border_SubheaderBG) == 0x0006E8, "Member 'UTournamentEventWindowDetails_C::Border_SubheaderBG' has a wrong offset!");
static_assert(offsetof(UTournamentEventWindowDetails_C, Button_Leaderboard) == 0x0006F0, "Member 'UTournamentEventWindowDetails_C::Button_Leaderboard' has a wrong offset!");
static_assert(offsetof(UTournamentEventWindowDetails_C, Button_Payout) == 0x0006F8, "Member 'UTournamentEventWindowDetails_C::Button_Payout' has a wrong offset!");
static_assert(offsetof(UTournamentEventWindowDetails_C, CommonBorder_LeaderboardButtonBG) == 0x000700, "Member 'UTournamentEventWindowDetails_C::CommonBorder_LeaderboardButtonBG' has a wrong offset!");
static_assert(offsetof(UTournamentEventWindowDetails_C, CommonBorder_PayoutButtonBG) == 0x000708, "Member 'UTournamentEventWindowDetails_C::CommonBorder_PayoutButtonBG' has a wrong offset!");
static_assert(offsetof(UTournamentEventWindowDetails_C, CommonBorder_StartingScore) == 0x000710, "Member 'UTournamentEventWindowDetails_C::CommonBorder_StartingScore' has a wrong offset!");
static_assert(offsetof(UTournamentEventWindowDetails_C, CommonWidgetSwitcher_isFuture) == 0x000718, "Member 'UTournamentEventWindowDetails_C::CommonWidgetSwitcher_isFuture' has a wrong offset!");
static_assert(offsetof(UTournamentEventWindowDetails_C, EliminationsInfo) == 0x000720, "Member 'UTournamentEventWindowDetails_C::EliminationsInfo' has a wrong offset!");
static_assert(offsetof(UTournamentEventWindowDetails_C, EventDateText) == 0x000728, "Member 'UTournamentEventWindowDetails_C::EventDateText' has a wrong offset!");
static_assert(offsetof(UTournamentEventWindowDetails_C, HorizontalBox_SquadInfoContainer) == 0x000730, "Member 'UTournamentEventWindowDetails_C::HorizontalBox_SquadInfoContainer' has a wrong offset!");
static_assert(offsetof(UTournamentEventWindowDetails_C, MatchesPlayedInfo) == 0x000738, "Member 'UTournamentEventWindowDetails_C::MatchesPlayedInfo' has a wrong offset!");
static_assert(offsetof(UTournamentEventWindowDetails_C, MatchTypeText) == 0x000740, "Member 'UTournamentEventWindowDetails_C::MatchTypeText' has a wrong offset!");
static_assert(offsetof(UTournamentEventWindowDetails_C, Overlay_LeaderboardButton) == 0x000748, "Member 'UTournamentEventWindowDetails_C::Overlay_LeaderboardButton' has a wrong offset!");
static_assert(offsetof(UTournamentEventWindowDetails_C, Overlay_PayoutButton) == 0x000750, "Member 'UTournamentEventWindowDetails_C::Overlay_PayoutButton' has a wrong offset!");
static_assert(offsetof(UTournamentEventWindowDetails_C, PlacementInfo) == 0x000758, "Member 'UTournamentEventWindowDetails_C::PlacementInfo' has a wrong offset!");
static_assert(offsetof(UTournamentEventWindowDetails_C, PointsScoredInfo) == 0x000760, "Member 'UTournamentEventWindowDetails_C::PointsScoredInfo' has a wrong offset!");
static_assert(offsetof(UTournamentEventWindowDetails_C, RichTextBlock_OtherReason) == 0x000768, "Member 'UTournamentEventWindowDetails_C::RichTextBlock_OtherReason' has a wrong offset!");
static_assert(offsetof(UTournamentEventWindowDetails_C, Text_BusFare) == 0x000770, "Member 'UTournamentEventWindowDetails_C::Text_BusFare' has a wrong offset!");
static_assert(offsetof(UTournamentEventWindowDetails_C, TournamentContextText) == 0x000778, "Member 'UTournamentEventWindowDetails_C::TournamentContextText' has a wrong offset!");
static_assert(offsetof(UTournamentEventWindowDetails_C, VictoryRoyaleInfo) == 0x000780, "Member 'UTournamentEventWindowDetails_C::VictoryRoyaleInfo' has a wrong offset!");
static_assert(offsetof(UTournamentEventWindowDetails_C, ViewLeaderboard) == 0x000788, "Member 'UTournamentEventWindowDetails_C::ViewLeaderboard' has a wrong offset!");
static_assert(offsetof(UTournamentEventWindowDetails_C, AllowLeaderboardAccess) == 0x000798, "Member 'UTournamentEventWindowDetails_C::AllowLeaderboardAccess' has a wrong offset!");
static_assert(offsetof(UTournamentEventWindowDetails_C, ViewPayouts) == 0x0007A0, "Member 'UTournamentEventWindowDetails_C::ViewPayouts' has a wrong offset!");

}

