#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trap_Athena_Spikes

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Trap_Athena_Spikes.Trap_Athena_Spikes_C
// 0x0128 (0x0DD0 - 0x0CA8)
class ATrap_Athena_Spikes_C : public ABuildingTrap
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0CA8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Spike_Mesh;                                        // 0x0CB0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Trigger;                                           // 0x0CB8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Root;                                              // 0x0CC0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         ResetSpikes_LERP_D054F7574E7A1041A552A5805E6C81D1; // 0x0CC8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ResetSpikes__Direction_D054F7574E7A1041A552A5805E6C81D1; // 0x0CCC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C2A[0x3];                                     // 0x0CCD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     ResetSpikes;                                       // 0x0CD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Retract_LERP_714CAEE5449A32850D6231AEDA918B58;     // 0x0CD8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Retract__Direction_714CAEE5449A32850D6231AEDA918B58; // 0x0CDC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C2B[0x3];                                     // 0x0CDD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Retract;                                           // 0x0CE0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Fire_LERP_630B749B437E5CB83CB49287CC92E385;        // 0x0CE8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Fire__Direction_630B749B437E5CB83CB49287CC92E385;  // 0x0CEC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C2C[0x3];                                     // 0x0CED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Fire;                                              // 0x0CF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Place_Trap_Sound;                                  // 0x0CF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Trap_Active_Sound;                                 // 0x0D00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Reload_Sound;                                      // 0x0D08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Trap_Explode_Sound;                                // 0x0D10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Trap_Fire_Sound;                                   // 0x0D18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpikeRestingScale;                                 // 0x0D20(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpikeActiveScale;                                  // 0x0D24(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpikeHoldOnFireLength;                             // 0x0D28(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C2D[0x4];                                     // 0x0D2C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               SpikesMID;                                         // 0x0D30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SweepExponent;                                     // 0x0D38(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           SweepColor;                                        // 0x0D3C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SweepSpeed;                                        // 0x0D4C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     FriendlyTrapMaterial;                              // 0x0D50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     NormalSpikeMaterial;                               // 0x0D58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPlayFewerSounds;                                  // 0x0D60(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C2E[0x7];                                     // 0x0D61(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortPortableSoftParticles             DeathParticle_Marshalled;                          // 0x0D68(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRotator                               Trap_Particle_Placement_Rotation;                  // 0x0DC0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_Trap_Athena_Spikes(int32 EntryPoint, bool Temp_bool_Option_B___If_false__use_Option_A_Variable, bool CallFunc_IsDedicatedServer_ReturnValue, const struct FParticleSysParam& K2Node_MakeStruct_ParticleSysParam, float CallFunc_BreakVector_X, float CallFunc_BreakVector_Y, float CallFunc_BreakVector_Z, const struct FVector& CallFunc_Multiply_VectorVector_ReturnValue, float CallFunc_Multiply_FloatFloat_ReturnValue, float CallFunc_Multiply_FloatFloat_ReturnValue_1, const struct FVector& CallFunc_MakeVector_ReturnValue, const struct FVector& CallFunc_MakeVector_ReturnValue_1, const struct FVector& CallFunc_Multiply_VectorVector_ReturnValue_1, const struct FVector& CallFunc_Multiply_VectorVector_ReturnValue_2, const struct FParticleSysParam& K2Node_MakeStruct_ParticleSysParam_1, const struct FParticleSysParam& K2Node_MakeStruct_ParticleSysParam_2, const struct FParticleSysParam& K2Node_MakeStruct_ParticleSysParam_3, const struct FVector& CallFunc_Multiply_VectorVector_ReturnValue_3, const struct FParticleSysParam& K2Node_MakeStruct_ParticleSysParam_4, const struct FParticleSysParam& K2Node_MakeStruct_ParticleSysParam_5, const struct FParticleSysParam& K2Node_MakeStruct_ParticleSysParam_6, TArray<struct FParticleSysParam>& K2Node_MakeArray_Array, bool Temp_bool_Has_Been_Initd_Variable, const struct FFortPortableSoftParticles& K2Node_MakeStruct_FortPortableSoftParticles, bool CallFunc_IsDedicatedServer_ReturnValue_1, TMap<class FName, struct FParameterNameMapping>& K2Node_MakeMap_Map, bool Temp_bool_IsClosed_Variable, bool CallFunc_IsValid_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, class UObject* Temp_object_Variable, class UObject* K2Node_CustomEvent_Loaded, class UFXSystemAsset* K2Node_DynamicCast_AsFXSystem_Asset, bool K2Node_DynamicCast_bSuccess, bool Temp_bool_Variable, uint8 CallFunc_MakeLiteralByte_ReturnValue, class UFXSystemAsset* Temp_object_Variable_1, const struct FFortPortableSoftParticles& K2Node_MakeStruct_FortPortableSoftParticles_1, bool Temp_bool_Variable_1, bool CallFunc_IsValidSoftObjectReference_ReturnValue, bool CallFunc_IsValidSoftObjectReference_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue, class UObject* Temp_object_Variable_2, class UObject* K2Node_CustomEvent_Loaded_1, class UFXSystemAsset* K2Node_DynamicCast_AsFXSystem_Asset_1, bool K2Node_DynamicCast_bSuccess_1, class UFXSystemAsset* K2Node_Select_Default, bool Temp_bool_Variable_2, float Temp_float_Variable, bool CallFunc_LessEqual_FloatFloat_ReturnValue, bool Temp_bool_Variable_3, const struct FFortPortableSoftParticles& K2Node_Select_Default_1, TDelegate<void(class UObject* Loaded)> K2Node_CreateDelegate_OutputDelegate, const struct FFortPortableSoftParticles& K2Node_SetFieldsInStruct_StructOut, bool CallFunc_IsNiagaraEffectEnabledSoftPtr_ReturnValue, TSoftObjectPtr<class UFXSystemAsset> K2Node_Select_Default_2, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_1, class APlayerCameraManager* CallFunc_GetPlayerCameraManager_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, const struct FVector& CallFunc_GetCameraLocation_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_2, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_3, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_4, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_5, EGameplayCueEvent K2Node_GameplayCueEvent_EventType, const struct FGameplayCueParameters& K2Node_GameplayCueEvent_Parameters, bool K2Node_SwitchEnum_CmpSuccess, float CallFunc_Lerp_ReturnValue, TDelegate<void(class UObject* Loaded)> K2Node_CreateDelegate_OutputDelegate_1, float CallFunc_Lerp_ReturnValue_1, float CallFunc_Lerp_ReturnValue_2, bool CallFunc_IsValid_ReturnValue_2, class UFXSystemComponent* CallFunc_SpawnFXSystemAttached_ReturnValue, bool CallFunc_IsValid_ReturnValue_3, bool CallFunc_IsValid_ReturnValue_4, TArray<struct FParticleSysParam>& CallFunc_MapParticleInstanceParamNames_ReturnValue, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue, float CallFunc_VSize_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_6, TArray<EFortTeamAffiliation>& K2Node_MakeArray_Array_1, uint8 CallFunc_GetActorTeam_ReturnValue, bool CallFunc_IsNiagaraEffectEnabledSoftPtr_ReturnValue_1, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_7, class UFXSystemComponent* CallFunc_SpawnFXAtLocation_ReturnValue, TSoftObjectPtr<class UFXSystemAsset> K2Node_Select_Default_3);
	void OnInitTeam();
	void OnWorldReady();
	void OnOutOfDurability();
	void GameplayCue_Abilities_Activation_Traps_ActivateTrap(EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void OnFinishedBuilding();
	void OnPlaced();
	void OnReloadEnd();
	void OnLoaded_8A9D6DF7414FFDD42BE9FCB155F39B4D(class UObject* Loaded);
	void OnLoaded_8E622EE64F2AF153BE7162BA1D8EBCC1(class UObject* Loaded);
	void ResetSpikes__UpdateFunc();
	void ResetSpikes__FinishedFunc();
	void Retract__Sounds__EventFunc();
	void Retract__UpdateFunc();
	void Retract__FinishedFunc();
	void Fire__UpdateFunc();
	void Fire__FinishedFunc();
	void UserConstructionScript(class UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue);
	void SetSpikePosition(float NewSpikePosition, const struct FVector& CallFunc_MakeVector_ReturnValue);
	void MaterialSweepOnSpikes(float Param_SweepSpeed, const struct FLinearColor& Param_SweepColor, float Param_SweepExponent, float Temp_float_Variable, float CallFunc_GetGameTimeInSeconds_ReturnValue, float CallFunc_Multiply_FloatFloat_ReturnValue);
	void _ChangeToFriendlyMaterial(ESubGame CallFunc_GetSubGame_ReturnValue, TArray<class AFortPlayerController*>& CallFunc_GetLocalFortPlayerControllers_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue, class AFortPlayerController* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, uint8 CallFunc_GetActorTeam_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue);
	void ChangeToNormalMaterial();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Trap_Athena_Spikes_C">();
	}
	static class ATrap_Athena_Spikes_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATrap_Athena_Spikes_C>();
	}
};
static_assert(alignof(ATrap_Athena_Spikes_C) == 0x000008, "Wrong alinment on ATrap_Athena_Spikes_C");
static_assert(sizeof(ATrap_Athena_Spikes_C) == 0x000DD0, "Wrong size on ATrap_Athena_Spikes_C");
static_assert(offsetof(ATrap_Athena_Spikes_C, UberGraphFrame) == 0x000CA8, "Member 'ATrap_Athena_Spikes_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATrap_Athena_Spikes_C, Spike_Mesh) == 0x000CB0, "Member 'ATrap_Athena_Spikes_C::Spike_Mesh' has a wrong offset!");
static_assert(offsetof(ATrap_Athena_Spikes_C, Trigger) == 0x000CB8, "Member 'ATrap_Athena_Spikes_C::Trigger' has a wrong offset!");
static_assert(offsetof(ATrap_Athena_Spikes_C, Root) == 0x000CC0, "Member 'ATrap_Athena_Spikes_C::Root' has a wrong offset!");
static_assert(offsetof(ATrap_Athena_Spikes_C, ResetSpikes_LERP_D054F7574E7A1041A552A5805E6C81D1) == 0x000CC8, "Member 'ATrap_Athena_Spikes_C::ResetSpikes_LERP_D054F7574E7A1041A552A5805E6C81D1' has a wrong offset!");
static_assert(offsetof(ATrap_Athena_Spikes_C, ResetSpikes__Direction_D054F7574E7A1041A552A5805E6C81D1) == 0x000CCC, "Member 'ATrap_Athena_Spikes_C::ResetSpikes__Direction_D054F7574E7A1041A552A5805E6C81D1' has a wrong offset!");
static_assert(offsetof(ATrap_Athena_Spikes_C, ResetSpikes) == 0x000CD0, "Member 'ATrap_Athena_Spikes_C::ResetSpikes' has a wrong offset!");
static_assert(offsetof(ATrap_Athena_Spikes_C, Retract_LERP_714CAEE5449A32850D6231AEDA918B58) == 0x000CD8, "Member 'ATrap_Athena_Spikes_C::Retract_LERP_714CAEE5449A32850D6231AEDA918B58' has a wrong offset!");
static_assert(offsetof(ATrap_Athena_Spikes_C, Retract__Direction_714CAEE5449A32850D6231AEDA918B58) == 0x000CDC, "Member 'ATrap_Athena_Spikes_C::Retract__Direction_714CAEE5449A32850D6231AEDA918B58' has a wrong offset!");
static_assert(offsetof(ATrap_Athena_Spikes_C, Retract) == 0x000CE0, "Member 'ATrap_Athena_Spikes_C::Retract' has a wrong offset!");
static_assert(offsetof(ATrap_Athena_Spikes_C, Fire_LERP_630B749B437E5CB83CB49287CC92E385) == 0x000CE8, "Member 'ATrap_Athena_Spikes_C::Fire_LERP_630B749B437E5CB83CB49287CC92E385' has a wrong offset!");
static_assert(offsetof(ATrap_Athena_Spikes_C, Fire__Direction_630B749B437E5CB83CB49287CC92E385) == 0x000CEC, "Member 'ATrap_Athena_Spikes_C::Fire__Direction_630B749B437E5CB83CB49287CC92E385' has a wrong offset!");
static_assert(offsetof(ATrap_Athena_Spikes_C, Fire) == 0x000CF0, "Member 'ATrap_Athena_Spikes_C::Fire' has a wrong offset!");
static_assert(offsetof(ATrap_Athena_Spikes_C, Place_Trap_Sound) == 0x000CF8, "Member 'ATrap_Athena_Spikes_C::Place_Trap_Sound' has a wrong offset!");
static_assert(offsetof(ATrap_Athena_Spikes_C, Trap_Active_Sound) == 0x000D00, "Member 'ATrap_Athena_Spikes_C::Trap_Active_Sound' has a wrong offset!");
static_assert(offsetof(ATrap_Athena_Spikes_C, Reload_Sound) == 0x000D08, "Member 'ATrap_Athena_Spikes_C::Reload_Sound' has a wrong offset!");
static_assert(offsetof(ATrap_Athena_Spikes_C, Trap_Explode_Sound) == 0x000D10, "Member 'ATrap_Athena_Spikes_C::Trap_Explode_Sound' has a wrong offset!");
static_assert(offsetof(ATrap_Athena_Spikes_C, Trap_Fire_Sound) == 0x000D18, "Member 'ATrap_Athena_Spikes_C::Trap_Fire_Sound' has a wrong offset!");
static_assert(offsetof(ATrap_Athena_Spikes_C, SpikeRestingScale) == 0x000D20, "Member 'ATrap_Athena_Spikes_C::SpikeRestingScale' has a wrong offset!");
static_assert(offsetof(ATrap_Athena_Spikes_C, SpikeActiveScale) == 0x000D24, "Member 'ATrap_Athena_Spikes_C::SpikeActiveScale' has a wrong offset!");
static_assert(offsetof(ATrap_Athena_Spikes_C, SpikeHoldOnFireLength) == 0x000D28, "Member 'ATrap_Athena_Spikes_C::SpikeHoldOnFireLength' has a wrong offset!");
static_assert(offsetof(ATrap_Athena_Spikes_C, SpikesMID) == 0x000D30, "Member 'ATrap_Athena_Spikes_C::SpikesMID' has a wrong offset!");
static_assert(offsetof(ATrap_Athena_Spikes_C, SweepExponent) == 0x000D38, "Member 'ATrap_Athena_Spikes_C::SweepExponent' has a wrong offset!");
static_assert(offsetof(ATrap_Athena_Spikes_C, SweepColor) == 0x000D3C, "Member 'ATrap_Athena_Spikes_C::SweepColor' has a wrong offset!");
static_assert(offsetof(ATrap_Athena_Spikes_C, SweepSpeed) == 0x000D4C, "Member 'ATrap_Athena_Spikes_C::SweepSpeed' has a wrong offset!");
static_assert(offsetof(ATrap_Athena_Spikes_C, FriendlyTrapMaterial) == 0x000D50, "Member 'ATrap_Athena_Spikes_C::FriendlyTrapMaterial' has a wrong offset!");
static_assert(offsetof(ATrap_Athena_Spikes_C, NormalSpikeMaterial) == 0x000D58, "Member 'ATrap_Athena_Spikes_C::NormalSpikeMaterial' has a wrong offset!");
static_assert(offsetof(ATrap_Athena_Spikes_C, bPlayFewerSounds) == 0x000D60, "Member 'ATrap_Athena_Spikes_C::bPlayFewerSounds' has a wrong offset!");
static_assert(offsetof(ATrap_Athena_Spikes_C, DeathParticle_Marshalled) == 0x000D68, "Member 'ATrap_Athena_Spikes_C::DeathParticle_Marshalled' has a wrong offset!");
static_assert(offsetof(ATrap_Athena_Spikes_C, Trap_Particle_Placement_Rotation) == 0x000DC0, "Member 'ATrap_Athena_Spikes_C::Trap_Particle_Placement_Rotation' has a wrong offset!");

}

