#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseFortnite_HUDScoreboardComponent

#include "Basic.hpp"


namespace SDK::Params
{

// Function VerseFortnite_HUDScoreboardComponent.HUDScoreboardComponent.restrictMessageToPlayers
// 0x0010 (0x0010 - 0x0000)
struct HUDScoreboardComponent_RestrictMessageToPlayers final 
{
public:
	TArray<class UPlayerComponent*>               __verse_0x33D1A615_playerList;                     // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
};
static_assert(alignof(HUDScoreboardComponent_RestrictMessageToPlayers) == 0x000008, "Wrong alinment on HUDScoreboardComponent_RestrictMessageToPlayers");
static_assert(sizeof(HUDScoreboardComponent_RestrictMessageToPlayers) == 0x000010, "Wrong size on HUDScoreboardComponent_RestrictMessageToPlayers");
static_assert(offsetof(HUDScoreboardComponent_RestrictMessageToPlayers, __verse_0x33D1A615_playerList) == 0x000000, "Member 'HUDScoreboardComponent_RestrictMessageToPlayers::__verse_0x33D1A615_playerList' has a wrong offset!");

// Function VerseFortnite_HUDScoreboardComponent.HUDScoreboardComponent.SetCurrentRound
// 0x0004 (0x0004 - 0x0000)
struct HUDScoreboardComponent_SetCurrentRound final 
{
public:
	int32                                         __verse_0xE3EBEC10_newCurrent;                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HUDScoreboardComponent_SetCurrentRound) == 0x000004, "Wrong alinment on HUDScoreboardComponent_SetCurrentRound");
static_assert(sizeof(HUDScoreboardComponent_SetCurrentRound) == 0x000004, "Wrong size on HUDScoreboardComponent_SetCurrentRound");
static_assert(offsetof(HUDScoreboardComponent_SetCurrentRound, __verse_0xE3EBEC10_newCurrent) == 0x000000, "Member 'HUDScoreboardComponent_SetCurrentRound::__verse_0xE3EBEC10_newCurrent' has a wrong offset!");

// Function VerseFortnite_HUDScoreboardComponent.HUDScoreboardComponent.setNumberOfRounds
// 0x0004 (0x0004 - 0x0000)
struct HUDScoreboardComponent_SetNumberOfRounds final 
{
public:
	int32                                         __verse_0x08B5B3E8_newRounds;                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HUDScoreboardComponent_SetNumberOfRounds) == 0x000004, "Wrong alinment on HUDScoreboardComponent_SetNumberOfRounds");
static_assert(sizeof(HUDScoreboardComponent_SetNumberOfRounds) == 0x000004, "Wrong size on HUDScoreboardComponent_SetNumberOfRounds");
static_assert(offsetof(HUDScoreboardComponent_SetNumberOfRounds, __verse_0x08B5B3E8_newRounds) == 0x000000, "Member 'HUDScoreboardComponent_SetNumberOfRounds::__verse_0x08B5B3E8_newRounds' has a wrong offset!");

// Function VerseFortnite_HUDScoreboardComponent.HUDScoreboardComponent.setPlayerEliminations
// 0x0010 (0x0010 - 0x0000)
struct HUDScoreboardComponent_SetPlayerEliminations final 
{
public:
	class UPlayerComponent*                       __verse_0x9F1D658F_player;                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __verse_0x7B73D331_newElims;                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HUDScoreboardComponent_SetPlayerEliminations) == 0x000008, "Wrong alinment on HUDScoreboardComponent_SetPlayerEliminations");
static_assert(sizeof(HUDScoreboardComponent_SetPlayerEliminations) == 0x000010, "Wrong size on HUDScoreboardComponent_SetPlayerEliminations");
static_assert(offsetof(HUDScoreboardComponent_SetPlayerEliminations, __verse_0x9F1D658F_player) == 0x000000, "Member 'HUDScoreboardComponent_SetPlayerEliminations::__verse_0x9F1D658F_player' has a wrong offset!");
static_assert(offsetof(HUDScoreboardComponent_SetPlayerEliminations, __verse_0x7B73D331_newElims) == 0x000008, "Member 'HUDScoreboardComponent_SetPlayerEliminations::__verse_0x7B73D331_newElims' has a wrong offset!");

// Function VerseFortnite_HUDScoreboardComponent.HUDScoreboardComponent.setPlayerPoints
// 0x0010 (0x0010 - 0x0000)
struct HUDScoreboardComponent_SetPlayerPoints final 
{
public:
	class UPlayerComponent*                       __verse_0x9F1D658F_player;                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __verse_0x7AA5360C_newPoints;                      // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HUDScoreboardComponent_SetPlayerPoints) == 0x000008, "Wrong alinment on HUDScoreboardComponent_SetPlayerPoints");
static_assert(sizeof(HUDScoreboardComponent_SetPlayerPoints) == 0x000010, "Wrong size on HUDScoreboardComponent_SetPlayerPoints");
static_assert(offsetof(HUDScoreboardComponent_SetPlayerPoints, __verse_0x9F1D658F_player) == 0x000000, "Member 'HUDScoreboardComponent_SetPlayerPoints::__verse_0x9F1D658F_player' has a wrong offset!");
static_assert(offsetof(HUDScoreboardComponent_SetPlayerPoints, __verse_0x7AA5360C_newPoints) == 0x000008, "Member 'HUDScoreboardComponent_SetPlayerPoints::__verse_0x7AA5360C_newPoints' has a wrong offset!");

// Function VerseFortnite_HUDScoreboardComponent.HUDScoreboardComponent.setPlayerWins
// 0x0010 (0x0010 - 0x0000)
struct HUDScoreboardComponent_SetPlayerWins final 
{
public:
	class UPlayerComponent*                       __verse_0x9F1D658F_player;                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __verse_0xC0ACBCF1_newWins;                        // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HUDScoreboardComponent_SetPlayerWins) == 0x000008, "Wrong alinment on HUDScoreboardComponent_SetPlayerWins");
static_assert(sizeof(HUDScoreboardComponent_SetPlayerWins) == 0x000010, "Wrong size on HUDScoreboardComponent_SetPlayerWins");
static_assert(offsetof(HUDScoreboardComponent_SetPlayerWins, __verse_0x9F1D658F_player) == 0x000000, "Member 'HUDScoreboardComponent_SetPlayerWins::__verse_0x9F1D658F_player' has a wrong offset!");
static_assert(offsetof(HUDScoreboardComponent_SetPlayerWins, __verse_0xC0ACBCF1_newWins) == 0x000008, "Member 'HUDScoreboardComponent_SetPlayerWins::__verse_0xC0ACBCF1_newWins' has a wrong offset!");

// Function VerseFortnite_HUDScoreboardComponent.HUDScoreboardComponent.SetWidget
// 0x0010 (0x0010 - 0x0000)
struct HUDScoreboardComponent_SetWidget final 
{
public:
	class FString                                 __verse_0x5D4EDCE6_pathToAsset;                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(HUDScoreboardComponent_SetWidget) == 0x000008, "Wrong alinment on HUDScoreboardComponent_SetWidget");
static_assert(sizeof(HUDScoreboardComponent_SetWidget) == 0x000010, "Wrong size on HUDScoreboardComponent_SetWidget");
static_assert(offsetof(HUDScoreboardComponent_SetWidget, __verse_0x5D4EDCE6_pathToAsset) == 0x000000, "Member 'HUDScoreboardComponent_SetWidget::__verse_0x5D4EDCE6_pathToAsset' has a wrong offset!");

// Function VerseFortnite_HUDScoreboardComponent.HUDScoreboardComponent.showMessage
// 0x0010 (0x0010 - 0x0000)
struct HUDScoreboardComponent_ShowMessage final 
{
public:
	class FString                                 __verse_0xD212B012_message;                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(HUDScoreboardComponent_ShowMessage) == 0x000008, "Wrong alinment on HUDScoreboardComponent_ShowMessage");
static_assert(sizeof(HUDScoreboardComponent_ShowMessage) == 0x000010, "Wrong size on HUDScoreboardComponent_ShowMessage");
static_assert(offsetof(HUDScoreboardComponent_ShowMessage, __verse_0xD212B012_message) == 0x000000, "Member 'HUDScoreboardComponent_ShowMessage::__verse_0xD212B012_message' has a wrong offset!");

}

