#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseFortnite_FortBuildingSettingsComponent

#include "Basic.hpp"

#include "VerseFortnite_PlayerSettingState_structs.hpp"


namespace SDK::Params
{

// Function VerseFortnite_FortBuildingSettingsComponent.FortBuildingSettingsComponent.setBuilding
// 0x0001 (0x0001 - 0x0000)
struct FortBuildingSettingsComponent_SetBuilding final 
{
public:
	EPlayerSettingState                           __verse_0xDDCAFCF3_state;                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortBuildingSettingsComponent_SetBuilding) == 0x000001, "Wrong alinment on FortBuildingSettingsComponent_SetBuilding");
static_assert(sizeof(FortBuildingSettingsComponent_SetBuilding) == 0x000001, "Wrong size on FortBuildingSettingsComponent_SetBuilding");
static_assert(offsetof(FortBuildingSettingsComponent_SetBuilding, __verse_0xDDCAFCF3_state) == 0x000000, "Member 'FortBuildingSettingsComponent_SetBuilding::__verse_0xDDCAFCF3_state' has a wrong offset!");

// Function VerseFortnite_FortBuildingSettingsComponent.FortBuildingSettingsComponent.setBuildingOnWater
// 0x0001 (0x0001 - 0x0000)
struct FortBuildingSettingsComponent_SetBuildingOnWater final 
{
public:
	EPlayerSettingState                           __verse_0xDDCAFCF3_state;                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortBuildingSettingsComponent_SetBuildingOnWater) == 0x000001, "Wrong alinment on FortBuildingSettingsComponent_SetBuildingOnWater");
static_assert(sizeof(FortBuildingSettingsComponent_SetBuildingOnWater) == 0x000001, "Wrong size on FortBuildingSettingsComponent_SetBuildingOnWater");
static_assert(offsetof(FortBuildingSettingsComponent_SetBuildingOnWater, __verse_0xDDCAFCF3_state) == 0x000000, "Member 'FortBuildingSettingsComponent_SetBuildingOnWater::__verse_0xDDCAFCF3_state' has a wrong offset!");

// Function VerseFortnite_FortBuildingSettingsComponent.FortBuildingSettingsComponent.setEditing
// 0x0001 (0x0001 - 0x0000)
struct FortBuildingSettingsComponent_SetEditing final 
{
public:
	EPlayerSettingState                           __verse_0xDDCAFCF3_state;                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortBuildingSettingsComponent_SetEditing) == 0x000001, "Wrong alinment on FortBuildingSettingsComponent_SetEditing");
static_assert(sizeof(FortBuildingSettingsComponent_SetEditing) == 0x000001, "Wrong size on FortBuildingSettingsComponent_SetEditing");
static_assert(offsetof(FortBuildingSettingsComponent_SetEditing, __verse_0xDDCAFCF3_state) == 0x000000, "Member 'FortBuildingSettingsComponent_SetEditing::__verse_0xDDCAFCF3_state' has a wrong offset!");

// Function VerseFortnite_FortBuildingSettingsComponent.FortBuildingSettingsComponent.setEditingHostile
// 0x0001 (0x0001 - 0x0000)
struct FortBuildingSettingsComponent_SetEditingHostile final 
{
public:
	EPlayerSettingState                           __verse_0xDDCAFCF3_state;                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortBuildingSettingsComponent_SetEditingHostile) == 0x000001, "Wrong alinment on FortBuildingSettingsComponent_SetEditingHostile");
static_assert(sizeof(FortBuildingSettingsComponent_SetEditingHostile) == 0x000001, "Wrong size on FortBuildingSettingsComponent_SetEditingHostile");
static_assert(offsetof(FortBuildingSettingsComponent_SetEditingHostile, __verse_0xDDCAFCF3_state) == 0x000000, "Member 'FortBuildingSettingsComponent_SetEditingHostile::__verse_0xDDCAFCF3_state' has a wrong offset!");

// Function VerseFortnite_FortBuildingSettingsComponent.FortBuildingSettingsComponent.setTrapPlacement
// 0x0001 (0x0001 - 0x0000)
struct FortBuildingSettingsComponent_SetTrapPlacement final 
{
public:
	EPlayerSettingState                           __verse_0xDDCAFCF3_state;                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortBuildingSettingsComponent_SetTrapPlacement) == 0x000001, "Wrong alinment on FortBuildingSettingsComponent_SetTrapPlacement");
static_assert(sizeof(FortBuildingSettingsComponent_SetTrapPlacement) == 0x000001, "Wrong size on FortBuildingSettingsComponent_SetTrapPlacement");
static_assert(offsetof(FortBuildingSettingsComponent_SetTrapPlacement, __verse_0xDDCAFCF3_state) == 0x000000, "Member 'FortBuildingSettingsComponent_SetTrapPlacement::__verse_0xDDCAFCF3_state' has a wrong offset!");

}

