#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseFortnite_Player_PlayerStasis

#include "Basic.hpp"


namespace SDK::Params
{

// Function VerseFortnite_Player_PlayerStasis.PlayerStasis.putInStasis
// 0x0008 (0x0008 - 0x0000)
struct PlayerStasis_PutInStasis final 
{
public:
	class UPlayerComponent*                       __verse_0x9F1D658F_player;                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerStasis_PutInStasis) == 0x000008, "Wrong alinment on PlayerStasis_PutInStasis");
static_assert(sizeof(PlayerStasis_PutInStasis) == 0x000008, "Wrong size on PlayerStasis_PutInStasis");
static_assert(offsetof(PlayerStasis_PutInStasis, __verse_0x9F1D658F_player) == 0x000000, "Member 'PlayerStasis_PutInStasis::__verse_0x9F1D658F_player' has a wrong offset!");

// Function VerseFortnite_Player_PlayerStasis.PlayerStasis.putInStasisAdvanced
// 0x0010 (0x0010 - 0x0000)
struct PlayerStasis_PutInStasisAdvanced final 
{
public:
	class UPlayerComponent*                       __verse_0x9F1D658F_player;                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __verse_0x294A1F71_allowTurning : 1;               // 0x0008(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, NoDestructor))
	uint8                                         BitPad_8D : 7;                                     // 0x0008(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         __verse_0x8045D801_allowFalling : 1;               // 0x0009(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, NoDestructor))
	uint8                                         BitPad_8E : 7;                                     // 0x0009(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         __verse_0x9090278F_allowEmotes : 1;                // 0x000A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, NoDestructor))
};
static_assert(alignof(PlayerStasis_PutInStasisAdvanced) == 0x000008, "Wrong alinment on PlayerStasis_PutInStasisAdvanced");
static_assert(sizeof(PlayerStasis_PutInStasisAdvanced) == 0x000010, "Wrong size on PlayerStasis_PutInStasisAdvanced");
static_assert(offsetof(PlayerStasis_PutInStasisAdvanced, __verse_0x9F1D658F_player) == 0x000000, "Member 'PlayerStasis_PutInStasisAdvanced::__verse_0x9F1D658F_player' has a wrong offset!");

// Function VerseFortnite_Player_PlayerStasis.PlayerStasis.releaseFromStasis
// 0x0008 (0x0008 - 0x0000)
struct PlayerStasis_ReleaseFromStasis final 
{
public:
	class UPlayerComponent*                       __verse_0x9F1D658F_player;                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerStasis_ReleaseFromStasis) == 0x000008, "Wrong alinment on PlayerStasis_ReleaseFromStasis");
static_assert(sizeof(PlayerStasis_ReleaseFromStasis) == 0x000008, "Wrong size on PlayerStasis_ReleaseFromStasis");
static_assert(offsetof(PlayerStasis_ReleaseFromStasis, __verse_0x9F1D658F_player) == 0x000000, "Member 'PlayerStasis_ReleaseFromStasis::__verse_0x9F1D658F_player' has a wrong offset!");

}

