#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseFortnite_Input_VerseFortniteInputComponent

#include "Basic.hpp"

#include "VerseFortnite_Input_VerseKey_structs.hpp"


namespace SDK::Params
{

// Function VerseFortnite_Input_VerseFortniteInputComponent.VerseFortniteInputComponent.addActionBindingForPlayer
// 0x0040 (0x0040 - 0x0000)
struct VerseFortniteInputComponent_AddActionBindingForPlayer final 
{
public:
	class UPlayerComponent*                       __verse_0x9F1D658F_player;                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 __verse_0x45A29901_name;                           // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 __verse_0x6616878E_description;                    // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash)
	TArray<EVerseKey>                             __verse_0xBE7345F5_keys;                           // 0x0028(0x0010)(Parm, HasGetValueTypeHash)
	class UPulseEvent*                            RetVal;                                            // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VerseFortniteInputComponent_AddActionBindingForPlayer) == 0x000008, "Wrong alinment on VerseFortniteInputComponent_AddActionBindingForPlayer");
static_assert(sizeof(VerseFortniteInputComponent_AddActionBindingForPlayer) == 0x000040, "Wrong size on VerseFortniteInputComponent_AddActionBindingForPlayer");
static_assert(offsetof(VerseFortniteInputComponent_AddActionBindingForPlayer, __verse_0x9F1D658F_player) == 0x000000, "Member 'VerseFortniteInputComponent_AddActionBindingForPlayer::__verse_0x9F1D658F_player' has a wrong offset!");
static_assert(offsetof(VerseFortniteInputComponent_AddActionBindingForPlayer, __verse_0x45A29901_name) == 0x000008, "Member 'VerseFortniteInputComponent_AddActionBindingForPlayer::__verse_0x45A29901_name' has a wrong offset!");
static_assert(offsetof(VerseFortniteInputComponent_AddActionBindingForPlayer, __verse_0x6616878E_description) == 0x000018, "Member 'VerseFortniteInputComponent_AddActionBindingForPlayer::__verse_0x6616878E_description' has a wrong offset!");
static_assert(offsetof(VerseFortniteInputComponent_AddActionBindingForPlayer, __verse_0xBE7345F5_keys) == 0x000028, "Member 'VerseFortniteInputComponent_AddActionBindingForPlayer::__verse_0xBE7345F5_keys' has a wrong offset!");
static_assert(offsetof(VerseFortniteInputComponent_AddActionBindingForPlayer, RetVal) == 0x000038, "Member 'VerseFortniteInputComponent_AddActionBindingForPlayer::RetVal' has a wrong offset!");

// Function VerseFortnite_Input_VerseFortniteInputComponent.VerseFortniteInputComponent.clearActionBindingsForPlayer
// 0x0008 (0x0008 - 0x0000)
struct VerseFortniteInputComponent_ClearActionBindingsForPlayer final 
{
public:
	class UPlayerComponent*                       __verse_0x9F1D658F_player;                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VerseFortniteInputComponent_ClearActionBindingsForPlayer) == 0x000008, "Wrong alinment on VerseFortniteInputComponent_ClearActionBindingsForPlayer");
static_assert(sizeof(VerseFortniteInputComponent_ClearActionBindingsForPlayer) == 0x000008, "Wrong size on VerseFortniteInputComponent_ClearActionBindingsForPlayer");
static_assert(offsetof(VerseFortniteInputComponent_ClearActionBindingsForPlayer, __verse_0x9F1D658F_player) == 0x000000, "Member 'VerseFortniteInputComponent_ClearActionBindingsForPlayer::__verse_0x9F1D658F_player' has a wrong offset!");

// Function VerseFortnite_Input_VerseFortniteInputComponent.VerseFortniteInputComponent.removeActionBindingForPlayer
// 0x0018 (0x0018 - 0x0000)
struct VerseFortniteInputComponent_RemoveActionBindingForPlayer final 
{
public:
	class UPlayerComponent*                       __verse_0x9F1D658F_player;                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 __verse_0x45A29901_name;                           // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(VerseFortniteInputComponent_RemoveActionBindingForPlayer) == 0x000008, "Wrong alinment on VerseFortniteInputComponent_RemoveActionBindingForPlayer");
static_assert(sizeof(VerseFortniteInputComponent_RemoveActionBindingForPlayer) == 0x000018, "Wrong size on VerseFortniteInputComponent_RemoveActionBindingForPlayer");
static_assert(offsetof(VerseFortniteInputComponent_RemoveActionBindingForPlayer, __verse_0x9F1D658F_player) == 0x000000, "Member 'VerseFortniteInputComponent_RemoveActionBindingForPlayer::__verse_0x9F1D658F_player' has a wrong offset!");
static_assert(offsetof(VerseFortniteInputComponent_RemoveActionBindingForPlayer, __verse_0x45A29901_name) == 0x000008, "Member 'VerseFortniteInputComponent_RemoveActionBindingForPlayer::__verse_0x45A29901_name' has a wrong offset!");

}

