#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseFortnite_Datastore_DatastoreComponent

#include "Basic.hpp"


namespace SDK::Params
{

// Function VerseFortnite_Datastore_DatastoreComponent.DatastoreComponent.clearAllDatastoreValues
// 0x0008 (0x0008 - 0x0000)
struct DatastoreComponent_ClearAllDatastoreValues final 
{
public:
	class UPlayerComponent*                       __verse_0x9F1D658F_player;                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DatastoreComponent_ClearAllDatastoreValues) == 0x000008, "Wrong alinment on DatastoreComponent_ClearAllDatastoreValues");
static_assert(sizeof(DatastoreComponent_ClearAllDatastoreValues) == 0x000008, "Wrong size on DatastoreComponent_ClearAllDatastoreValues");
static_assert(offsetof(DatastoreComponent_ClearAllDatastoreValues, __verse_0x9F1D658F_player) == 0x000000, "Member 'DatastoreComponent_ClearAllDatastoreValues::__verse_0x9F1D658F_player' has a wrong offset!");

// Function VerseFortnite_Datastore_DatastoreComponent.DatastoreComponent.setDatastoreValue
// 0x0028 (0x0028 - 0x0000)
struct DatastoreComponent_SetDatastoreValue final 
{
public:
	class UPlayerComponent*                       __verse_0x9F1D658F_player;                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 __verse_0xA04F29AC_key;                            // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 __verse_0x3AF80D16_value;                          // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(DatastoreComponent_SetDatastoreValue) == 0x000008, "Wrong alinment on DatastoreComponent_SetDatastoreValue");
static_assert(sizeof(DatastoreComponent_SetDatastoreValue) == 0x000028, "Wrong size on DatastoreComponent_SetDatastoreValue");
static_assert(offsetof(DatastoreComponent_SetDatastoreValue, __verse_0x9F1D658F_player) == 0x000000, "Member 'DatastoreComponent_SetDatastoreValue::__verse_0x9F1D658F_player' has a wrong offset!");
static_assert(offsetof(DatastoreComponent_SetDatastoreValue, __verse_0xA04F29AC_key) == 0x000008, "Member 'DatastoreComponent_SetDatastoreValue::__verse_0xA04F29AC_key' has a wrong offset!");
static_assert(offsetof(DatastoreComponent_SetDatastoreValue, __verse_0x3AF80D16_value) == 0x000018, "Member 'DatastoreComponent_SetDatastoreValue::__verse_0x3AF80D16_value' has a wrong offset!");

}

