#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseFortnite_FortniteBuildingComponent

#include "Basic.hpp"


namespace SDK::Params
{

// Function VerseFortnite_FortniteBuildingComponent.FortniteBuildingComponent.canBeDamaged
// 0x0001 (0x0001 - 0x0000)
struct FortniteBuildingComponent_CanBeDamaged final 
{
public:
	uint8                                         RetVal : 1;                                        // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor))
};
static_assert(alignof(FortniteBuildingComponent_CanBeDamaged) == 0x000001, "Wrong alinment on FortniteBuildingComponent_CanBeDamaged");
static_assert(sizeof(FortniteBuildingComponent_CanBeDamaged) == 0x000001, "Wrong size on FortniteBuildingComponent_CanBeDamaged");

// Function VerseFortnite_FortniteBuildingComponent.FortniteBuildingComponent.canBeReplaced
// 0x0001 (0x0001 - 0x0000)
struct FortniteBuildingComponent_CanBeReplaced final 
{
public:
	uint8                                         RetVal : 1;                                        // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor))
};
static_assert(alignof(FortniteBuildingComponent_CanBeReplaced) == 0x000001, "Wrong alinment on FortniteBuildingComponent_CanBeReplaced");
static_assert(sizeof(FortniteBuildingComponent_CanBeReplaced) == 0x000001, "Wrong size on FortniteBuildingComponent_CanBeReplaced");

// Function VerseFortnite_FortniteBuildingComponent.FortniteBuildingComponent.SetCanBeDamaged
// 0x0001 (0x0001 - 0x0000)
struct FortniteBuildingComponent_SetCanBeDamaged final 
{
public:
	uint8                                         __verse_0x21010F99_canDamage : 1;                  // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, NoDestructor))
};
static_assert(alignof(FortniteBuildingComponent_SetCanBeDamaged) == 0x000001, "Wrong alinment on FortniteBuildingComponent_SetCanBeDamaged");
static_assert(sizeof(FortniteBuildingComponent_SetCanBeDamaged) == 0x000001, "Wrong size on FortniteBuildingComponent_SetCanBeDamaged");

// Function VerseFortnite_FortniteBuildingComponent.FortniteBuildingComponent.setCanBeReplaced
// 0x0001 (0x0001 - 0x0000)
struct FortniteBuildingComponent_SetCanBeReplaced final 
{
public:
	uint8                                         __verse_0x194FD13B_canReplace : 1;                 // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, NoDestructor))
};
static_assert(alignof(FortniteBuildingComponent_SetCanBeReplaced) == 0x000001, "Wrong alinment on FortniteBuildingComponent_SetCanBeReplaced");
static_assert(sizeof(FortniteBuildingComponent_SetCanBeReplaced) == 0x000001, "Wrong size on FortniteBuildingComponent_SetCanBeReplaced");

// Function VerseFortnite_FortniteBuildingComponent.FortniteBuildingComponent.wasPlayerBuilt
// 0x0001 (0x0001 - 0x0000)
struct FortniteBuildingComponent_WasPlayerBuilt final 
{
public:
	uint8                                         RetVal : 1;                                        // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor))
};
static_assert(alignof(FortniteBuildingComponent_WasPlayerBuilt) == 0x000001, "Wrong alinment on FortniteBuildingComponent_WasPlayerBuilt");
static_assert(sizeof(FortniteBuildingComponent_WasPlayerBuilt) == 0x000001, "Wrong size on FortniteBuildingComponent_WasPlayerBuilt");

}

