#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_AvailableSparks

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_AvailableSparks.W_AvailableSparks_C
// 0x0058 (0x0320 - 0x02C8)
class UW_AvailableSparks_C final  : public UFortCommunityVotingAvailableVotesWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Idle;                                              // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Idle_to_LastDayMessage;                            // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Idle_to_countdown;                                 // 0x02E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Decrement;                                         // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Increment;                                         // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Com_LikeCounter_BG;                                // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Com_LikeCounter_BG_5;                              // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Com_LikeCounter_BG_6;                              // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FlameInCounter;                                    // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FlameInCounter_2;                                  // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void PlayIncreaseVote();
	void PlayDecreaseVote();
	void PlayCountdown(float StartValue);
	void PlayEventOver(float StartValue);
	void PlayAvailableVotes();
	void PlayIdle();
	void ExecuteUbergraph_W_AvailableSparks(int32 EntryPoint, float K2Node_Event_StartValue_1, float K2Node_Event_StartValue, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue_1, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue_2, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue_3, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_1, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue_4, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue_5);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_AvailableSparks_C">();
	}
	static class UW_AvailableSparks_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_AvailableSparks_C>();
	}
};
static_assert(alignof(UW_AvailableSparks_C) == 0x000008, "Wrong alinment on UW_AvailableSparks_C");
static_assert(sizeof(UW_AvailableSparks_C) == 0x000320, "Wrong size on UW_AvailableSparks_C");
static_assert(offsetof(UW_AvailableSparks_C, UberGraphFrame) == 0x0002C8, "Member 'UW_AvailableSparks_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_AvailableSparks_C, Idle) == 0x0002D0, "Member 'UW_AvailableSparks_C::Idle' has a wrong offset!");
static_assert(offsetof(UW_AvailableSparks_C, Idle_to_LastDayMessage) == 0x0002D8, "Member 'UW_AvailableSparks_C::Idle_to_LastDayMessage' has a wrong offset!");
static_assert(offsetof(UW_AvailableSparks_C, Idle_to_countdown) == 0x0002E0, "Member 'UW_AvailableSparks_C::Idle_to_countdown' has a wrong offset!");
static_assert(offsetof(UW_AvailableSparks_C, Decrement) == 0x0002E8, "Member 'UW_AvailableSparks_C::Decrement' has a wrong offset!");
static_assert(offsetof(UW_AvailableSparks_C, Increment) == 0x0002F0, "Member 'UW_AvailableSparks_C::Increment' has a wrong offset!");
static_assert(offsetof(UW_AvailableSparks_C, Com_LikeCounter_BG) == 0x0002F8, "Member 'UW_AvailableSparks_C::Com_LikeCounter_BG' has a wrong offset!");
static_assert(offsetof(UW_AvailableSparks_C, Com_LikeCounter_BG_5) == 0x000300, "Member 'UW_AvailableSparks_C::Com_LikeCounter_BG_5' has a wrong offset!");
static_assert(offsetof(UW_AvailableSparks_C, Com_LikeCounter_BG_6) == 0x000308, "Member 'UW_AvailableSparks_C::Com_LikeCounter_BG_6' has a wrong offset!");
static_assert(offsetof(UW_AvailableSparks_C, FlameInCounter) == 0x000310, "Member 'UW_AvailableSparks_C::FlameInCounter' has a wrong offset!");
static_assert(offsetof(UW_AvailableSparks_C, FlameInCounter_2) == 0x000318, "Member 'UW_AvailableSparks_C::FlameInCounter_2' has a wrong offset!");

}

