#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_AudioAnalysis_FloatGraph

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_AudioAnalysis_FloatGraph.WB_AudioAnalysis_FloatGraph_C
// 0x0070 (0x02D0 - 0x0260)
class UWB_AudioAnalysis_FloatGraph_C final  : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           CanvasPanel_0;                                     // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Label_;                                            // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar;                                       // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Value;                                             // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FVector2D                              Position;                                          // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Size;                                              // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Calculated;                                        // 0x0298(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_741C[0x3];                                     // 0x0299(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Parameter;                                         // 0x029C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_741D[0x4];                                     // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector2D>                      Points;                                            // 0x02A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         NumPoints;                                         // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color;                                             // 0x02BC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         VectorIndex;                                       // 0x02CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_AudioAnalysis_FloatGraph(int32 EntryPoint, int32 Temp_int_Variable, bool CallFunc_EqualEqual_IntInt_ReturnValue, const class FString& CallFunc_Conv_NameToString_ReturnValue, bool CallFunc_NotEqual_IntInt_ReturnValue, const class FString& CallFunc_Conv_IntToString_ReturnValue, class FName K2Node_CustomEvent_Parameter, class UMaterialParameterCollection* K2Node_CustomEvent_Collection, int32 K2Node_CustomEvent_VectorIndex, const class FString& CallFunc_SelectString_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue, const struct FLinearColor& CallFunc_GetVectorParameterValue_ReturnValue, class FText CallFunc_Conv_StringToText_ReturnValue, float CallFunc_BreakColor_R, float CallFunc_BreakColor_G, float CallFunc_BreakColor_B, float CallFunc_BreakColor_A, float CallFunc_GetScalarParameterValue_ReturnValue, float K2Node_Select_Default, class FText CallFunc_Conv_FloatToText_ReturnValue, class FText CallFunc_Conv_FloatToText_ReturnValue_1, const struct FGeometry& K2Node_Event_MyGeometry, float K2Node_Event_InDeltaTime, bool K2Node_Event_IsDesignTime);
	void Initialize_MPC(class FName Param_Parameter, class UMaterialParameterCollection* Collection, int32 Param_VectorIndex);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void Set_Value(float Param_Value, float CallFunc_Subtract_FloatFloat_ReturnValue, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, float CallFunc_BreakVector2D_X, float CallFunc_BreakVector2D_Y, float CallFunc_BreakVector2D_X_1, float CallFunc_BreakVector2D_Y_1, float CallFunc_Multiply_FloatFloat_ReturnValue, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue, float CallFunc_Conv_IntToFloat_ReturnValue, float CallFunc_Divide_FloatFloat_ReturnValue, float CallFunc_Conv_IntToFloat_ReturnValue_1, float CallFunc_Multiply_IntFloat_ReturnValue, float CallFunc_Divide_FloatFloat_ReturnValue_1, const struct FVector2D& CallFunc_Array_Get_Item, int32 CallFunc_Array_Add_ReturnValue, float CallFunc_BreakVector2D_X_2, float CallFunc_BreakVector2D_Y_2, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue_1, int32 CallFunc_Array_Length_ReturnValue, float CallFunc_Conv_IntToFloat_ReturnValue_2, bool CallFunc_Greater_IntInt_ReturnValue, float CallFunc_Multiply_FloatFloat_ReturnValue_1, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue_2, int32 CallFunc_Array_Length_ReturnValue_1, int32 CallFunc_Array_Add_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue);
	void CalcWidgetSize(const struct FGeometry& Geom, const struct FVector2D& CallFunc_GetLocalSize_ReturnValue, float CallFunc_BreakVector2D_X, float CallFunc_BreakVector2D_Y, float CallFunc_Subtract_FloatFloat_ReturnValue, float CallFunc_Subtract_FloatFloat_ReturnValue_1, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue);

	void OnPaint(struct FPaintContext& Context) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_AudioAnalysis_FloatGraph_C">();
	}
	static class UWB_AudioAnalysis_FloatGraph_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_AudioAnalysis_FloatGraph_C>();
	}
};
static_assert(alignof(UWB_AudioAnalysis_FloatGraph_C) == 0x000008, "Wrong alinment on UWB_AudioAnalysis_FloatGraph_C");
static_assert(sizeof(UWB_AudioAnalysis_FloatGraph_C) == 0x0002D0, "Wrong size on UWB_AudioAnalysis_FloatGraph_C");
static_assert(offsetof(UWB_AudioAnalysis_FloatGraph_C, UberGraphFrame) == 0x000260, "Member 'UWB_AudioAnalysis_FloatGraph_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_AudioAnalysis_FloatGraph_C, CanvasPanel_0) == 0x000268, "Member 'UWB_AudioAnalysis_FloatGraph_C::CanvasPanel_0' has a wrong offset!");
static_assert(offsetof(UWB_AudioAnalysis_FloatGraph_C, Label_) == 0x000270, "Member 'UWB_AudioAnalysis_FloatGraph_C::Label_' has a wrong offset!");
static_assert(offsetof(UWB_AudioAnalysis_FloatGraph_C, ProgressBar) == 0x000278, "Member 'UWB_AudioAnalysis_FloatGraph_C::ProgressBar' has a wrong offset!");
static_assert(offsetof(UWB_AudioAnalysis_FloatGraph_C, Value) == 0x000280, "Member 'UWB_AudioAnalysis_FloatGraph_C::Value' has a wrong offset!");
static_assert(offsetof(UWB_AudioAnalysis_FloatGraph_C, Position) == 0x000288, "Member 'UWB_AudioAnalysis_FloatGraph_C::Position' has a wrong offset!");
static_assert(offsetof(UWB_AudioAnalysis_FloatGraph_C, Size) == 0x000290, "Member 'UWB_AudioAnalysis_FloatGraph_C::Size' has a wrong offset!");
static_assert(offsetof(UWB_AudioAnalysis_FloatGraph_C, Calculated) == 0x000298, "Member 'UWB_AudioAnalysis_FloatGraph_C::Calculated' has a wrong offset!");
static_assert(offsetof(UWB_AudioAnalysis_FloatGraph_C, Parameter) == 0x00029C, "Member 'UWB_AudioAnalysis_FloatGraph_C::Parameter' has a wrong offset!");
static_assert(offsetof(UWB_AudioAnalysis_FloatGraph_C, Points) == 0x0002A8, "Member 'UWB_AudioAnalysis_FloatGraph_C::Points' has a wrong offset!");
static_assert(offsetof(UWB_AudioAnalysis_FloatGraph_C, NumPoints) == 0x0002B8, "Member 'UWB_AudioAnalysis_FloatGraph_C::NumPoints' has a wrong offset!");
static_assert(offsetof(UWB_AudioAnalysis_FloatGraph_C, Color) == 0x0002BC, "Member 'UWB_AudioAnalysis_FloatGraph_C::Color' has a wrong offset!");
static_assert(offsetof(UWB_AudioAnalysis_FloatGraph_C, VectorIndex) == 0x0002CC, "Member 'UWB_AudioAnalysis_FloatGraph_C::VectorIndex' has a wrong offset!");

}

