#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Windowchromebuttons

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass windowchromebuttons.windowchromebuttons_C
// 0x0020 (0x02A8 - 0x0288)
class UWindowchromebuttons_C final  : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0288(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOut;                                           // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWindowTitleBarArea*                    WindowTitleBarArea_107;                            // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_windowchromebuttons(int32 EntryPoint, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue, const struct FGeometry& K2Node_Event_MyGeometry, struct FPointerEvent& K2Node_Event_MouseEvent_1, struct FPointerEvent& K2Node_Event_MouseEvent, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue_1);
	void OnMouseLeave(struct FPointerEvent& MouseEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, struct FPointerEvent& MouseEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"windowchromebuttons_C">();
	}
	static class UWindowchromebuttons_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWindowchromebuttons_C>();
	}
};
static_assert(alignof(UWindowchromebuttons_C) == 0x000008, "Wrong alinment on UWindowchromebuttons_C");
static_assert(sizeof(UWindowchromebuttons_C) == 0x0002A8, "Wrong size on UWindowchromebuttons_C");
static_assert(offsetof(UWindowchromebuttons_C, UberGraphFrame) == 0x000288, "Member 'UWindowchromebuttons_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWindowchromebuttons_C, FadeOut) == 0x000290, "Member 'UWindowchromebuttons_C::FadeOut' has a wrong offset!");
static_assert(offsetof(UWindowchromebuttons_C, FadeIn) == 0x000298, "Member 'UWindowchromebuttons_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UWindowchromebuttons_C, WindowTitleBarArea_107) == 0x0002A0, "Member 'UWindowchromebuttons_C::WindowTitleBarArea_107' has a wrong offset!");

}

